000000 IDENTIFICATION  DIVISION.
000001 PROGRAM-ID.  CHECKBOR.
000002 AUTHOR.  CCF.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 
000007 FILE-CONTROL.
000008     SELECT FBRVDDL ASSIGN TO "FBRVDDL"
000009                    ORGANIZATION LINE SEQUENTIAL
000010                    FILE STATUS IS FBRVDDL-STATUS.
000011     SELECT BRANCH  ASSIGN TO "BRANCH"
000012                    ORGANIZATION LINE SEQUENTIAL
000013                    FILE STATUS IS BRANCH-STATUS.
000011     SELECT LONERR  ASSIGN TO "LONERR"
000012                    ORGANIZATION LINE SEQUENTIAL
000013                    FILE STATUS IS LONERR-STATUS.
000014 
000015 DATA DIVISION.
000016 FILE SECTION.
000017 FD  LONERR.
000018     01 LONERR-REC.
000019        03 ERR-ACCOUNT   PIC X(19).
000000        03 ERR-DESC       PIC X(80).
000017 FD  FBRVDDL.
000018     01 FBRVDDL-REC.
000019        02 FBRVDDL-DESC                     PIC X(480).
000020*
000021 FD  BRANCH.                                     
000022     01  BRANCH-REC                          PIC X(1716).
000023 WORKING-STORAGE SECTION.
000024 01 RPYV-ALL-9.
000025    03 ALL-P-AMT-9 PIC 9(14)V9(3).
000026    03 ALL-I-AMT-9 PIC 9(14)V9(3).
000027    03 ALL-W-AMT-9 PIC 9(14)V9(3).
000028    03 ALL-A-AMT-9 PIC 9(14)V9(3).
000029    03 ALL-E-AMT-9 PIC 9(14)V9(3).
000030 01 RPYV-ALL-Z.
000031    03 ALL-P-AMT-Z PIC Z(13)9.9(3)-.
000032    03 ALL-I-AMT-Z PIC Z(13)9.9(3)-.
000033    03 ALL-W-AMT-Z PIC Z(13)9.9(3)-.
000034    03 ALL-A-AMT-Z PIC Z(13)9.9(3)-.
000035    03 ALL-E-AMT-Z PIC Z(13)9.9(3)-.
000000 01 IN-DUE-AMT PIC S9(14)V9(3).
000036 01 RPYV-HAS-ERR PIC X.
000000 01 RPYV-RECORDS PIC 9(4).
000037 01 WS-FINE1-INT-RATE PIC S9(3)V9(4).
000038 01 WS-FINE2-INT-RATE PIC S9(3)V9(4).
000039 01 CALCULATED-INT-ACCR   PIC S9(12)V9(5).
000040 01 CALCULATED-LOAN-TERM  PIC 9(4).
000041 01 TEMP-SUM-ARREARS-CNT  PIC 9(4).
000042 01 WS-ARR-INT-INCR       PIC S9(12)V9(5).
000043 01 WS-FINE1-INCR         PIC S9(12)V9(5).
000044 01 WS-FINE2-INCR         PIC S9(12)V9(5).
000045 01 D-VALUE-Z  PIC Z(9)Z.9(5)-.
000046 01 D-VALUE-9 PIC S9(10)V9(5).
000047 01 IN-CALC-AMT-Z  PIC Z(11)Z.9(5)-.
000048 01 IN-CALC-AMT-9 PIC S9(12)V9(5).
000049 01 TEMP-BORMR-INT-INCR PIC S9(12)V9(5).
000050 01 TEMP-STAT     PIC 99.
000051 01 TEMP-RT-INCR  PIC Z9.9(5)-.
000052 01 TEMP-APPLIC-ISSUE-DATE PIC X(9).
000053 01 TEMP-APPLIC-AMOUNT PIC Z(13)9.9(3)-.
000054 01 TEMP-APP-AMT PIC Z(13)9.9(3)-.
000055 01 TEMP-ADV-VAL PIC Z(13)9.9(3)-.
000056 01 TEMP-INTEREST PIC Z(11)9.9(5)-.
000057 01 TEMP-APPRV-DATE PIC X(9).
000058 01 TEMP-DUE-AMT PIC Z(13)9.9(3)-.
000059 01 TEMP-LOAN-REPAY PIC Z(13)9.9(3)-.
000060 01 TEMP-LST-FIN-DATE PIC X(9).
000061 01 TEMP-ADV-DATE  PIC X(9).
000062 01 TEMP-DUE-STRT-DATE PIC X(9).
000063 01 TEMP-INT-ACCR PIC Z(11)9.9(5)-.
000064 01 TEMP-INT-INCR PIC Z(11)9.9(5)-.
000065 01 TEMP-RT-INCR-MAX-PERC PIC Z(2)9.9(5)-.
000066 01 TEMP-RT-INCR-MIN-PERC PIC Z(2)9.9(5)-.
000067 01 TEMP-RT-INCR-MAX-VALUE  PIC Z(2)9.9(5)-.
000068 01 TEMP-RT-INCR-MIN-VALUE PIC Z(2)9.9(5)-.
000069 01 TEMP-INT-RATE  PIC Z(2)9.9(4)-.
000070 01 TEMP-UNEARNED-INT PIC Z(13)9.9(3)-.
000071 01 TEMP-BOIS-BUCKET-10 PIC Z(13)9.9(3)-.
000072 01 TEMP-BOIS-BUCKET-09  PIC Z(13)9.9(3)-.
000073 01 TEMP-BOIS-BUCKET-08  PIC Z(13)9.9(3)-.
000074 01 TEMP-BOIS-BUCKET-07  PIC Z(13)9.9(3)-.
000075 01 TEMP-BOIS-BUCKET-06 PIC Z(13)9.9(3)-.
000076 01 TEMP-LAST-TERM-PAID PIC X(6).
000077 01 TEMP-INT-STRT-DATE  PIC X(9).
000078 01 TEMP-REPAY-TYPE   PIC X(5).
000079 01 TEMP-NEXT-DUE-DATE  PIC X(9).
000080 01 TEMP-LAST-TERM-UNPAID  PIC X(5).
000081 01 TEMP-BAD-DEBT-TRF-DTE PIC X(9).
000082 01 TEMP-TOT-BAD-DEBT-AMT  PIC Z(13)9.9(3)-.
000083 01 TEMP-GL-TRF-ORG-AMT-P   PIC Z(13)9.9(3)-.
000084 01 TEMP-GL-TRF-ORG-AMT-I   PIC Z(13)9.9(3)-.
000085 01 TEMP-REM-REPAYS  PIC X(6).
000086 01 TEMP-FINE1-RT-INCR-MAX-VALUE PIC Z9.9(5)-.
000087 01 TEMP-FINE1-RT-INCR-MIN-VALUE PIC Z9.9(5)-.
000088 01 TEMP-FST-DRWDWN-DATE  PIC X(9).
000089 01 TEMP-PREV-DUE-DATE PIC X(9).
000090 01 TEMP-FINE1-RT-INCR-MAX-PREC PIC Z9.9(5)-.
000091 01 TEMP-FINE1-RT-INCR-MIN-PERC PIC Z9.9(5)-.
000092 01 TEMP-FINE1-RT-INCR  PIC Z9.9(5)-.
000093 01 TEMP-FINE2-INT-INCR  PIC Z(11)9.9(5)-.
000094 01 TEMP-FINE2-INT-ACCR  PIC Z(11)9.9(5)-.
000095 01 TEMP-FINE2-RT-INCR PIC Z9.9(5)-.
000096 01 TEMP-STORE-RATE PIC Z9.9(5)-.
000097 01 TEMP-UNPD-ARR-PRN-BAL  PIC Z(13)9.9(3)-. 
000098 01 TEMP-UNPD-INT-ARR-PRN PIC Z(13)9.9(3)-.
000099 01 TEMP-FEE-PRVN-AMT PIC Z(13)9.9(3)-.
000100 01 TEMP-MIN-REPAY-AMT-PC  PIC Z(13)9.9(3)-.
000101 01 TEMP-THEO-LOAN-BAL  PIC Z(13)9.9(3)-.
000102 01 TEMP-UNPD-CHRG-BAL  PIC Z(13)9.9(3)-.
000103 01 TEMP-LOAN-BAL PIC Z(13)9.9(3)-.
000104 01 TEMP-CAP-UNPD-INT  PIC Z(11)9.9(5)-.
000105 01 TEMP-FIRST-ADV-DATE  PIC X(9).
000106 01 TEMP-LOAN-TRM    PIC X(5).
000107 01 TEMP-DATE-OF-GRADUATION PIC X(9).
000108 01 TEMP-UNPD-ARRS-INT-BAL PIC Z(13)9.9(3)-.
000109 01 TEMP-UNPD-PRIN-BAL PIC Z(13)9.9(3)-.
000110 01 TEMP-ARR-INT-INCR  PIC Z(11)9.9(5)-.
000111 01 TEMP-ARR-INT-ACCR PIC Z(13)9.9(3)-.
000112 01 TEMP-INCR-DEG PIC Z(13)9.9(3)-.
000113 01 TEMP-SUM-REPAY-AMT PIC Z(13)9.9(3)-.
000114 01 TEMP-SUN-REPAY-CNT PIC 9(4).
000115 01 TEMP-SUM-REPAY-INT-AMT PIC Z(13)9.9(3)-.
000116 01 TEMP-PROM-PREV-AMT  PIC Z(13)9.9(3)-.
000117 01 TEMP-PROV-CURT-DATE PIC X(9).
000118 01 TEMP-PROV-AMOUNT  PIC Z(13)9.9(3)-. 
000119 01 TEMP-ACT-FIRST-RPY-DAY PIC X(9).
000120 01 TEMP-SUM-ARREARS-AMT  PIC Z(13)9.9(3)-.
000121 01 TEMP-FINE1-TEMP-INT-ACCR PIC Z(13)9.9(3)-.
000122 01 TEMP-FINE2-TMP-INT-ACCR  PIC Z(13)9.9(3)-.
000123 01 TEMP-FINE4-INT-INCR  PIC Z(13)9.9(3)-.
000124 01 TEMP-FINE4-INT-ACCR   PIC Z(13)9.9(3)-. 
000125 01 TEMP-FINE4-TMP-INT-ACCR PIC Z(13)9.9(3)-.
000126 01 TEMP-FI1-OPT2-INT-ICR  PIC Z(11)9.9(5)-.
000127 01 TEMP-FI1-OPT2-INT-ACR  PIC Z(11)9.9(5)-.
000128 01 TEMP-FI2-OPT2-INT-ICR  PIC Z(11)9.9(5)-.
000129 01 TEMP-FI2-OPT2-INT-ACR  PIC Z(11)9.9(5)-.
000130 01 TEMP-FI4-OPT2-INT-ICR  PIC Z(11)9.9(5)-.
000131 01 TEMP-FRST-INT-VAL-DT  PIC X(9).
000132 01 TEMP-FI4-OPT2-INT-ACR  PIC Z(11)9.9(5)-.
000133 01 TEMP-FINE1-INT-RATE    PIC Z9.9(5)-.
000134 01 TEMP-FINE1-FIX-RATE    PIC Z9.9(5)-.
000135 01 TEMP-FINE2-INT-RATE    PIC Z9.9(5)-.
000136 01 TEMP-FINE2-FIX-RATE    PIC Z9.9(5)-.
000137 01 TEMP-FINE4-FIX-RATE    PIC Z9.9(5)-.  
000138 01 TEMP-FINE4-RT-INCR-MIN-VALUE PIC Z9.9(5)-.
000139 01 TEMP-FINE4-RT-INCR-MIN-PERC  PIC Z9.9(5)-.
000140 01 TEMP-FINE4-RT-INCR-MAX-VALUE PIC Z9.9(5)-.
000141 01 TEMP-FINE4-RT-INCR-MAX-PERC  PIC Z9.9(5)-.
000142 01 TEMP-FINE4-RT-INCR   PIC Z9.9(5)-.
000143 01 TEMP-FINE4-INT-RATE  PIC Z9.9(5)-.
000144 01 TEMP-RESIDUAL-BAL    PIC Z(13)9.9(3)-.
000145 01 TEMP-EOY-BASIC-BAL   PIC Z(13)9.9(3)-.
000146 01 TEMP-LST-MNT-DATE    PIC S9(9).
000147 01 TEMP-LAST-FIN-POST-DT PIC S9(9).
000148 01 TEMP-FLOAT-STRT-PREV-DT PIC S9(9).
000149 01 TEMP-LST-UNPD-DUE-DTE PIC S9(9).
000150 01 TEMP-ARREARS-CTR PIC S9(6).
000151 01 TEMP-MATURITY-DATE PIC S9(9).
000152 01 TEMP-WHATEVER PIC S9(10).
000153 01 TEMP-DATE    PIC S9(9).
000154 01 TEMP-ACCOUNT PIC 9(17).
000155 01 TODAY-DATE  PIC S9(9).
000156 01 EXIST-FLAG  PIC X.
000157 01 BORMR-END   PIC X.
000158 01 ERR-COUNT  PIC 9(10).
000159 01 WS-COUNT-1  PIC 9(10).
000160 01 WS-COUNT-2  PIC 9(10).
000161 01 WS-COUNT-3  PIC 9(10).
000162 01 ORACLE-ID  PIC X VALUE "/".
000163 01 WS-HEAD.
000164    03 WS-ACCOUNT            PIC 9(19).
000165    03 FILLER                PIC X(70) VALUE ALL "-".
000166 01 LONERR-STATUS PIC 9(2) VALUE 00.
000167    88 WS-LONERR-SECUSSFUL VALUE 00.
000168    88 WS-LONERR-EOF       VALUE 10.
000169    88 WS-LONERR-ACCEPTABLE VALUE 00 10.
000166 01 FBRVDDL-STATUS PIC 9(2) VALUE 00.
000167    88 WS-FBRVDDL-SECUSSFUL VALUE 00.
000168    88 WS-FBRVDDL-EOF       VALUE 10.
000169    88 WS-FBRVDDL-ACCEPTABLE VALUE 00 10.
000170 01 BRANCH-STATUS PIC 9(2) VALUE 00.
000171    88 WS-BRANCH-SECUSSFUL VALUE 00.
000172    88 WS-BRANCH-EOF       VALUE 10.
000173    88 WS-BRANCH-ACCEPTABLE VALUE 00 10.
000174 01 WS-I-BR  PIC 9(05)     VALUE ZERO.
000175 01 WS-BRHM-REC.                                  
000176    03 WS-BRHM-BR-FLG OCCURS  99999 TIMES    PIC X(01).
000177 01 UT0312CA-CALL-AREA.
000178    COPY UT0312CA IN LIBRYBOR.
000179 COPY BRHMG.
000180 COPY UT1999CA.
000181 COPY UT0030CA.
000182 COPY UT2000CA IN LIBRYBOR.
000183 COPY BORPARM IN LIBRYBOR.
000184 COPY UTCONVCA IN LIBRYMIS.
000185     EXEC SQL BEGIN DECLARE SECTION END-EXEC.
000186         01 CUSM-CUST-ACCT-NO  PIC X(16).
000187         01 CCYM-CURRENCY      PIC X(3).
000188         01 INVM-KEY-1         PIC X(19).
000189         01 CTAM-ACCT-NO       PIC X(16).
000190         01 CONB-CONTRACT-NO   PIC X(16).
000191         01 FAGD-CUST-NO       PIC X(16).
000192         01 FAGD-SEQ-NO        PIC X(4).
000193         01 RIGP-RISK          PIC X(2).
000194         01 BORM-KEY-1         PIC X(19).
000195         01 TELM-TELLER        PIC X(16).
000196         01 NUMBER-OF-RECORD   PIC 9(9).
000197         01 RPYV-ACCT          PIC 9(16).
000198         01 RPYV-P-AMT         PIC 9(14)V9(3).
000199         01 RPYV-I-AMT         PIC 9(14)V9(3).
000200         01 RPYV-W-AMT         PIC 9(14)V9(3).
000201         01 RPYV-A-AMT         PIC 9(14)V9(3).
000202         01 RPYV-E-AMT         PIC 9(14)V9(3).
000203     EXEC SQL END DECLARE SECTION END-EXEC.
000204     EXEC SQL
000205          INCLUDE SQLCA
000206     END-EXEC.
000207     EXEC SQL
000208          INCLUDE BORMR
000209     END-EXEC.
000210     EXEC SQL
000211          INCLUDE BOISR
000212     END-EXEC.
000213 PROCEDURE DIVISION.
000214     PERFORM A100-INITIALIZE
000215     PERFORM B100-CHECK-FIELDS
000216     PERFORM C100-PMG-END.
000217 A100-INITIALIZE.
000218     OPEN OUTPUT FBRVDDL
000000                 LONERR
000219          INPUT  BRANCH
000220     MOVE "N" TO BORMR-END
000221     MOVE 0 TO ERR-COUNT
000222               CALCULATED-LOAN-TERM
000223     PERFORM LOAD-BRANCH
000224     PERFORM GET-TODAY-DATE
000225     PERFORM A101-DATABASE-CONNCET.
000226     EXIT.
000227 B101-GET-DATA.
000228     EXEC SQL 
000229          DECLARE BORMCUR CURSOR FOR
000230          SELECT * FROM BORM ORDER BY KEY_1    
000231     END-EXEC        
000232     EXEC SQL 
000233          DECLARE BOISCUR CURSOR FOR
000234          SELECT * FROM BOIS ORDER BY KEY_1    
000235     END-EXEC           
000236     EXEC SQL
000237         OPEN BORMCUR
000238     END-EXEC
000239     EXEC SQL
000240         OPEN BOISCUR
000241     END-EXEC
000242     EXIT.
000243 B100-CHECK-FIELDS.
000244     PERFORM B101-GET-DATA
000245     EXEC SQL
000246         FETCH BORMCUR INTO :BORMR
000247     END-EXEC
000248     IF SQLCODE NOT = 0
000249        MOVE "Y" TO BORMR-END
000250     END-IF.
000251     EXEC SQL
000252         FETCH BOISCUR INTO :BOISR
000253     END-EXEC
           IF SQLCODE NOT = 0 
              DISPLAY "FETCH BOIS CURSOR: " SQLCODE
           END-IF 
000254     MOVE 0 TO WS-COUNT-1
000255               WS-COUNT-2
000256               WS-COUNT-3
000257     PERFORM B102-VALIDATE-FIELDS THRU B102-EXIT 
000258                            UNTIL BORMR-END = "Y".
000259     EXIT.
000260 C100-PMG-END.
000261     IF ERR-COUNT = 0
000262        DISPLAY "NO ERROR FOUND"
000263     ELSE
000264        DISPLAY "HAVE " ERR-COUNT " ERROR(S) PLEASE CHECK"
000265        DISPLAY WS-COUNT-3 "ACCOUNT ERROR"
000266     END-IF
000267     CLOSE FBRVDDL
                 LONERR.
000268     STOP RUN.
000269 A101-DATABASE-CONNCET.
000270     EXEC SQL
000271         CONNECT :ORACLE-ID
000272     END-EXEC
000273     IF SQLCODE NOT = 0
000274        DISPLAY "CONNECT DATABASE ERROR"
000275        GO TO C100-PMG-END
000276     END-IF
000277     EXIT.        
000278 B102-VALIDATE-FIELDS.
000279*     DISPLAY "BOIS KEY_1: " BOIS-KEY-1
000280*     DISPLAY "BORM KEY_1: " BORMR-KEY-1
000281     IF BORMR-ACT-TYPE = ZEROS OR SPACES OR 
000282         BORMR-CAT = ZEROES OR SPACES
000283        INITIALIZE FBRVDDL-DESC
000284        STRING "INVALIDATE ACCT PRODUCT"
000285               "ACOUNT: " BORMR-KEY-1(4:16)
000286               DELIMITED BY SIZE INTO FBRVDDL-DESC
000287        PERFORM B1021-WRITE-FBRVDDL
000288     ELSE           
000289        PERFORM LOAD-PRODUCT
000290     END-IF
000291     IF BORMR-STAT NOT = "05" AND "08" AND "50" AND "12" AND "13"
000292        INITIALIZE FBRVDDL-DESC
000293        STRING "STAT NOT RIGHT  "
000294        "ACCOUNT: " BORMR-KEY-1(4:16)
000295        "STAT: " BORMR-STAT
000296        DELIMITED BY SIZE INTO FBRVDDL-DESC
000297        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????" TO ERR-DESC
              WRITE LONERR-REC
000298     END-IF
000299*    
000300     MOVE BORMR-STAT TO TEMP-STAT
000301     MOVE BORMR-RT-INCR TO TEMP-RT-INCR
000302*     MOVE BORMR-RT-INCR TO UTCONVCA-OLD-FORMAT-NUMBER
000303*     PERFORM FORMAT-NUMBER-TO-CHAR
000304*     MOVE UTCONVCA-NEW-FORMAT-NUMBER TO TEMP-RT-INCR
000305     MOVE BORMR-APPLIC-ISSUE-DATE TO TEMP-APPLIC-ISSUE-DATE
000306     MOVE BORMR-APPLIC-AMOUNT TO TEMP-APPLIC-AMOUNT
000307     MOVE BORMR-APP-AMT TO TEMP-APP-AMT
000308     MOVE BORMR-ADV-VAL TO TEMP-ADV-VAL
000309     MOVE BORMR-INTEREST TO TEMP-INTEREST
000310     MOVE BORMR-APPRV-DATE TO TEMP-APPRV-DATE
000311     MOVE BORMR-DUE-AMT TO TEMP-DUE-AMT
000312     MOVE BORMR-LOAN-REPAY TO TEMP-LOAN-REPAY
000313     MOVE BORMR-LST-FIN-DATE TO TEMP-LST-FIN-DATE
000314     MOVE BORMR-ADV-DATE TO TEMP-ADV-DATE
000315     MOVE BORMR-DUE-STRT-DATE TO TEMP-DUE-STRT-DATE
000316     MOVE BORMR-INT-ACCR TO TEMP-INT-ACCR
000317     MOVE BORMR-INT-INCR TO TEMP-INT-INCR
000318     MOVE BORP-RT-INCR-MAX-PERC TO TEMP-RT-INCR-MAX-PERC
000319     MOVE BORP-RT-INCR-MIN-PERC TO TEMP-RT-INCR-MIN-PERC
000320     MOVE BORP-RT-INCR-MAX-VALUE TO TEMP-RT-INCR-MAX-VALUE
000321     MOVE BORP-RT-INCR-MIN-VALUE TO TEMP-RT-INCR-MIN-VALUE
000322     MOVE BORMR-INT-RATE TO TEMP-INT-RATE
000323     MOVE BORMR-UNEARNED-INT TO TEMP-UNEARNED-INT
000324     MOVE BOIS-BOIS-BUCKET-10 TO TEMP-BOIS-BUCKET-10
000325     MOVE BOIS-BOIS-BUCKET-09 TO TEMP-BOIS-BUCKET-09
000326     MOVE BOIS-BOIS-BUCKET-08 TO TEMP-BOIS-BUCKET-08
000327     MOVE BOIS-BOIS-BUCKET-07 TO TEMP-BOIS-BUCKET-07
000328     MOVE BOIS-BOIS-BUCKET-06 TO TEMP-BOIS-BUCKET-06
000329     MOVE BOIS-LAST-TERM-PAID TO TEMP-LAST-TERM-PAID
000330     MOVE BORMR-INT-STRT-DATE TO TEMP-INT-STRT-DATE
000331     MOVE BOIS-MATURITY-DATE TO TEMP-MATURITY-DATE
000332     MOVE BORMR-REPAY-TYPE TO TEMP-REPAY-TYPE
000333     MOVE BOIS-NEXT-DUE-DATE TO TEMP-NEXT-DUE-DATE
000334     MOVE BOIS-LAST-TERM-UNPAID TO TEMP-LAST-TERM-UNPAID
000335     MOVE BOIS-BAD-DEBT-TRF-DTE TO TEMP-BAD-DEBT-TRF-DTE
000336     MOVE BOIS-TOT-BAD-DEBT-AMT TO TEMP-TOT-BAD-DEBT-AMT
000337     MOVE BOIS-GL-TRF-ORG-AMT-P TO TEMP-GL-TRF-ORG-AMT-P
000338     MOVE BOIS-GL-TRF-ORG-AMT-I TO TEMP-GL-TRF-ORG-AMT-I
000339     MOVE BORMR-REM-REPAYS TO TEMP-REM-REPAYS
000340     MOVE BORP-FINE1-RT-INCR-MAX-VALUE TO 
000341               TEMP-FINE1-RT-INCR-MAX-VALUE
000342     MOVE BORP-FINE1-RT-INCR-MIN-VALUE TO
000343               TEMP-FINE1-RT-INCR-MIN-VALUE
000344     MOVE BOIS-FST-DRWDWN-DATE TO TEMP-FST-DRWDWN-DATE
000345     MOVE BOIS-PREV-DUE-DATE TO TEMP-PREV-DUE-DATE
000346     MOVE BORP-FINE1-RT-INCR-MAX-PERC TO 
000347                TEMP-FINE1-RT-INCR-MAX-PREC
000348     MOVE BORP-FINE1-RT-INCR-MIN-PERC TO 
000349                TEMP-FINE1-RT-INCR-MIN-PERC
000350     MOVE BOIS-FINE1-RT-INCR TO TEMP-FINE1-RT-INCR
000351     MOVE BOIS-FINE2-INT-INCR TO TEMP-FINE2-INT-INCR
000352     MOVE BOIS-FINE2-INT-ACCR TO TEMP-FINE2-INT-ACCR
000353     MOVE BOIS-FINE2-RT-INCR TO TEMP-FINE2-RT-INCR
000354     MOVE BORMR-STORE-RATE TO TEMP-STORE-RATE
000355     MOVE BOIS-UNPD-ARR-PRN-BAL TO TEMP-UNPD-ARR-PRN-BAL
000356     MOVE BOIS-UNPD-INT-ARR-PRN TO TEMP-UNPD-INT-ARR-PRN
000357     MOVE BOIS-FEE-PRVN-AMT TO TEMP-FEE-PRVN-AMT 
000358     MOVE BOIS-MIN-REPAY-AMT-PC TO TEMP-MIN-REPAY-AMT-PC
000359     MOVE BORMR-THEO-LOAN-BAL TO TEMP-THEO-LOAN-BAL
000360     MOVE BORMR-UNPD-CHRG-BAL TO TEMP-UNPD-CHRG-BAL
000361     MOVE BORMR-LOAN-BAL TO TEMP-LOAN-BAL
000362     MOVE BORMR-UNPD-PRIN-BAL TO TEMP-UNPD-PRIN-BAL
000363     MOVE BORMR-CAP-UNPD-INT TO TEMP-CAP-UNPD-INT
000364     MOVE BOIS-FIRST-ADV-DATE TO TEMP-FIRST-ADV-DATE
000365     MOVE BORMR-LOAN-TRM TO TEMP-LOAN-TRM
000366     MOVE BOIS-DATE-OF-GRADUATION TO TEMP-DATE-OF-GRADUATION
000367     MOVE BORMR-UNPD-ARRS-INT-BAL TO TEMP-UNPD-ARRS-INT-BAL
000368     MOVE BOIS-SUM-ARREARS-CNT TO TEMP-SUM-ARREARS-CNT
000369     MOVE BORMR-UNPD-PRIN-BAL TO TEMP-UNPD-PRIN-BAL
000370     MOVE BORMR-ARR-INT-INCR TO TEMP-ARR-INT-INCR
000371     MOVE BORMR-ARR-INT-ACCR TO TEMP-ARR-INT-ACCR
000372     MOVE BOIS-INCR-DEG TO TEMP-INCR-DEG
000373     MOVE BOIS-SUM-REPAY-AMT TO TEMP-SUM-REPAY-AMT
000374     MOVE BOIS-SUM-REPAY-INT-AMT TO TEMP-SUM-REPAY-INT-AMT
000375     MOVE BOIS-PROM-PREV-AMT TO TEMP-PROM-PREV-AMT
000376     MOVE BOIS-PROV-CURT-DATE TO TEMP-PROV-CURT-DATE
000377     MOVE BOIS-PROV-AMOUNT TO TEMP-PROV-AMOUNT
000378     MOVE BOIS-ACT-FIRST-RPY-DAY TO TEMP-ACT-FIRST-RPY-DAY
000379     MOVE BOIS-SUM-ARREARS-AMT TO TEMP-SUM-ARREARS-AMT
000380     MOVE BOIS-FINE1-TMP-INT-ACCR TO TEMP-FINE1-TEMP-INT-ACCR
000381     MOVE BOIS-FINE2-TMP-INT-ACCR TO TEMP-FINE2-TMP-INT-ACCR
000382     MOVE BOIS-FINE4-INT-INCR TO TEMP-FINE4-INT-INCR
000383     MOVE BOIS-FINE4-INT-ACCR TO TEMP-FINE4-INT-ACCR
000384     MOVE BOIS-FINE4-TMP-INT-ACCR TO TEMP-FINE4-TMP-INT-ACCR
000385     MOVE BOIS-FI1-OPT2-INT-ICR TO TEMP-FI1-OPT2-INT-ICR
000386     MOVE BOIS-FI1-OPT2-INT-ACR TO TEMP-FI1-OPT2-INT-ACR
000387     MOVE BOIS-FI2-OPT2-INT-ICR TO TEMP-FI2-OPT2-INT-ICR
000388     MOVE BOIS-FI2-OPT2-INT-ACR TO TEMP-FI2-OPT2-INT-ACR
000389     MOVE BOIS-FI4-OPT2-INT-ICR TO TEMP-FI4-OPT2-INT-ICR
000390     MOVE BOIS-FRST-INT-VAL-DT TO TEMP-FRST-INT-VAL-DT
000391     MOVE BOIS-FI4-OPT2-INT-ACR TO TEMP-FI4-OPT2-INT-ACR
000392     MOVE BOIS-FINE1-INT-RATE TO TEMP-FINE1-INT-RATE
000393     MOVE BOIS-FINE1-FIX-RATE TO TEMP-FINE1-FIX-RATE
000394     MOVE BOIS-FINE2-INT-RATE TO TEMP-FINE2-INT-RATE
000395     MOVE BOIS-FINE2-FIX-RATE TO TEMP-FINE2-FIX-RATE
000396     MOVE BOIS-FINE4-FIX-RATE TO TEMP-FINE4-FIX-RATE
000397     MOVE BORP-FINE4-RT-INCR-MIN-VALUE TO 
000398              TEMP-FINE4-RT-INCR-MIN-VALUE 
000399     MOVE BORP-FINE4-RT-INCR-MIN-PERC TO 
000400                TEMP-FINE4-RT-INCR-MIN-PERC
000401     MOVE BORP-FINE4-RT-INCR-MAX-VALUE TO 
000402              TEMP-FINE4-RT-INCR-MAX-VALUE 
000403     MOVE BORP-FINE4-RT-INCR-MAX-PERC TO 
000404              TEMP-FINE4-RT-INCR-MAX-PERC
000405     MOVE BOIS-FINE4-RT-INCR TO TEMP-FINE4-RT-INCR
000406     MOVE BOIS-FINE4-INT-RATE TO TEMP-FINE4-INT-RATE
000407     MOVE BORMR-RESIDUAL-BAL TO TEMP-RESIDUAL-BAL 
000408     MOVE BORMR-EOY-BASIC-BAL TO TEMP-EOY-BASIC-BAL
000409     MOVE BORMR-LST-MNT-DATE TO TEMP-LST-MNT-DATE
000410     MOVE BOIS-LST-FIN-POST-DT TO TEMP-LAST-FIN-POST-DT
000411     MOVE BOIS-FLOAT-STRT-PREV-DT TO TEMP-FLOAT-STRT-PREV-DT
000412     MOVE BOIS-LST-UNPD-DUE-DTE TO TEMP-LST-UNPD-DUE-DTE
000413     MOVE BOIS-MATURITY-DATE TO TEMP-MATURITY-DATE    
000414     MOVE BOIS-ARREARS-CTR TO TEMP-ARREARS-CTR  
000415     IF BORMR-APPLIC-ISSUE-DATE <= BOIS-FIRST-ADV-DATE AND
000416           BORMR-APPLIC-ISSUE-DATE < BOIS-MATURITY-DATE
000417        CONTINUE
000418     ELSE
000419        INITIALIZE FBRVDDL-DESC
000420        STRING "LOAN APPLIACATION DATE NOT SMALLER" 
000421               "OR EQUAL THAN ADVANCE DATE"
000422               "OR MATURITY DATE GREATER THAN APPLICATION DATE"
000423               "ACCOUNT: " BORMR-KEY-1(4:16)
000424               "BORMR-APPLIC-DATE: " TEMP-APPLIC-ISSUE-DATE
000425               "BORMR-ADVANCE-DATE: " TEMP-ADV-DATE
000426               "BOIS-MATURITY-DATE: " TEMP-MATURITY-DATE
000427               DELIMITED BY SIZE INTO FBRVDDL-DESC
000428         PERFORM B1021-WRITE-FBRVDDL
               MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
               MOVE "???????????" TO ERR-DESC
               WRITE LONERR-REC
000429     END-IF
000430*
000431     IF BORMR-APPLIC-AMOUNT < 0
000432        INITIALIZE FBRVDDL-DESC 
000433        STRING "LOAN APPLICATION AMOUNT LESS THAN ZERO"
000434               "ACCOUNT: " BORMR-KEY-1(4:16)
000435               "APPLIC-AMOUNT: " TEMP-APPLIC-AMOUNT
000436               DELIMITED BY SIZE INTO FBRVDDL-DESC
000437         PERFORM B1021-WRITE-FBRVDDL
               MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
               MOVE "????????" TO ERR-DESC
               WRITE LONERR-REC
000438     END-IF
000439*
000440     IF BORMR-REPAY-DAY < 0 OR BORMR-REPAY-DAY > 31
000441        INITIALIZE FBRVDDL-DESC
000442        STRING "LOAN REPAY DAY NOT CORRECT "
000443               "ACCOUNT: " BORMR-KEY-1(4:16)
000444               "REPAY-DAY: " BORMR-REPAY-DAY
000445               DELIMITED BY SIZE INTO FBRVDDL-DESC
000446         PERFORM B1021-WRITE-FBRVDDL
               MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
               MOVE "?????????" TO ERR-DESC
               WRITE LONERR-REC
000447     END-IF
000448*
000449     IF BORMR-REPAY-FREQ = 01 OR 03 OR 06 OR 12 OR 14 OR 15 OR 98
000450*        IF BOIS-SELF-LN-IND = 1 AND BORMR-REPAY-FREQ = 98
000451        CONTINUE
000452*        ELSE
000453*           INITIALIZE FBRVDDL-DESC
000454*           STRING "LOAN REPAY FREQUENCY NOT CORRECT "
000455*                  "ACCOUNT: " BORMR-KEY-1(4:16)
000456*                  "REPLAY-FREQ: " BORMR-REPAY-FREQ
000457*                  "SELF-SERVICE-LOAN: " BOIS-SELF-LN-IND
000458*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
000459*           PERFORM B1021-WRITE-FBRVDDL
000460*        END-IF
000461     ELSE
000462        INITIALIZE FBRVDDL-DESC
000463        STRING "LOAN REPAY FREQUENCY NOT CORRECT "
000464               "ACCOUNT: " BORMR-KEY-1(4:16)
000465               "REPLAY-FREQ: " BORMR-REPAY-FREQ  
000466               DELIMITED BY SIZE INTO FBRVDDL-DESC
000467        PERFORM B1021-WRITE-FBRVDDL
               MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
               MOVE "??????????" TO ERR-DESC
               WRITE LONERR-REC
000468     END-IF
000469*
000470     IF BORMR-REM-REPAYS >= 0 AND 
000471          BORMR-REM-REPAYS <= BORMR-LOAN-TRM
000472        CONTINUE 
000473     ELSE
000474        INITIALIZE FBRVDDL-DESC
000475        STRING "REM REPAYS NOT CORRECT "
000476               "ACCOUNT: " BORMR-KEY-1(4:16)
000477               "REM-REPAYS: " TEMP-REM-REPAYS
000478               "LOAN TERM: " TEMP-LOAN-TRM
000479               DELIMITED BY SIZE INTO FBRVDDL-DESC
000480        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????????" TO ERR-DESC
              WRITE LONERR-REC
000481     END-IF
000482     PERFORM GET-LOAN-TERM
000483     IF CALCULATED-LOAN-TERM NOT = BORMR-LOAN-TRM
000484        INITIALIZE FBRVDDL-DESC
000485        STRING "LOAN TERM NOT CORRECT"
000486               "ACCOUNT: " BORMR-KEY-1(4:16)
000487               "CALCULATED-LOAN-TERM: " CALCULATED-LOAN-TERM
000488               "ORIN LOAN TERM: " TEMP-LOAN-TRM
000489               "REPAY FREQ: " BORMR-REPAY-FREQ
000490               "REPAY DAY: " BORMR-REPAY-DAY
000491               "MATURITY-DATE: " TEMP-MATURITY-DATE
000492               "START-DATE: " TEMP-DUE-STRT-DATE
000493               DELIMITED BY SIZE INTO FBRVDDL-DESC
000494        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????" TO ERR-DESC
              WRITE LONERR-REC
000495     END-IF
000496     IF TEMP-STAT = 50 OR BOIS-MATURITY-DATE <= TODAY-DATE
000497        IF BORMR-REM-REPAYS = 0 
000498           CONTINUE
000499        ELSE
000500           INITIALIZE FBRVDDL-DESC
000501           STRING "REM REPAY NOT CORRECT  222"
000502                  "ACCOUNT: " BORMR-KEY-1(4:16)
000503                  "REM-REPAYS: " TEMP-REM-REPAYS
000504                  "STAT: " BORMR-STAT
000505                  "MATURITY-DATE: " TEMP-MATURITY-DATE
000506                  DELIMITED BY SIZE INTO FBRVDDL-DESC
000507           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????" TO ERR-DESC
                 WRITE LONERR-REC
000508        END-IF
000509     END-IF
000510     IF TEMP-STAT < 50 OR BOIS-MATURITY-DATE > TODAY-DATE
000511        IF BORMR-REM-REPAYS >= 1
000512           CONTINUE
000513        ELSE
000514           INITIALIZE FBRVDDL-DESC
000515           STRING "REM REPAY NOT CORRECT  333"
000516                  "ACCOUNT: " BORMR-KEY-1(4:16)
000517                  "REM-REPAYS: " TEMP-REM-REPAYS
000518                  "STAT: " BORMR-STAT
000519                  "MATURITY-DATE: " TEMP-MATURITY-DATE
000520                  DELIMITED BY SIZE INTO FBRVDDL-DESC
000521           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????" TO ERR-DESC
                 WRITE LONERR-REC
000522        END-IF
000523     END-IF
000524     IF BOIS-SELF-LN-IND = 1 AND 
000525            BOIS-MATURITY-DATE > TODAY-DATE
000526        IF BORMR-REM-REPAYS = 1 
000527           CONTINUE
000528        ELSE
000529           INITIALIZE FBRVDDL-DESC
000530           STRING "REM REPAY NOT CORRECT  444"
000531                  "ACCOUNT: " BORMR-KEY-1(4:16)
000532                  "REM-REPAYS: " TEMP-REM-REPAYS
000533                  "SELF-SERVICE-LOAN: " BOIS-SELF-LN-IND
000534                  "MATURITY-DATE: " TEMP-MATURITY-DATE
000535                  DELIMITED BY SIZE INTO FBRVDDL-DESC
000536           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????" TO ERR-DESC
                 WRITE LONERR-REC
000537        END-IF
000538     END-IF 
000539*
000540     IF BORMR-APP-AMT <= 0
000541        INITIALIZE FBRVDDL-DESC
000542        STRING "LOAN APPLICATION AMOUNT NOT GREATER THAN ZERO"
000543               "ACCOUNT: " BORMR-KEY-1(4:16)
000544               "APP AMT: " TEMP-APP-AMT
000545               DELIMITED BY SIZE INTO FBRVDDL-DESC
000546        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "????????" TO ERR-DESC
              WRITE LONERR-REC
000547     END-IF
000548*
000549     IF BORMR-LOAN-BAL >= 0 AND BORMR-LOAN-BAL <= BORMR-ADV-VAL
000550          AND BORMR-ADV-VAL >= 0
000551        CONTINUE
000552     ELSE
000553        INITIALIZE FBRVDDL-DESC
000554        STRING "LOAND BALANCE NOT CORRECT "
000555               "ACCOUNT: " BORMR-KEY-1(4:16)
000556               "BALANCE: " TEMP-LOAN-BAL
000557               "ADVANCE AMT: " TEMP-ADV-VAL
000558               DELIMITED BY SIZE INTO FBRVDDL-DESC
000559        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????" TO ERR-DESC
              WRITE LONERR-REC
000560     END-IF
000561*
000562     IF BORMR-THEO-LOAN-BAL <= BORMR-LOAN-BAL 
000563        IF TEMP-STAT >= 50 OR BOIS-MATURITY-DATE < TODAY-DATE
000564           IF BORMR-THEO-LOAN-BAL = 0
000565              CONTINUE
000566           ELSE
000567              INITIALIZE FBRVDDL-DESC
000568              STRING "LOAND THEO BALANCE NOT CORRECT "
000569                     "ACCOUNT: " BORMR-KEY-1(4:16)
000570                     "THEO BAL: " TEMP-THEO-LOAN-BAL
000571                     "LOAN BAL: " TEMP-LOAN-BAL
000572                     "STAT: " BORMR-STAT
000573                     "MATURITY DATE: " TEMP-MATURITY-DATE
000574                     DELIMITED BY SIZE INTO FBRVDDL-DESC
000575              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "?????????" TO ERR-DESC
                    WRITE LONERR-REC
000576           END-IF
000577        END-IF
000578     ELSE
000579        INITIALIZE FBRVDDL-DESC
000580        STRING "LOAND THEO BALANCE NOT CORRECT 222"
000581               "ACCOUNT: " BORMR-KEY-1(4:16)
000582               "THEO BAL: " TEMP-THEO-LOAN-BAL
000583               DELIMITED BY SIZE INTO FBRVDDL-DESC
000584        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????" TO ERR-DESC
              WRITE LONERR-REC
000585     END-IF                     
000586*
000587     IF BORMR-CAPN-METHOD = "X"
000588        IF BORMR-INTEREST <= BORMR-UNEARNED-INT
000589           CONTINUE
000590        ELSE
000591           INITIALIZE FBRVDDL-DESC
000592           STRING "DISCOUNT INT NOT CORRECT "
000593                  "ACCOUNT: " BORMR-KEY-1(4:16)
000594                  "CAPN METHOD: " BORMR-CAPN-METHOD
000595                  "BORM INT: " TEMP-INTEREST
000596                  "UNERARED INT: " TEMP-UNEARNED-INT
000597                  DELIMITED BY SIZE INTO FBRVDDL-DESC
000598           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????" TO ERR-DESC
                 WRITE LONERR-REC
000599        END-IF
000600     END-IF
000601     IF BORMR-CAPN-METHOD NOT = "X" OR BORP-LOAN-CLASS = 1
000602        IF BORMR-INTEREST = 0 
000603           CONTINUE
000604        ELSE
000605           INITIALIZE FBRVDDL-DESC
000606           STRING "DISCOUNT INT NOT CORRECT "
000607                  "ACCOUNT: " BORMR-KEY-1(4:16)
000608                  "BORM INT: " TEMP-INTEREST
000609                  "CAPN METHOD: " BORMR-CAPN-METHOD
000610                  "LOAN-CLASS: " BORP-LOAN-CLASS
000611                  DELIMITED BY SIZE INTO FBRVDDL-DESC
000612           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????" TO ERR-DESC
                 WRITE LONERR-REC
000613        END-IF
000614     END-IF
000615*
000616     IF BORMR-DUE-AMT >= 0
000617        IF TEMP-STAT < 50 OR BOIS-MATURITY-DATE > TODAY-DATE
000618           IF BORMR-DUE-AMT > 0
000619              CONTINUE
000620           ELSE
000621              INITIALIZE FBRVDDL-DESC
000622              STRING "LOAN DUE AMT NOT CORRECT "
000623                     "ACCOUNT: " BORMR-KEY-1(4:16)
000624                     "DUE-AMT: " TEMP-DUE-AMT
000625                     "MATURITY-DATE: " TEMP-MATURITY-DATE
000626                     "STAT: " BORMR-STAT
000627                     DELIMITED BY SIZE INTO FBRVDDL-DESC
000628              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "??????????" TO ERR-DESC
                    WRITE LONERR-REC
000629           END-IF
000630        END-IF
000631        IF TEMP-STAT = 50 OR BOIS-MATURITY-DATE <= TODAY-DATE
000632           IF BORMR-DUE-AMT = 0 
000633              CONTINUE
000634           ELSE
000635              INITIALIZE FBRVDDL-DESC
000636              STRING "LOAN DUE AMT NOT CORRECT 222"
000637                     "ACCOUNT: " BORMR-KEY-1(4:16)
000638                     "DUE-AMT: " TEMP-DUE-AMT
000639                     "MATURITY-DATE: " TEMP-MATURITY-DATE
000640                     "STAT: " BORMR-STAT
000641                     DELIMITED BY SIZE INTO FBRVDDL-DESC
000642              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "??????????" TO ERR-DESC
                    WRITE LONERR-REC
000643           END-IF
000644        END-IF    
000645        IF BOIS-SELF-LN-IND = 1 AND 
000646              BOIS-MATURITY-DATE <= TODAY-DATE
000647           IF BORMR-DUE-AMT > BORMR-LOAN-BAL
000648              CONTINUE
000649           ELSE
000650              INITIALIZE FBRVDDL-DESC
000651              STRING "LOAN DUE AMT NOT CORRECT 333"
000652                     "ACCOUNT: " BORMR-KEY-1(4:16)
000653                     "DUE-AMT: " TEMP-DUE-AMT
000654                     "MATURITY-DATE: " TEMP-MATURITY-DATE
000655                     "LOAN BALANCE: " TEMP-LOAN-BAL
000656                     "SELF SERVICE LOAN: " BOIS-SELF-LN-IND
000657                     DELIMITED BY SIZE INTO FBRVDDL-DESC
000658              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "??????????" TO ERR-DESC
                    WRITE LONERR-REC
000659           END-IF
000660        END-IF
000661     ELSE
000662        INITIALIZE FBRVDDL-DESC
000663        STRING "LOAN DUE AMT NOT CORRECT 333"
000664               "ACCOUNT: " BORMR-KEY-1(4:16)
000665               "DUE-AMT: " TEMP-DUE-AMT
000666               DELIMITED BY SIZE INTO FBRVDDL-DESC
000667        PERFORM B1021-WRITE-FBRVDDL        
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
000668     END-IF
000669*
000670     IF 0 <= BORMR-LOAN-REPAY  AND
000671            BORMR-LOAN-REPAY <= BORMR-DUE-AMT
000672        IF BORMR-STAT = 50 OR BOIS-MATURITY-DATE <= TODAY-DATE
000673           IF BORMR-LOAN-REPAY = 0 
000674              CONTINUE
000675           ELSE
000676              INITIALIZE FBRVDDL-DESC
000677              STRING "BORM LOAN REPAY NOT CORRECT "
000678                      "ACCOUNT: " BORMR-KEY-1(4:16)
000679                      "BORM LOAN REPAY: " TEMP-LOAN-REPAY
000680                      "MAATURITY DATE: " TEMP-MATURITY-DATE
000681                      "STAT: " BORMR-STAT
000682                      DELIMITED BY SIZE INTO FBRVDDL-DESC
000683               PERFORM B1021-WRITE-FBRVDDL
                     MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                     MOVE "?????????????" TO ERR-DESC
                     WRITE LONERR-REC
000684           END-IF
000685        END-IF
000686        IF BOIS-GRACE-PERIOD NOT = "0000"
000687           IF BORMR-LOAN-REPAY = 0 
000688              CONTINUE
000689           ELSE
000690              INITIALIZE FBRVDDL-DESC
000691              STRING "BORM LOAN REPAY NOT CORRECT 22"
000692                      "ACCOUNT: " BORMR-KEY-1(4:16)
000693                      "BORM LOAN REPAY: " TEMP-LOAN-REPAY
000694                      "GRACE PERIOD: " BOIS-GRACE-PERIOD
000695                      DELIMITED BY SIZE INTO FBRVDDL-DESC
000696               PERFORM B1021-WRITE-FBRVDDL
                     MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                     MOVE "?????????????" TO ERR-DESC
                     WRITE LONERR-REC
000697           END-IF
000698        END-IF
000699        IF BOIS-SELF-LN-IND = 1 AND
000700               BOIS-MATURITY-DATE > TODAY-DATE
000701           IF BORMR-LOAN-REPAY = BORMR-LOAN-BAL
000702              CONTINUE
000703           ELSE
000704              INITIALIZE FBRVDDL-DESC
000705              STRING "BORM LOAN REPAY NOT CORRECT 333"
000706                      "ACCOUNT: " BORMR-KEY-1(4:16)
000707                      "BORM LOAN REPAY: " TEMP-LOAN-REPAY
000708                      "SELF LOAN: " BOIS-SELF-LN-IND
000709                      "MAATURITY DATE: " TEMP-MATURITY-DATE
000710                      "LOAN BAL: " TEMP-LOAN-BAL
000711                      DELIMITED BY SIZE INTO FBRVDDL-DESC
000712               PERFORM B1021-WRITE-FBRVDDL
                     MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                     MOVE "?????????????" TO ERR-DESC
                     WRITE LONERR-REC
000713           END-IF
000714        END-IF    
000715     ELSE
000716        INITIALIZE FBRVDDL-DESC
000717        STRING "BORM LOAN REPAY NOT CORRECT 444"
000718               "ACCOUNT: " BORMR-KEY-1(4:16)
000719               "BORM LOAN REPAY: " TEMP-LOAN-REPAY
000720               "DUE AMT: " TEMP-DUE-AMT
000721               DELIMITED BY SIZE INTO FBRVDDL-DESC
000722        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????????" TO ERR-DESC
              WRITE LONERR-REC
000723     END-IF
000724*
000725     IF BORMR-APPRV-DATE <= BOIS-FIRST-ADV-DATE AND
000726        BORMR-APPRV-DATE <= BOIS-MATURITY-DATE    
000727        CONTINUE
000728     ELSE
000729        INITIALIZE FBRVDDL-DESC
000730        STRING "BORM APPRV DATE NOT CORRECT "
000731               "ACCOUNT: " BORMR-KEY-1(4:16)
000732               "APPRV DATE:" TEMP-APPRV-DATE
000733               "BOIS FIRST ADV DATE: " TEMP-FIRST-ADV-DATE
000734               "MATURITY DATE: " TEMP-MATURITY-DATE
000735               DELIMITED BY SIZE INTO FBRVDDL-DESC
000736        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
000737     END-IF
000738*
000739     IF BORMR-LST-FIN-DATE > TODAY-DATE
000740        INITIALIZE FBRVDDL-DESC
000741        STRING "LAST FINICIAL DATE NOT CORRECT "
000742               "ACCOUNT: " BORMR-KEY-1(4:16)
000743               "LAST FINICIAL DATE: " TEMP-LST-FIN-DATE
000744               DELIMITED BY SIZE INTO FBRVDDL-DESC
000745        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??¦˿?????????" TO ERR-DESC
              WRITE LONERR-REC
000746     END-IF
000747*
000748     IF BOIS-FIRST-ADV-DATE <= BORMR-ADV-DATE AND 
000749           BORMR-ADV-DATE <= BOIS-MATURITY-DATE
000750        IF TEMP-STAT < 8
000751           IF BORMR-ADV-DATE = 0                  
000752              CONTINUE
000753           ELSE
000754              INITIALIZE FBRVDDL-DESC
000755              STRING "LATEST ADV DATE NOT CORRECT "
000756                     "ACCOUNT: " BORMR-KEY-1(4:16)
000757                     "STAT: " BORMR-STAT   
000758                     "ADV-DATE: " TEMP-ADV-DATE             
000759                     DELIMITED BY SIZE INTO FBRVDDL-DESC
000760              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "??????????" TO ERR-DESC
                    WRITE LONERR-REC
000761           END-IF
000762        END-IF
000763     ELSE
000764        INITIALIZE FBRVDDL-DESC
000765        STRING "LATEST ADV DATE NOT CORRECT "
000766               "ACCOUNT: " BORMR-KEY-1(4:16)
000767               "ADV DATE: " TEMP-ADV-DATE
000768               "FIRST ADV DATE: " TEMP-FIRST-ADV-DATE
000769               "MATURITY DATE: " TEMP-MATURITY-DATE
000770               DELIMITED BY SIZE INTO FBRVDDL-DESC
000771        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
000772     END-IF              
000773*
000774     IF BORMR-DUE-STRT-DATE = BORMR-INT-STRT-DATE AND 
000775            BORMR-INT-STRT-DATE = BOIS-FIRST-ADV-DATE
000776        IF TEMP-STAT < 8
000777           IF BORMR-DUE-STRT-DATE = 0               
000778              CONTINUE
000779           ELSE
000780              INITIALIZE FBRVDDL-DESC
000781              STRING "DUE STRT DATE NOT CORRECT "
000782                     "ACCOUNT: " BORMR-KEY-1(4:16)
000783                     "STAT: " BORMR-STAT
000784                     "DUE STRT DATE: " TEMP-DUE-STRT-DATE
000785                     DELIMITED BY SIZE INTO FBRVDDL-DESC
000786              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "??????????" TO ERR-DESC
                    WRITE LONERR-REC
000787           END-IF
000788        END-IF
000789     ELSE
000790        INITIALIZE FBRVDDL-DESC
000791        STRING "DUE STRT DATE NOT CORRECT "
000792               "ACCOUNT: " BORMR-KEY-1(4:16)
000793               "DUE START DATE: " TEMP-DUE-STRT-DATE
000794               "INT START DATE: " TEMP-INT-STRT-DATE
000795               "FIRST ADV DATE: " TEMP-FIRST-ADV-DATE    
000796               DELIMITED BY SIZE INTO FBRVDDL-DESC
000797        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
000798     END-IF              
000799*
000800     IF TEMP-STAT > 05 AND TEMP-STAT NOT = 50
000801        IF BORMR-INT-STRT-DATE > 0 AND 
000802             BORMR-INT-STRT-DATE = BOIS-FIRST-ADV-DATE              
000803           CONTINUE
000804        ELSE
000805            INITIALIZE FBRVDDL-DESC
000806            STRING "INT START DATE NOT CORRECT "
000807                   "ACCOUNT: " BORMR-KEY-1(4:16)
000808                   "INT-START-DATE: " TEMP-INT-STRT-DATE
000809                   "STAT: " BORMR-STAT
000810                   "FIRST ADV DATE: " TEMP-FIRST-ADV-DATE
000811                   DELIMITED BY SIZE INTO FBRVDDL-DESC
000812            PERFORM B1021-WRITE-FBRVDDL
                  MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                  MOVE "?????????????" TO ERR-DESC
                  WRITE LONERR-REC
000813        END-IF
000814     END-IF
000815     IF TEMP-STAT < 08
000816        IF BORMR-INT-STRT-DATE = 0 
000817           CONTINUE
000818        ELSE
000819           INITIALIZE FBRVDDL-DESC
000820            STRING "INT START DATE NOT CORRECT "
000821                   "ACCOUNT: " BORMR-KEY-1(4:16)
000822                   "INT-START-DATE: " TEMP-INT-STRT-DATE
000823                   "STAT: " BORMR-STAT
000824                   DELIMITED BY SIZE INTO FBRVDDL-DESC
000825            PERFORM B1021-WRITE-FBRVDDL
                  MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                  MOVE "?????????????" TO ERR-DESC
                  WRITE LONERR-REC
000826        END-IF
000827     END-IF
000828*
000829     IF BORMR-REPAY-TYPE NOT = 0 AND 9
000830        INITIALIZE FBRVDDL-DESC
000831        STRING "REPAY TYPE NOT CORECT"
000832               "ACCOUNT: " BORMR-KEY-1(4:16)
000833               "REPAY-TYPE: " TEMP-REPAY-TYPE
000834               DELIMITED BY SIZE INTO FBRVDDL-DESC
000835        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????????" TO ERR-DESC
              WRITE LONERR-REC
000836     END-IF
000837*
000838     IF BOIS-NEGO-RATE-IND = 0 AND BOIS-EFR-CHNG-IND = SPACES
000839        IF BORMR-INT-RATE >= 0
000840           CONTINUE
000841        ELSE 
000842           INITIALIZE FBRVDDL-DESC
000843           STRING "FIX RATE NOT CORRECT "
000844                  "ACCOUNT: " BORMR-KEY-1(4:16)
000845                  "BORMR-INT-RATE: " TEMP-INT-RATE
000846                  "NEGO RATE IND: " BOIS-NEGO-RATE-IND
000847                  "EFR CHNG IND: " BOIS-EFR-CHNG-IND
000848                  DELIMITED BY SIZE INTO FBRVDDL-DESC
000849           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????" TO ERR-DESC
                 WRITE LONERR-REC
000850        END-IF
000851     END-IF
000852*     IF BOIS-NEGO-RATE-IND NOT = 0 OR 
000853*               BOIS-EFR-CHNG-IND NOT = SPACES    
000854*        IF BORMR-INT-RATE = 0 
000855*           CONTINUE
000856*        ELSE
000857*           INITIALIZE FBRVDDL-DESC
000858*           STRING "FIX RATE NOT CORRECT "
000859*                  "ACCOUNT: " BORMR-KEY-1(4:16)
000860*                  "BORMR-INT-RATE: " TEMP-INT-RATE
000861*                  "NEGO RATE IND: " BOIS-NEGO-RATE-IND
000862*                  "EFR CHNG IND: " BOIS-EFR-CHNG-IND
000863*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
000864*           PERFORM B1021-WRITE-FBRVDDL
000865*        END-IF
000866*     END-IF              
000867*
000868     IF BORMR-LOAN-TRM = (BORMR-REM-REPAYS +
000869                         BOIS-LAST-TERM-PAID +
000870                          BOIS-ARREARS-CTR)
000871        IF BORMR-REPAY-SCHED = "B" AND BORMR-REPAY-FREQ = 98
000872           IF BORMR-LOAN-TRM = 1              
000873              CONTINUE
000874           ELSE
000875               INITIALIZE FBRVDDL-DESC
000876               STRING "LOAN TERM NOT CORRECT "
000877                      "ACCOUNT: " BORMR-KEY-1(4:16)
000878                      "BORM LOAN TRM: " TEMP-LOAN-TRM
000879                      "REPAY SCHED: " BORMR-REPAY-SCHED
000880                      "REAPY FREQ: " BORMR-REPAY-FREQ
000881                      DELIMITED BY SIZE INTO FBRVDDL-DESC
000882               PERFORM B1021-WRITE-FBRVDDL
                     MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                     MOVE "????????????" TO ERR-DESC
                     WRITE LONERR-REC
000883           END-IF
000884        END-IF
000885        IF BORMR-REPAY-SCHED NOT = "B" OR BORMR-REPAY-FREQ NOT = 98
000886           IF BORMR-LOAN-TRM >= 1
000887              CONTINUE
000888           ELSE
000889              INITIALIZE FBRVDDL-DESC
000890               STRING "LOAN TERM NOT CORRECT "
000891                      "ACCOUNT: " BORMR-KEY-1(4:16)
000892                      "BORM LOAN TRM: " TEMP-LOAN-TRM
000893                      "REPAY SCHED: " BORMR-REPAY-SCHED
000894                      "REAPY FREQ: " BORMR-REPAY-FREQ
000895                      DELIMITED BY SIZE INTO FBRVDDL-DESC
000896               PERFORM B1021-WRITE-FBRVDDL
                     MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                     MOVE "????????" TO ERR-DESC
                     WRITE LONERR-REC
000897           END-IF
000898        END-IF
000899     ELSE
000900        INITIALIZE FBRVDDL-DESC
000901        STRING "LOAN TERM NOT CORRECT "
000902               "ACCOUNT: " BORMR-KEY-1(4:16)
000903               "BORM LOAN TRM: " TEMP-LOAN-TRM
000904               "REM REPAYS: " TEMP-REM-REPAYS
000905               "LAST TERM PAID: " TEMP-LAST-TERM-PAID
000906               "ARREARS CTR: " TEMP-ARREARS-CTR
000907               DELIMITED BY SIZE INTO FBRVDDL-DESC
000908        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "????????" TO ERR-DESC
              WRITE LONERR-REC
000909     END-IF             
000910*
000911     IF BORMR-TERM-BASIS NOT = "M"
000912        INITIALIZE FBRVDDL-DESC
000913        STRING "TERN BASIS NOT CORRECT "
000914               "ACCOUNT: " BORMR-KEY-1(4:16)
000915               "TERM BASIS: " BORMR-TERM-BASIS
000916               DELIMITED BY SIZE INTO FBRVDDL-DESC
000917        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????" TO ERR-DESC
              WRITE LONERR-REC
000918     END-IF
000919*
000920     IF BORMR-BAD-DEBT-IND NOT = 00 AND 02 AND 50 AND 52 AND 54
000921        INITIALIZE FBRVDDL-DESC
000922        STRING "BAN DEBT IND NOT CORRECT "
000923               "ACCOUNT: " BORMR-KEY-1(4:16)
000924               "BAD DEBT IND: " BORMR-BAD-DEBT-IND
000925               DELIMITED BY SIZE INTO FBRVDDL-DESC
000926        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
000927     END-IF
000928*
000929     IF BORMR-RESIDUAL-IND NOT = 0 AND SPACES
000930        INITIALIZE FBRVDDL-DESC
000931        STRING "RESIDUAL NOT CORRECT "
000932               "ACCOUNT: " BORMR-KEY-1(4:16)
000933               "RESIDUAL IND: " BORMR-RESIDUAL-IND
000934               DELIMITED BY SIZE INTO FBRVDDL-DESC
000935        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
000936     END-IF
000937*
000938     IF BORMR-INT-ACCR >= 0
000939        IF TODAY-DATE >= BOIS-MATURITY-DATE OR 
000940               (BOIS-STOP-ACCRUAL = "Y" AND 
000941        BORMR-BAD-DEBT-IND = 52 OR 54) 
000942                 OR BORMR-BAD-DEBT-IND = 54 OR
000943        BORMR-CAPN-METHOD = "X" OR BOIS-ORIG-APLY-ID NOT = SPACES
000944           IF BORMR-INT-ACCR = 0     
000945              CONTINUE
000946           ELSE
000947              STRING "INT ACCR NOT CORRECT "
000948                     "ACCOUNT: " BORMR-KEY-1(4:16)
000949                     "INT ACCR: " TEMP-INT-ACCR
000950                     "STAT: " BORMR-STAT
000951                     "MATURITY DATE: "     TEMP-MATURITY-DATE
000952                     "ACCRUAL STOP IND: " BOIS-STOP-ACCRUAL
000953                     "BAD DEBT IND: " BORMR-BAD-DEBT-IND
000954                     "CAPN METHOD: " BORMR-CAPN-METHOD
000955                     "ORIG APLU ID: " BOIS-ORIG-APLY-ID
000956                     DELIMITED BY SIZE INTO FBRVDDL-DESC
000957              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "??????" TO ERR-DESC
                    WRITE LONERR-REC
000958           END-IF
000959        END-IF
000960     ELSE
000961        STRING "INT ACCR NOT CORRECT "
000962               "ACCOUNT: " BORMR-KEY-1(4:16)
000963               "INT ACCR: " TEMP-INT-ACCR
000964               DELIMITED BY SIZE INTO FBRVDDL-DESC
000965        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????" TO ERR-DESC
              WRITE LONERR-REC
000966     END-IF
000967     IF BORMR-LOAN-TRM NOT = BORMR-REM-REPAYS
000968     COMPUTE CALCULATED-INT-ACCR ROUNDED = ((TODAY-DATE -
000969                                    BOIS-PREV-DUE-DATE) *
000970                                    BORMR-INT-INCR )
000971     ELSE
000972     COMPUTE CALCULATED-INT-ACCR ROUNDED = ((TODAY-DATE -
000973                                    BORMR-ADV-DATE) *
000974                                    BORMR-INT-INCR )
000975     END-IF
000976     COMPUTE D-VALUE-9 = CALCULATED-INT-ACCR - BORMR-INT-ACCR
000977     MOVE D-VALUE-9 TO D-VALUE-Z
000978     IF (D-VALUE-9 > 0.01 OR 
000979         D-VALUE-9 < -0.01) AND (BORMR-STAT NOT = "12" AND "13")
              AND (BOIS-STOP-ACCRUAL NOT = "Y")
000980        MOVE CALCULATED-INT-ACCR TO IN-CALC-AMT-Z
000981        INITIALIZE FBRVDDL-DESC
000982        STRING "BORMR-INT-ACCR NOT CORRECT 111 "
000983               " ACCOUNT: " BORMR-KEY-1(4:16)
000984               " TODAY-DATE: " TODAY-DATE
000985               " PREV-DUE-DATE: " TEMP-PREV-DUE-DATE
000000               " ADV-DATE: " TEMP-ADV-DATE
                     "ACCRUAL STOP IND: " BOIS-STOP-ACCRUAL
000986               " INT-INCR: " TEMP-INT-INCR
000987               " ACTUAL ACCR: " TEMP-INT-ACCR
000988               "IN CALCED AMT: " IN-CALC-AMT-Z
000989               "D VALUE: " D-VALUE-Z
000990               DELIMITED BY SIZE INTO FBRVDDL-DESC
000991        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????" TO ERR-DESC
              WRITE LONERR-REC
000992     END-IF
000993*
000994*     IF BORMR-INT-INCR >= 0
000995        IF TODAY-DATE < BOIS-MATURITY-DATE AND 
000996            BORMR-THEO-LOAN-BAL > 0 AND
000997            BORMR-STORE-RATE > 0 AND BORMR-CAPN-METHOD NOT = "X"
                  AND BOIS-STOP-ACCRUAL NOT = "Y"
000998            COMPUTE TEMP-BORMR-INT-INCR ROUNDED = 
000999                                           BORMR-THEO-LOAN-BAL * 
001000                                           BORMR-STORE-RATE /
001001                                             360 / 100
001002           COMPUTE D-VALUE-9 = TEMP-BORMR-INT-INCR - 
001003                               BORMR-INT-INCR
001004           IF D-VALUE-9 < -0.01 OR D-VALUE-9 > 0.01
001005              MOVE D-VALUE-9 TO D-VALUE-Z 
001006              MOVE TEMP-BORMR-INT-INCR TO IN-CALC-AMT-Z
001007              INITIALIZE FBRVDDL-DESC
001008              STRING "INT INCR NOT CORRECT "
001009                     "ACCOUNT: " BORMR-KEY-1(4:16)
001010                     "MATURITY DATE: " TEMP-MATURITY-DATE
001011                     "CAPN METHOD: " BORMR-CAPN-METHOD
001012                     "STORE RATE: " TEMP-STORE-RATE
001013                     "THEO BAL: " TEMP-THEO-LOAN-BAL
001014                     "OUT INT INCR: " TEMP-INT-INCR
001015                     "IN INT INCR: " IN-CALC-AMT-Z
001016                     "D VLAUE: " D-VALUE-Z
001017                     DELIMITED BY SIZE INTO FBRVDDL-DESC
001018              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "???????????" TO ERR-DESC
                    WRITE LONERR-REC
001019           END-IF
001020        END-IF
001021        IF TODAY-DATE < BOIS-MATURITY-DATE AND
001022                   BORMR-CAPN-METHOD = "X"
001023           COMPUTE TEMP-DATE = BOIS-MATURITY-DATE - 
001024                                       BORMR-INT-STRT-DATE
001025           IF BORMR-INT-INCR = BORMR-UNEARNED-INT / TEMP-DATE
001026              CONTINUE
001027           ELSE
001028              INITIALIZE FBRVDDL-DESC
001029              STRING "INT INCR NOT CORRECT "
001030                     "ACCOUNT: " BORMR-KEY-1(4:16)
001031                     "INT INCR: " TEMP-INT-INCR
001032                     "MATURITY DATE: " TEMP-MATURITY-DATE
001033                     "CAPN METHOD: " BORMR-CAPN-METHOD
001034                     "INT START DATE: " TEMP-INT-STRT-DATE
001035                     "UNEARNED INT: " TEMP-UNEARNED-INT
001036                     DELIMITED BY SIZE INTO FBRVDDL-DESC
001037              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "???????????" TO ERR-DESC
                    WRITE LONERR-REC
001038           END-IF
001039        END-IF
001040        IF TODAY-DATE >= BOIS-MATURITY-DATE OR 
001041          (BOIS-STOP-ACCRUAL = "Y" AND 
001042             BORMR-BAD-DEBT-IND = 02 OR 52)
001043          OR BORMR-BAD-DEBT-IND = 54
001044           IF BORMR-INT-INCR = 0 
001045              CONTINUE
001046           ELSE
001047              INITIALIZE FBRVDDL-DESC
001048              STRING "INT INCR NOT CORRECT "
001049                     "ACCOUNT: " BORMR-KEY-1(4:16)
001050                     "INT INCR: " TEMP-INT-INCR
001051                     "MATURITY DATE: " TEMP-MATURITY-DATE
001052                     "BAD DEBT IND: " BORMR-BAD-DEBT-IND
001053                     "STOP ACCRUAL: " BOIS-STOP-ACCRUAL
001054                     DELIMITED BY SIZE INTO FBRVDDL-DESC
001055              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "???????????" TO ERR-DESC
                    WRITE LONERR-REC
001056           END-IF
001057        END-IF
001058*     ELSE
001059*        INITIALIZE FBRVDDL-DESC
001060*        STRING "INT INCR NOT CORRECT "
001061*               "ACCOUNT: " BORMR-KEY-1(4:16)
001062*               "INT INCR: " TEMP-INT-INCR
001063*               DELIMITED BY SIZE INTO FBRVDDL-DESC
001064*        PERFORM B1021-WRITE-FBRVDDL
      *        MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
      *        MOVE "???????????" TO ERR-DESC
      *        WRITE LONERR-REC
001065*     END-IF              
001066*
001067     IF BORMR-REPAY-SCHED = "B" OR "F" OR "G" OR "N"
001068*        IF BOIS-SELF-LN-IND = 1 AND BORMR-REPAY-SCHED = "B"
001069        CONTINUE
001070*        ELSE
001071*           INITIALIZE FBRVDDL-DESC
001072*           STRING "REPAY SCHED NOT CORRECT "
001073*                  "ACCOUNT: " BORMR-KEY-1(4:16)
001074*                  "SELF SERVICE LOAN: " BOIS-SELF-LN-IND
001075*                  "REPAY SCHED: " BORMR-REPAY-SCHED
001076*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001077*            PERFORM B1021-WRITE-FBRVDDL
001078*        END-IF
001079     ELSE
001080        INITIALIZE FBRVDDL-DESC
001081        STRING "REPAY SCHED NOT CORRECT "
001082               "ACCOUNT: " BORMR-KEY-1(4:16)
001083               "SELF SERVICE LOAN: " BOIS-SELF-LN-IND
001084               "REPAY SCHED: " BORMR-REPAY-SCHED
001085               DELIMITED BY SIZE INTO FBRVDDL-DESC
001086        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
001087     END-IF
001088*
001089*     IF BORMR-ACT-TYPE = "1019" OR "1021" OR "1204"
001090*        IF BORMR-CAPN-METHOD = "X"
001091*           CONTINUE
001092*        ELSE
001093*           INITIALIZE FBRVDDL-DESC
001094*           STRING "CAPN METHOD NOT CORRECT "
001095*                  "ACCOUNT: " BORMR-KEY-1(4:16)
001096*                  "ACCT TYPE: " BORMR-ACT-TYPE
001097*                  "CAPN METHOD: " BORMR-CAPN-METHOD
001098*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001099*           PERFORM B1021-WRITE-FBRVDDL
001100*        END-IF
001101*     END-IF
001102*     IF BORMR-ACT-TYPE = "1001" OR "1037" OR "1036"
001103*        IF BORMR-CAPN-METHOD = SPACES
001104*           CONTINUE
001105*        ELSE
001106*           INITIALIZE FBRVDDL-DESC
001107*           STRING "CAPN METHOD NOT CORRECT "
001108*                  "ACCOUNT: " BORMR-KEY-1(4:16)
001109*                  "ACT TYPE: " BORMR-ACT-TYPE
001110*                  "CAPN METHOD: " BORMR-CAPN-METHOD
001111*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001112*           PERFORM B1021-WRITE-FBRVDDL
001113*        END-IF
001114*     END-IF
001115*     IF BORMR-ACT-TYPE NOT = "1001" AND "1037" AND "1036" AND 
001116*         "1019" AND "1021" AND "1204"
001117*        IF BORMR-CAPN-METHOD = "1"
001118*           CONTINUE
001119*        ELSE
001120*           INITIALIZE FBRVDDL-DESC
001121*           STRING "CAPN METHOD NOT CORRECT "
001122*                  "ACCOUNT: " BORMR-KEY-1(4:16)
001123*                  "ACT TYPE: " BORMR-ACT-TYPE
001124*                  "CAPN METHOD: " BORMR-CAPN-METHOD
001125*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001126*           PERFORM B1021-WRITE-FBRVDDL
001127*        END-IF
001128*     END-IF
001129*
           IF BOIS-STOP-ACCRUAL = "Y"
              IF (BORMR-INT-ACCR + BORMR-INT-INCR +
                  BORMR-ARR-INT-ACCR + BORMR-UNPD-PRIN-BAL +
                  BORMR-CAP-UNPD-INT + BOIS-UNPD-ARR-PRN-BAL +
                  BORMR-UNPD-ARRS-INT-BAL + BOIS-UNPD-INT-ARR-PRN +
                  BOIS-FINE2-INT-INCR + BOIS-FINE2-INT-ACCR +
                  BORMR-ARR-INT-INCR) NOT = 0 
                 INITIALIZE FBRVDDL-DESC
                 STRING "BOIS-STOP-ACCRUL = Y BUT AMT NOT = 0"
                        "ACCOUNT: " BORMR-KEY-1(4:16)
                        "STOP-ACCRUAL: " BOIS-STOP-ACCRUAL
                        "INT ACCR: " TEMP-INT-ACCR
                        "INT INCR: " TEMP-INT-INCR
                        "ARR INT ACCR: " TEMP-ARR-INT-ACCR
                        "P :" TEMP-UNPD-PRIN-BAL
                        "I: " TEMP-CAP-UNPD-INT
                        "W: " TEMP-UNPD-ARR-PRN-BAL
                        "A: " TEMP-UNPD-ARRS-INT-BAL
                        "E: " TEMP-UNPD-INT-ARR-PRN
                        "FINE2 INCR: " TEMP-FINE2-INT-INCR
                        "FINE2 ACCR: " TEMP-FINE2-INT-ACCR
                        DELIMITED BY SIZE INTO FBRVDDL-DESC
                 PERFORM B1021-WRITE-FBRVDDL
              END-IF
           END-IF              
001130     IF BORMR-RT-INCR >= 0
001131        IF BOIS-RT-INCR-OPTION = ZEROS OR SPACES
001132           IF BORMR-RT-INCR = 0 
001133              CONTINUE
001134           ELSE
001135              INITIALIZE FBRVDDL-DESC
001136              STRING "RATE INCT NOT CORRECT "
001137                     "ACCOUNT: " BORMR-KEY-1(4:16)
001138                     "BORMR-RT-INCR: " TEMP-RT-INCR
001139                     "RT INCR OPTION: " BOIS-RT-INCR-OPTION
001140                     DELIMITED BY SIZE INTO FBRVDDL-DESC
001141              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "????????????" TO ERR-DESC
                    WRITE LONERR-REC
001142           END-IF
001143        END-IF
001144        IF BOIS-RT-INCR-OPTION = 1 
001145           IF BORMR-RT-INCR >= BORP-RT-INCR-MIN-VALUE AND
001146               BORMR-RT-INCR <= BORP-RT-INCR-MAX-VALUE
001147              CONTINUE
001148           ELSE
001149              INITIALIZE FBRVDDL-DESC
001150              STRING "RATE INCR NOT CORRECT "
001151                     "ACCOUNT: " BORMR-KEY-1(4:16)
001152                     "BORMR-RT-INCR: " TEMP-RT-INCR
001153                     "RT INCR OPTION: " BOIS-RT-INCR-OPTION
001154                     "INCR MIN VALUE: " TEMP-RT-INCR-MIN-VALUE
001155                     "INCR MAX VALUE: " TEMP-RT-INCR-MAX-VALUE
001156                     DELIMITED BY SIZE INTO FBRVDDL-DESC
001157              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "????????????" TO ERR-DESC
                    WRITE LONERR-REC
001158           END-IF
001159        END-IF
001160        IF BOIS-RT-INCR-OPTION = 2 
001161           IF BORMR-RT-INCR >= BORP-RT-INCR-MIN-PERC AND 
001162                BORMR-RT-INCR <= BORP-RT-INCR-MAX-PERC
001163              CONTINUE
001164           ELSE
001165              INITIALIZE FBRVDDL-DESC
001166              STRING "RATE INCR NOT CORRECT "
001167                     "ACCOUNT: " BORMR-KEY-1(4:16)
001168                     "BORMR-RT-INCR: " TEMP-RT-INCR
001169                     "RT INCR OPTION: " BOIS-RT-INCR-OPTION
001170                     "INCR MIN PERC: " TEMP-RT-INCR-MIN-PERC
001171                     "INCR MAX PERC: " TEMP-RT-INCR-MAX-PERC
001172                     DELIMITED BY SIZE INTO FBRVDDL-DESC
001173              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "????????????" TO ERR-DESC
                    WRITE LONERR-REC
001174           END-IF
001175        END-IF
001176        IF BORMR-CAPN-METHOD = "X" OR 
001177              BOIS-ORIG-APLY-ID NOT =  SPACES OR
001178              BOIS-SELF-LN-IND = 1
001179           IF BORMR-RT-INCR = 0 
001180              CONTINUE
001181           ELSE
001182              INITIALIZE FBRVDDL-DESC
001183              STRING "RATE INCR NOT CORRECT "
001184                     "ACCOUNT: " BORMR-KEY-1(4:16)
001185                     "BORMR-RT-INCR: " TEMP-RT-INCR
001186                     "CAPN-METHOD: " BORMR-CAPN-METHOD
001187                     "ORIG APLY ID: " BOIS-ORIG-APLY-ID
001188                     "SELF SERVICE: " BOIS-SELF-LN-IND
001189                     DELIMITED BY SIZE INTO FBRVDDL-DESC
001190              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "????????????" TO ERR-DESC
                    WRITE LONERR-REC
001191           END-IF
001192        END-IF
001193*     ELSE
001194*        INITIALIZE FBRVDDL-DESC
001195*        STRING "RATE INCR NOT CORRECT "
001196*               "ACCOUNT: " BORMR-KEY-1(4:16)
001197*               "BORMR-RT-INCR: " TEMP-RT-INCR
001198*               DELIMITED BY SIZE INTO FBRVDDL-DESC
001199*        PERFORM B1021-WRITE-FBRVDDL    
      *        MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
      *        MOVE "????????????" TO ERR-DESC
      *        WRITE LONERR-REC       
001200     END-IF
001201*
001202*     IF BORMR-STORE-RATE >= 0
001203*        IF BOIS-NEGO-RATE-IND = 0 AND 
001204*            BOIS-EFR-CHNG-IND = SPACE OR ZEROS
001205*           IF  BORMR-STORE-RATE = BORMR-INT-RATE
001206*               CONTINUE
001207*           ELSE
001208*              INITIALIZE FBRVDDL-DESC
001209*               STRING "BORM STORE NOT CORRECT "
001210*                      "ACCOUNT : " BORMR-KEY-1(4:16)
001211*                      "STOTE-RATE: " TEMP-STORE-RATE
001212*                      "INT RATE: " TEMP-INT-RATE
001213*                      "NEGO RATE IND: " BOIS-NEGO-RATE-IND
001214*                      "EFR CHNG IND: " BOIS-EFR-CHNG-IND
001215*                      DELIMITED BY SIZE INTO FBRVDDL-DESC
001216*               PERFORM B1021-WRITE-FBRVDDL
001217*           END-IF
001218*        END-IF
001219*     ELSE
001220*        INITIALIZE FBRVDDL-DESC
001221*        STRING "BORM STORE NOT CORRECT "
001222*               "ACCOUNT : " BORMR-KEY-1(4:16)
001223*               "STOTE-RATE: " TEMP-STORE-RATE
001224*               DELIMITED BY SIZE INTO FBRVDDL-DESC
001225*        PERFORM B1021-WRITE-FBRVDDL
001226*     END-IF               
001227*
001228     IF BORMR-CURRENCY-IND = SPACES OR "XXX"
001229        INITIALIZE FBRVDDL-DESC
001230        STRING "CURRENCY NOT CORRECT "
001231               "ACCOUNT: " BORMR-KEY-1(4:16)
001232               "CURRENCY: " BORMR-CURRENCY-IND
001233               DELIMITED BY SIZE INTO FBRVDDL-DESC
001234        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????" TO ERR-DESC
              WRITE LONERR-REC
001235     END-IF
001236*
001237     IF BORMR-CAPN-METHOD = "X" AND BORMR-UNEARNED-INT <= 0
001238        INITIALIZE FBRVDDL-DESC
001239        STRING "UNEARNED INT NOT CORRECT "
001240               "ACCOUNT: " BORMR-KEY-1(4:16)
001241               "UNEARNED INT: " TEMP-UNEARNED-INT
001242               "CAPN METHOD: " BORMR-CAPN-METHOD
001243               DELIMITED BY SIZE INTO FBRVDDL-DESC
001244        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????????" TO ERR-DESC
              WRITE LONERR-REC
001245     END-IF
001246     IF (BORMR-CAPN-METHOD NOT = "X" OR BORP-LOAN-CLASS = 1)
001247          AND BORMR-UNEARNED-INT NOT = 0
001248        INITIALIZE FBRVDDL-DESC
001249        STRING "UNEARNED INT NOT CORRECT "
001250               "ACCOUNT: " BORMR-KEY-1(4:16)
001251               "UNEARNED INT: " TEMP-UNEARNED-INT
001252               "CAPN-METHOD: " BORMR-CAPN-METHOD
001253               "LOAN CLASS: " BORP-LOAN-CLASS
001254               DELIMITED BY SIZE INTO FBRVDDL-DESC
001255        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????????" TO ERR-DESC
              WRITE LONERR-REC
001256     END-IF
001257*
001258*     IF BORMR-REPAY-SCHED = "F"
00125 *       IF BORMR-DUES-RECALC-IND = 1
001260*           CONTINUE
001261*        ELSE
001262*           INITIALIZE FBRVDDL-DESC
001263*           STRING "DUES RECAL IND NOT CORRECT "
001264*                  "ACCOUNT: " BORMR-KEY-1
001265*                  "REPAY SCHED: " BORMR-REPAY-SCHED
001266*                  "DUES RECAL IND: " BORMR-DUES-RECALC-IND
001267*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001268*           PERFORM B1021-WRITE-FBRVDDL
      *           MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
      *           MOVE "???????????????" TO ERR-DESC
      *           WRITE LONERR-REC
001269*        END-IF
001270**     ELSE
001271*        IF BORMR-DUES-RECALC-IND NOT = SPACE
001272*           INITIALIZE FBRVDDL-DESC
001273*           STRING "DUES RECAL IND NOT CORRECT "
001274*                  "ACCOUNT: " BORMR-KEY-1
001275*                  "REPAY SCHED: " BORMR-REPAY-SCHED
001276*                  "DUES RECAL IND: " BORMR-DUES-RECALC-IND
001277*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001278*           PERFORM B1021-WRITE-FBRVDDL
      *           MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
      *           MOVE "???????????????" TO ERR-DESC
      *           WRITE LONERR-REC
001279*        END-IF
001280*     END-IF
001281*
001282     IF BORMR-STMT-FREQUENCY NOT = SPACE AND "D" AND "W"
001283            AND "F" AND "T" AND "M" AND "Q" AND "Y"
001284        INITIALIZE FBRVDDL-DESC
001285        STRING "STATE FREQUENCY NOT RIGHT"
001286               "ACCOUNT: " BORMR-KEY-1(4:16)
001287               "STATEMENT FREQUENCY: " BORMR-STMT-FREQUENCY
001288               DELIMITED BY SIZE INTO FBRVDDL-DESC
001289        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????????" TO ERR-DESC
              WRITE LONERR-REC
001290     END-IF
001291*
001292     IF BORMR-STMT-FREQUENCY = "Q" OR "H" OR "Y"
001293            OR "T" OR "M"           
001294        IF BORMR-STMT-CYCLE < 1 AND BORMR-STMT-CYCLE > 31
001295           INITIALIZE FBRVDDL-DESC
001296           STRING "STATEMENT-CYCLE NOT CORRECT : "
001297                  "ACCOUNT: " BORMR-KEY-1(4:16)
001298                  "STATEMENT-FREQUENCY: " 
001299                      BORMR-STMT-FREQUENCY
001300                  "STATEMENT-CYCLE: " BORMR-STMT-CYCLE
001301                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001302           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????" TO ERR-DESC
                 WRITE LONERR-REC
001303        END-IF
001304     END-IF      
001305     IF BORMR-STMT-FREQUENCY = "W" OR "F"       
001306        IF BORMR-STMT-CYCLE < 1 AND BORMR-STMT-CYCLE > 7
001307           INITIALIZE FBRVDDL-DESC
001308           STRING "STATEMENT-CYCLE NOT CORRECT : "
001309                  "ACCOUNT: " BORMR-KEY-1(4:16)
001310                  "STATEMENT-FREQUENCY: " BORMR-STMT-FREQUENCY
001311                  "STATEMENT-CYCLE: " BORMR-STMT-CYCLE
001312                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001313           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????" TO ERR-DESC
                 WRITE LONERR-REC
001314        END-IF
001315     END-IF      
001316     IF BORMR-STMT-FREQUENCY = SPACE OR "D"       
001317        IF BORMR-STMT-CYCLE NOT = 0
001318           INITIALIZE FBRVDDL-DESC
001319           STRING "STATEMENT-CYCLE NOT CORRECT : "
001320                  "ACCOUNT: " BORMR-KEY-1(4:16)
001321                  "STATEMENT-FREQUENCY: " BORMR-STMT-FREQUENCY
001322                  "STATEMENT-CYCLE: " BORMR-STMT-CYCLE
001323                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001324           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????" TO ERR-DESC
                 WRITE LONERR-REC
001325        END-IF
001326     END-IF      
001327*
001328*     IF BOIS-BUCKET-CDE-06 = "P" AND 
001329*        BOIS-BOIS-BUCKET-06 = BORMR-UNPD-PRIN-BAL
001330*        CONTINUE
001331*     ELSE
001332*        INITIALIZE FBRVDDL-DESC
001333*        STRING "BUCKET-CDE-06 NOT CORRECT "
001334*               "ACCOUNT: " BORMR-KEY-1(4:16)
001335*               "BUCKET-CDE-06: " BOIS-BUCKET-CDE-06
001336*               "BUCKET-DUE: " TEMP-BOIS-BUCKET-06
001337*               "UNPAID-PRIN: " TEMP-UNPD-PRIN-BAL
001338*               DELIMITED BY SIZE INTO FBRVDDL-DESC
001339*        PERFORM B1021-WRITE-FBRVDDL
001340*     END-IF
001341**
001342*     IF BOIS-BUCKET-CDE-07 = "I" AND 
001343*        BOIS-BOIS-BUCKET-07 = BORMR-CAP-UNPD-INT
001344*        CONTINUE
001345*     ELSE
001346*        INITIALIZE FBRVDDL-DESC
001347*        STRING "BUCKET-CDE-07 NOT CORRECT "
001348*               "ACCOUNT: " BORMR-KEY-1(4:16)
001349*               "BUCKET-CDE-07: " BOIS-BUCKET-CDE-07
001350*               "BUCKET-DUE: " TEMP-BOIS-BUCKET-07
001351*               "CAP-UNPAID-INT: " TEMP-CAP-UNPD-INT
001352*               DELIMITED BY SIZE INTO FBRVDDL-DESC
001353*        PERFORM B1021-WRITE-FBRVDDL
001354*     END-IF     
001355**
001356*     IF BOIS-BUCKET-CDE-08 = "W" AND 
001357*        BOIS-BOIS-BUCKET-08 = BOIS-UNPD-ARR-PRN-BAL
001358*        CONTINUE
001359*     ELSE
001360*        INITIALIZE FBRVDDL-DESC
001361*        STRING "BUCKET-CDE-08 NOT CORRECT "
001362*               "ACCOUNT: " BORMR-KEY-1(4:16)
001363*               "BUCKET-CDE-08: " BOIS-BUCKET-CDE-08
001364*               "BUCKET-DUE: " TEMP-BOIS-BUCKET-08
001365*               "W BUCKET IN BOIS: " TEMP-UNPD-ARR-PRN-BAL
001366*               DELIMITED BY SIZE INTO FBRVDDL-DESC
001367*        PERFORM B1021-WRITE-FBRVDDL
001368*     END-IF     
001369**
001370*     IF BOIS-BUCKET-CDE-09 = "A" AND 
001371*        BOIS-BOIS-BUCKET-09 = BORMR-UNPD-ARRS-INT-BAL
001372*        CONTINUE
001373*     ELSE
001374*        INITIALIZE FBRVDDL-DESC
001375*        STRING "BUCKET-CDE-09 NOT CORRECT "
001376*               "ACCOUNT: " BORMR-KEY-1(4:16)
001377*               "BUCKET-CDE-09: " BOIS-BUCKET-CDE-09
001378*               "BUCKET-DUE: " TEMP-BOIS-BUCKET-09
001379*               "A BUCKET IN BORM: " TEMP-UNPD-ARRS-INT-BAL
001380*               DELIMITED BY SIZE INTO FBRVDDL-DESC
001381*        PERFORM B1021-WRITE-FBRVDDL
001382*     END-IF    
001383**
001384*     IF BOIS-BUCKET-CDE-10 = "E" AND 
001385*        BOIS-BOIS-BUCKET-10 = BOIS-UNPD-INT-ARR-PRN
001386*        CONTINUE
001387*     ELSE
001388*        INITIALIZE FBRVDDL-DESC
001389*        STRING "BUCKET-CDE-10 NOT CORRECT "
001390*               "ACCOUNT: " BORMR-KEY-1(4:16)
001391*               "BUCKET-CDE-10: " BOIS-BUCKET-CDE-10
001392*               "BUCKET-DUE: " TEMP-BOIS-BUCKET-10
001393*               "E BUCKET IN BOIS: " TEMP-UNPD-INT-ARR-PRN
001394*               DELIMITED BY SIZE INTO FBRVDDL-DESC
001395*        PERFORM B1021-WRITE-FBRVDDL
001396*     END-IF       
001397*
001398     IF BOIS-LAST-TERM-PAID <= BORMR-LOAN-TRM AND
001399        BOIS-LAST-TERM-PAID <= (BORMR-LOAN-TRM - BORMR-REM-REPAYS)
001400        CONTINUE
001401     ELSE
001402        INITIALIZE FBRVDDL-DESC
001403        STRING "LAST-TERM-PAID NOT CORRECT "
001404               "ACCOUNT: " BORMR-KEY-1(4:16)
001405               "LAST-TERM-PAID: " TEMP-LAST-TERM-PAID
001406               "LOAN-TRM: " TEMP-LOAN-TRM
001407               "REM-REPAYS: " TEMP-REM-REPAYS
001408               DELIMITED BY SIZE INTO FBRVDDL-DESC
001409        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????????" TO ERR-DESC
              WRITE LONERR-REC
001410     END-IF
001411*
001412     IF BORMR-REPAY-SCHED = "B" AND BORMR-REPAY-FREQ = 98 AND
001413        TODAY-DATE >= BOIS-MATURITY-DATE AND BOIS-ARREARS-CTR = 0
001414        IF BOIS-LAST-TERM-PAID = 1
001415           CONTINUE
001416        ELSE
001417           INITIALIZE FBRVDDL-DESC
001418           STRING "LAST-TERM-PAID NOT CORRECT : " 
001419                  "ACCOUNT: " BORMR-KEY-1(4:16)
001420                  "REPAY-SCHED: " BORMR-REPAY-SCHED
001421                  "REPAY-FREQ: " BORMR-REPAY-FREQ
001422                  "MATURITY-DATE: " TEMP-MATURITY-DATE
001423                  "ARREARS-CTR: " TEMP-ARREARS-CTR
001424                  "LAST-TERM-PAID: " TEMP-LAST-TERM-PAID
001425                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001426           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????" TO ERR-DESC
                 WRITE LONERR-REC
001427        END-IF
001428     END-IF
001429     IF BORMR-REPAY-SCHED = "B" AND BORMR-REPAY-FREQ = 98 AND
001430        (TODAY-DATE < BOIS-MATURITY-DATE OR BOIS-ARREARS-CTR > 0)
001431        IF BOIS-LAST-TERM-PAID = 0 
001432           CONTINUE
001433        ELSE
001434           INITIALIZE FBRVDDL-DESC
001435           STRING "LAST-TERM-PAID NOT CORRECT : " 
001436                  "ACCOUNT: " BORMR-KEY-1(4:16)
001437                  "REPAY-SCHED: " BORMR-REPAY-SCHED
001438                  "REPAY-FREQ: " BORMR-REPAY-FREQ
001439                  "MATURITY-DATE: " TEMP-MATURITY-DATE
001440                  "ARREARS-CTR: " TEMP-ARREARS-CTR
001441                  "LAST-TERM-PAID: " TEMP-LAST-TERM-PAID
001442                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001443           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????" TO ERR-DESC
                 WRITE LONERR-REC
001444        END-IF
001445     END-IF
001446*
001447*     IF (BORMR-REPAY-SCHED NOT = "B" OR BORMR-REPAY-FREQ NOT = 98)
001448*         AND BORP-LOAN-CLASS = 0 AND BOIS-ARREARS-CTR = 0
001449*        IF BOIS-LAST-TERM-PAID = 1
001450*           CONTINUE
001451*        ELSE
001452*           INITIALIZE FBRVDDL-DESC
001453*           STRING "LAST-TERM-PAID NOT CORRECT "
001454*                  "ACCOUNT: " BORMR-KEY-1(4:16)
001455*                  "REPAY-FREQ: " BORMR-REPAY-FREQ
001456*                  "REPAY-SCHED: " BORMR-REPAY-SCHED
001457*                  "LOAN-CLASS: " BORP-LOAN-CLASS
001458*                  "ARREARS-CTR: " TEMP-ARREARS-CTR
001459*                  "LAST-TERM-PAID: " TEMP-LAST-TERM-PAID
001460*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001461*           PERFORM B1021-WRITE-FBRVDDL
001462*        END-IF
001463*     END-IF
001464*
001465*     IF (BORMR-REPAY-SCHED NOT = "B" OR BORMR-REPAY-FREQ NOT = 98)
001466*         AND BORP-LOAN-CLASS = 0 AND BOIS-ARREARS-CTR > 0
001467*        IF BOIS-LAST-TERM-PAID = 0
001468*           CONTINUE
001469*        ELSE
001470*           INITIALIZE FBRVDDL-DESC
001471*           STRING "LAST-TERM-PAID NOT CORRECT "
001472*                  "ACCOUNT: " BORMR-KEY-1(4:16)
001473*                  "REPAY-FREQ: " BORMR-REPAY-FREQ
001474*                  "REPAY-SCHED: " BORMR-REPAY-SCHED
001475*                  "LOAN-CLASS: " BORP-LOAN-CLASS
001476*                  "ARREARS-CTR: " TEMP-ARREARS-CTR
001477*                  "LAST-TERM-PAID: " TEMP-LAST-TERM-PAID
001478*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001479*           PERFORM B1021-WRITE-FBRVDDL
001480*        END-IF
001481*     END-IF
001482*
001483     IF (BORMR-REPAY-SCHED NOT = "B" OR BORMR-REPAY-FREQ NOT = 98)
001484          AND BORP-LOAN-CLASS = 1 AND BOIS-ARREARS-CTR = 0 
001485        IF BOIS-LAST-TERM-PAID = (BORMR-LOAN-TRM -
001486                                   BORMR-REM-REPAYS)
001487           CONTINUE
001488        ELSE
001489           INITIALIZE FBRVDDL-DESC
001490           STRING "LAST-TERM-PAID NOT CORRECT "
001491                  "ACCOUNT: " BORMR-KEY-1(4:16)
001492                  "REPAY-FREQ: " BORMR-REPAY-FREQ
001493                  "REPAY-SCHED: " BORMR-REPAY-SCHED
001494                  "LOAN-CLASS: " BORP-LOAN-CLASS
001495                  "ARREARS-CTR: " TEMP-ARREARS-CTR
001496                  "LAST-TERM-PAID: " TEMP-LAST-TERM-PAID
001497                  "REM REPAYS: " TEMP-REM-REPAYS
001498                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001499           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????" TO ERR-DESC
                 WRITE LONERR-REC
001500        END-IF
001501     END-IF 
001502*
001503     IF BOIS-ARREARS-CTR <= BORMR-LOAN-TRM  
001504*        AND   BOIS-ARREARS-CTR <= TEMP-SUM-ARREARS-CNT
001505        CONTINUE
001506     ELSE
001507        INITIALIZE FBRVDDL-DESC
001508        STRING "ARREARS-CTR NOT CORRECT "
001509               "ACCOUNT: " BORMR-KEY-1(4:16)
001510               "ARREARS-CTR: " TEMP-ARREARS-CTR
001511               "LOAN-TRM: " TEMP-LOAN-TRM    
001512               "SUM ARREARS CNT: " TEMP-SUM-ARREARS-CNT
001513               DELIMITED BY SIZE INTO FBRVDDL-DESC
001514        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????????" TO ERR-DESC
              WRITE LONERR-REC
001515     END-IF
001516*
001517     IF BOIS-SELF-LN-IND = 1 AND BOIS-ARREARS-CTR > 0 AND
001518           BOIS-MATURITY-DATE <= TODAY-DATE
001519        IF BOIS-ARREARS-CTR = 1 
001520           CONTINUE
001521        ELSE
001522           INITIALIZE FBRVDDL-DESC
001523           STRING "ARREARS-CTR NOT CORRECT "
001524                  "ACCOUNT: " BORMR-KEY-1(4:16)
001525                  "ARREARS-CTR: " TEMP-ARREARS-CTR
001526                  "SELF-SERVICE-LOAN: " BOIS-SELF-LN-IND
001527                  "MATURITY-DATE: " TEMP-MATURITY-DATE
001528                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001529           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????" TO ERR-DESC
                 WRITE LONERR-REC
001530        END-IF 
001531     END-IF              

001533     IF BOIS-ARREARS-CTR = 0
001534        IF (BORMR-UNPD-PRIN-BAL + BORMR-CAP-UNPD-INT + 
001535            BOIS-UNPD-ARR-PRN-BAL + BORMR-UNPD-ARRS-INT-BAL 
001536            + BOIS-UNPD-INT-ARR-PRN + BOIS-BOIS-BUCKET-06 
001537            + BOIS-BOIS-BUCKET-07 + BOIS-BOIS-BUCKET-08 + 
001538            BOIS-BOIS-BUCKET-09 + BOIS-BOIS-BUCKET-10 = 0)
001539           CONTINUE
001540        ELSE
001541           STRING "HAVE ARREARS BUT SUM BUCKET NOT EQUAL 0"
001542                  "ACCOUNT: " BORMR-KEY-1(4:16)
001543                  "P: " TEMP-UNPD-PRIN-BAL
001544                  "I: " TEMP-CAP-UNPD-INT
001545                  "W: " TEMP-UNPD-ARR-PRN-BAL
001546                  "A: " TEMP-UNPD-ARRS-INT-BAL
001547                  "E: " TEMP-UNPD-INT-ARR-PRN
001548                  "P DUE: " TEMP-BOIS-BUCKET-06 
001549                  "I DUE: " TEMP-BOIS-BUCKET-07
001550                  "W DUE: " TEMP-BOIS-BUCKET-08
001551                  "A DUE: " TEMP-BOIS-BUCKET-09
001552                  "E DUE: " TEMP-BOIS-BUCKET-10
001553                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001554           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????" TO ERR-DESC
                 WRITE LONERR-REC
001555        END-IF
001556     END-IF              
001557*
001558     IF BOIS-NEGO-RATE-IND NOT = "0" AND "2"
001559        INITIALIZE FBRVDDL-DESC
001560        STRING "NEGO-RATE-IND NOT CORRECT "
001561               "ACCOUNT: " BORMR-KEY-1(4:16)
001562               "NEGO-RATE-IND: " BOIS-NEGO-RATE-IND
001563               DELIMITED BY SIZE INTO FBRVDDL-DESC
001564        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
001565     END-IF
001566     IF BOIS-SELF-LN-IND = 1  AND BOIS-NEGO-RATE-IND NOT = 0 
001567        INITIALIZE FBRVDDL-DESC
001568        STRING "NEGO-RATE-IND NOT CORRECT "
001569               "ACCOUNT: " BORMR-KEY-1(4:16)
001570               "NEGO-RATE-IND: " BOIS-NEGO-RATE-IND
001571               "SELF-SERVICE-LOAN: " BOIS-SELF-LN-IND
001572               DELIMITED BY SIZE INTO FBRVDDL-DESC
001573        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
001574     END-IF
001575*
001576     IF BOIS-SELF-LN-IND = 1 
001577        IF BOIS-EFR-CHNG-IND = SPACE
001578           CONTINUE
001579        ELSE
001580            INITIALIZE FBRVDDL-DESC
001581            STRING "EFR-CHNG-IND NOT CORRECT "
001582                   "ACCOUNT: " BORMR-KEY-1(4:16)
001583                   "SELF-SERVICE-LOAN: " BOIS-SELF-LN-IND
001584                   "EFR-CHNG-IND: " BOIS-EFR-CHNG-IND
001585                   DELIMITED BY SIZE INTO FBRVDDL-DESC
001586            PERFORM B1021-WRITE-FBRVDDL
                  MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                  MOVE "??????§¹???????" TO ERR-DESC
                  WRITE LONERR-REC
001587        END-IF
001588     END-IF
001589*
001590     IF BOIS-MATURITY-DATE < BORMR-INT-STRT-DATE
001591        INITIALIZE FBRVDDL-DESC
001592        STRING "MATURITY-DATE NOT CORRECT "
001593               "ACCOUNT: " BORMR-KEY-1(4:16)
001594               "MATURITY-DATE: " TEMP-MATURITY-DATE
001595               "INT-START-DATE: " TEMP-INT-STRT-DATE
001596               DELIMITED BY SIZE INTO FBRVDDL-DESC
001597        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????" TO ERR-DESC
              WRITE LONERR-REC
001598     END-IF
001599     IF BOIS-ORIG-APLY-ID NOT = SPACE AND ZEROS
001600        IF BOIS-MATURITY-DATE = BOIS-FIRST-ADV-DATE
001601           CONTINUE
001602        ELSE
001603           INITIALIZE FBRVDDL-DESC
001604           MOVE BOIS-FIRST-ADV-DATE TO TEMP-DATE
001605           STRING "MATURITY-DATE NOT CORRECT "
001606                  "ACCOUNT: " BORMR-KEY-1(4:16)
001607                  "MATURITY-DATE: " TEMP-MATURITY-DATE
001608                  "ORIG-APLY-ID: " BOIS-ORIG-APLY-ID
001609                  "FIRST-ADV-DATE: " TEMP-DATE
001610                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001611           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????" TO ERR-DESC
                 WRITE LONERR-REC
001612        END-IF
001613     END-IF
001614     IF TEMP-STAT < 08
001615        IF BOIS-MATURITY-DATE = 0
001616           CONTINUE
001617        ELSE
001618           INITIALIZE FBRVDDL-DESC
001619           STRING "MATURITY-DATE NOT CORRECT "
001620                  "ACCOUNT: " BORMR-KEY-1(4:16)
001621                  "STAT: " BORMR-STAT
001622                  "MATURITY-DATE: " TEMP-MATURITY-DATE
001623                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001624           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????" TO ERR-DESC
                 WRITE LONERR-REC
001625        END-IF
001626     END-IF
001627*
001628     IF BORP-LOAN-CLASS = 1 OR  (BORMR-ACT-TYPE = "1201" AND
001629          BORMR-CAT = "0031" OR "0032" OR "0033" 
001630           OR "0034" OR "0035" OR "0036")
001631        IF BOIS-GRACE-PERIOD <= BORMR-LOAN-TRM AND 
001632             BOIS-GRACE-PERIOD <= BOIS-ORIG-GRACE-PERIOD
001633           CONTINUE
001634        ELSE
001635           INITIALIZE FBRVDDL-DESC
001636           STRING "GRACE PERIOD NOT CORRECT "
001637                  "ACCOUNT: " BORMR-KEY-1(4:16)
001638                  "LOAN CLASS: " BORP-LOAN-CLASS
001639                  "ACT-TYPE: " BORMR-ACT-TYPE
001640                  "GRACE-PERIOD: " BOIS-GRACE-PERIOD
001641                  "LOAN-TRM: " TEMP-LOAN-TRM
001642                  "ORIG-GRACE-PERIOD: " BOIS-ORIG-GRACE-PERIOD
001643                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001644           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????" TO ERR-DESC
                 WRITE LONERR-REC
001645        END-IF
001646     END-IF    
001647     IF BORP-LOAN-CLASS = 0 OR NOT (BORMR-ACT-TYPE = "1201" AND
001648          BORMR-CAT = "0031" OR "0032" OR 
001649              "0033" OR "0034" OR "0035" OR "0036")
001650        IF BOIS-GRACE-PERIOD = "0000"
001651           CONTINUE
001652        ELSE
001653           INITIALIZE FBRVDDL-DESC
001654           STRING "GRACE-PERIOD NOT CORRCET"
001655                  "ACCOUNT: " BORMR-KEY-1(4:16)
001656                  "LOAN CLASS: " BORP-LOAN-CLASS
001657                  "ACT-TYPE: " BORMR-ACT-TYPE
001658                  "BORMR-CAT: " BORMR-CAT
001659                  "GRACE-PERIOD: " BOIS-GRACE-PERIOD
001660                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001661           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????" TO ERR-DESC
                 WRITE LONERR-REC
001662        END-IF
001663     END-IF
001664*
001665     IF BORP-LOAN-CLASS = 0 AND BOIS-NEGO-RATE-IND = 2 
001666              AND BORP-RATE-OPT-APPLIC = "N"
001667        IF BOIS-NEGO-RATE-FLAG = "1" OR "2" OR "3"
001668           CONTINUE
001669        ELSE
001670           INITIALIZE FBRVDDL-DESC
001671           STRING "NEGO-RATE-FLAG NOT CORRECT "
001672                  "ACCOUNT: " BORMR-KEY-1(4:16)
001673                  "LOAN-CLASS: " BORP-LOAN-CLASS
001674                  "NEGO-RATE-IND: " BOIS-NEGO-RATE-IND
001675                  "RATE-OPT-APPLIC: " BORP-RATE-OPT-APPLIC
001676                  "NEGO-RATE-FLAG: " BOIS-NEGO-RATE-FLAG
001677                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001678           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "§¿????????????" TO ERR-DESC
                 WRITE LONERR-REC
001679        END-IF
001680     END-IF
001681     IF BORP-LOAN-CLASS = 1 OR BOIS-NEGO-RATE-IND NOT = 2 OR
001682                   BORP-RATE-OPT-APPLIC NOT = "N"
001683        IF BOIS-NEGO-RATE-FLAG = SPACE
001684           CONTINUE
001685        ELSE
001686           INITIALIZE FBRVDDL-DESC
001687           STRING "NEGO-RATE-FLAG NOT CORRECT "
001688                  "ACCOUNT: " BORMR-KEY-1(4:16)
001689                  "LOAN-CLASS: " BORP-LOAN-CLASS
001690                  "NEGO-RATE-IND: " BOIS-NEGO-RATE-IND
001691                  "RATE-OPT-APPLIC: " BORP-RATE-OPT-APPLIC
001692                  "NEGO-RATE-FLAG: " BOIS-NEGO-RATE-FLAG
001693                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001694           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "§¿????????????" TO ERR-DESC
                 WRITE LONERR-REC
001695        END-IF
001696     END-IF
001697*
001698     IF BORMR-REPAY-TYPE = 9
001699        IF BOIS-AUTO-DBT-ACCT-NO = ZEROS OR SPACES
001700           INITIALIZE FBRVDDL-DESC
001701           MOVE BOIS-AUTO-DBT-ACCT-NO TO TEMP-ACCOUNT
001702           STRING "SORD-AUTO-ACCT-NO NO VLAUE"
001703                  "ACCOUNT: " BORMR-KEY-1(4:16)
001704                  "REPAY-TYPE: " TEMP-REPAY-TYPE
001705                  "SORD-AUTO-ACCT-NO: " TEMP-ACCOUNT
001706                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001707           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????" TO ERR-DESC
                 WRITE LONERR-REC
001708        END-IF
001709     END-IF
001710*
001711     IF BOIS-FIRST-ADV-DATE <= BOIS-LST-UNPD-DUE-DTE AND 
001712         BOIS-LST-UNPD-DUE-DTE <= BOIS-MATURITY-DATE
001713         CONTINUE
001714     ELSE
001715        INITIALIZE FBRVDDL-DESC
001716        MOVE BOIS-FIRST-ADV-DATE TO TEMP-DATE
001717        STRING "LAST-UNPAID-DUE-DATE NOT CORRECT "
001718               "ACCOUNT: " BORMR-KEY-1(4:16)
001719               "LAST-UNPAID-DUE-DATE: " TEMP-LST-UNPD-DUE-DTE
001720               "FIRST-ADV-DATE: " TEMP-DATE
001721               "MATURITY-DATE: " TEMP-MATURITY-DATE
001722               DELIMITED BY SIZE INTO FBRVDDL-DESC
001723        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???¦¿????????" TO ERR-DESC
              WRITE LONERR-REC
001724     END-IF
001725     IF BOIS-MATURITY-DATE > TODAY-DATE
001726        IF BOIS-LST-UNPD-DUE-DTE > 0
001727           CONTINUE
001728        ELSE 
001729           INITIALIZE FBRVDDL-DESC
001730           STRING "LAST-UNPAID-DUE-DATE NOT CORRECT "
001731                  "ACCOUNT: " BORMR-KEY-1(4:16)
001732                  "LAST-UNPAID-DUE-DATE: " TEMP-LST-UNPD-DUE-DTE
001733                  "MATURITY-DATE: " TEMP-MATURITY-DATE
001734                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001735           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???¦¿????????" TO ERR-DESC
                 WRITE LONERR-REC
001736        END-IF
001737     END-IF
001738     IF BOIS-MATURITY-DATE > TODAY-DATE AND BOIS-ARREARS-CTR = 0
001739        IF BOIS-LST-UNPD-DUE-DTE = BOIS-NEXT-DUE-DATE    
001740           CONTINUE
001741        ELSE
001742           STRING "LAST-UNPAID-DUE-DATE NOT CORRECT "
001743                  "ACCOUNT: " BORMR-KEY-1(4:16)
001744                  "LAST-UNPAID-DUE-DATE: " 
001745                       TEMP-LST-UNPD-DUE-DTE
001746                  "ARREARS-CTR: " TEMP-ARREARS-CTR
001747                  "MATURITY-DATE :" TEMP-MATURITY-DATE
001748                  "NEXT-DUE-DATE: " TEMP-NEXT-DUE-DATE
001749                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001750           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???¦¿????????" TO ERR-DESC
                 WRITE LONERR-REC
001751        END-IF
001752     END-IF
001753     IF BOIS-SELF-LN-IND = 1 AND 
001754                   (BOIS-MATURITY-DATE > TODAY-DATE OR 
001755          (BOIS-MATURITY-DATE <= TODAY-DATE AND 
001756                BOIS-ARREARS-CTR = 0))
001757        IF BOIS-LST-UNPD-DUE-DTE = BOIS-MATURITY-DATE
001758           CONTINUE
001759        ELSE
001760           INITIALIZE FBRVDDL-DESC
001761           STRING "LAST-TERM-PAID??1 NOT CORRECT "
001762                  "ACCOUNT: " BORMR-KEY-1(4:16)
001763                  "LAST-UNPAID-DUE-DATE: "
001764                    TEMP-LST-UNPD-DUE-DTE
001765                  "SELF-SERVICE-LOAN: " BOIS-SELF-LN-IND
001766                  "MATURITY-DATE: " TEMP-MATURITY-DATE
001767                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001768           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???¦¿????????" TO ERR-DESC
                 WRITE LONERR-REC
001769        END-IF
001770     END-IF              
001771     IF BOIS-FIRST-ADV-DATE <= BOIS-NEXT-DUE-DATE  AND
001772             BOIS-NEXT-DUE-DATE <= BOIS-MATURITY-DATE
001773        CONTINUE
001774     ELSE
001775        INITIALIZE FBRVDDL-DESC
001776        MOVE BOIS-FIRST-ADV-DATE TO TEMP-DATE
001777        STRING "NEXT-DUE-DATE NOT CORRECT "
001778               "ACCOUNT: " BORMR-KEY-1(4:16)
001779               "NEXT-DUE-DATE: " TEMP-NEXT-DUE-DATE
001780               "FIRST-ADV-DATE: " TEMP-DATE
001781               "MATURITY-DATE: " TEMP-MATURITY-DATE
001782               DELIMITED BY SIZE INTO FBRVDDL-DESC
001783        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "????????????" TO ERR-DESC
              WRITE LONERR-REC
001784     END-IF
001785     IF TODAY-DATE >= BOIS-MATURITY-DATE OR 
001786                  BORMR-CAPN-METHOD = "X" OR
001787        (BORMR-REPAY-SCHED = "B" AND 
001788                 BORMR-REPAY-FREQ = 98)
001789        IF BOIS-NEXT-DUE-DATE = BOIS-MATURITY-DATE
001790           CONTINUE
001791        ELSE
001792           INITIALIZE FBRVDDL-DESC
001793           STRING "NEXT-DUE-DATE NOT CORRECT "
001794                  "ACCOUNT: " BORMR-KEY-1(4:16)
001795                  "NEXT-DUE-DATE: " TEMP-NEXT-DUE-DATE
001796                  "MATURITY-DATE: " TEMP-MATURITY-DATE
001797                  "CAPN-METHOD: " BORMR-CAPN-METHOD
001798                  "REPAY-FREQ: " BORMR-REPAY-FREQ
001799                  "REPAY-SCHED: " BORMR-REPAY-SCHED
001800                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001801           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????" TO ERR-DESC
                 WRITE LONERR-REC
001802        END-IF
001803     END-IF
001804*
001805*     IF 0 <= BOIS-LAST-TERM-UNPAID  AND 
001806*          BOIS-ARREARS-CTR = 0 AND
001807*         BOIS-LAST-TERM-UNPAID <= BORMR-LOAN-TRM AND
001808*         BOIS-LAST-TERM-UNPAID = (BORMR-LOAN-TRM - 
001809*                                  BORMR-REM-REPAYS + 1 )
001810*        CONTINUE
001811*     ELSE
001812*       INITIALIZE FBRVDDL-DESC
001813*       STRING "LAST-TERM-UNPAID NOT CORRECT "
001814*              "ACCOUNT: " BORMR-KEY-1(4:16)
001815*              "LAST-TERM-UNPAID: " TEMP-LAST-TERM-UNPAID
001816*              "LOAN-TRM: " TEMP-LOAN-TRM
001817*              "REM-REPAYS: " TEMP-REM-REPAYS
001818*              DELIMITED BY SIZE INTO FBRVDDL-DESC
001819*       PERFORM B1021-WRITE-FBRVDDL
001820*     END-IF
001821*           
001822     IF BORMR-LOAN-TRM = BORMR-REM-REPAYS +
001823                         BOIS-ARREARS-CTR +
001824*                               BOIS-LAST-TERM-UNPAID +
001825                         BOIS-LAST-TERM-PAID
001826        CONTINUE
001827     ELSE
001828        INITIALIZE FBRVDDL-DESC
001829        STRING "TERM NOT MATCH "
001830               "ACCOUNT: " BORMR-KEY-1(4:16)
001831               "LAST-TERM-UNPAID: " TEMP-LAST-TERM-UNPAID
001832               "REM-REPAYS: " TEMP-REM-REPAYS
001833               "ARREARS-CTR: " TEMP-ARREARS-CTR
001834               "LAST-TERM-PAID: " TEMP-LAST-TERM-PAID
001835               "LOAN TERM: " TEMP-LOAN-TRM
001836               DELIMITED BY SIZE INTO FBRVDDL-DESC
001837        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????????" TO ERR-DESC
              WRITE LONERR-REC
001838     END-IF
001839*    IF BOIS-ARREARS-CTR > 0 AND BORP-LOAN-CLASS = 0
001840*       IF BOIS-LAST-TERM-UNPAID = 1
001841*          CONTINUE
001842*       ELSE
001843*          INITIALIZE FBRVDDL-DESC
001844*          STRING "LAST-TERM-UNPAID NOT CORRECT "
001845*                 "ACCOUNT: " BORMR-KEY-1(4:16)
001846*                 "LAST-TERM-UNPAID: " TEMP-LAST-TERM-UNPAID
001847*                 "LOAN-CLASS: " BORP-LOAN-CLASS
001848*                 "ARREARS-CTR: " TEMP-ARREARS-CTR
001849*                 DELIMITED BY SIZE INTO FBRVDDL-DESC
001850*          PERFORM B1021-WRITE-FBRVDDL
001851*       END-IF
001852*    END-IF
001853*
001854*     IF TODAY-DATE < BOIS-MATURITY-DATE AND BOIS-ARREARS-CTR = 0
001855*        IF BOIS-LAST-TERM-UNPAID <= (BORMR-LOAN-TRM - 
001856*                                    BORMR-REM-REPAYS)
001857*           CONTINUE
001858*        ELSE 
001859*           INITIALIZE FBRVDDL-DESC
001860*           STRING "LAST-TERM-UNPAID NOT CORRECT "
001861*                  "ACCOUNT: " BORMR-KEY-1(4:16)
001862*                  "LAST-TERM-UNPAID: " TEMP-LAST-TERM-UNPAID
001863*                  "MATURITY-DATE: " TEMP-MATURITY-DATE
001864*                  "ARREARS-CTR: " TEMP-ARREARS-CTR
001865*                  "LOAN-TRM: " TEMP-LOAN-TRM
001866*                  "REM-REPAYS: " TEMP-REM-REPAYS
001867*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001868*           PERFORM B1021-WRITE-FBRVDDL
001869*        END-IF
001870*     END-IF
001871*     IF TODAY-DATE < BOIS-MATURITY-DATE AND BOIS-ARREARS-CTR = 0
001872*         AND BORP-LOAN-CLASS = 0 AND BORMR-REPAY-SCHED = "B" 
001873*           AND BORMR-REPAY-FREQ = 98
001874*        IF BOIS-LAST-TERM-UNPAID = 1
001875*           CONTINUE
001876*        ELSE
001877*           INITIALIZE FBRVDDL-DESC
001878*           STRING "LAST-TERM-UNPAID NOT CORRCET 333"
001879*                  "ACCOUNT: " BORMR-KEY-1(4:16)
001880*                  "LAST-TERM-UNPAID: " TEMP-LAST-TERM-UNPAID
001881*                  "ARREARS-CTR: " TEMP-ARREARS-CTR
001882*                  "MATURITY-DATE: " TEMP-MATURITY-DATE
001883*                  "LOAN-CLASS: " BORP-LOAN-CLASS
001884*                  "REPAY-SCHED: " BORMR-REPAY-SCHED
001885*                  "REPAY-FREQ: " BORMR-REPAY-FREQ
001886*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001887*           PERFORM B1021-WRITE-FBRVDDL
001888*        END-IF
001889*     END-IF
001890*     IF TODAY-DATE < BOIS-MATURITY-DATE AND BOIS-ARREARS-CTR = 0
001891*         AND BORP-LOAN-CLASS = 0 AND (BORMR-REPAY-SCHED NOT = "B"
001892*                      OR BORMR-REPAY-FREQ NOT = 98)
001893*        IF BOIS-LAST-TERM-UNPAID = 2 
001894*           CONTINUE
001895*        ELSE
001896*           INITIALIZE FBRVDDL-DESC
001897*           STRING "LAST-TERM-UNPAID NOT CORRECT  444"
001898*                  "ACCOUNT: " BORMR-KEY-1(4:16)
001899*                  "LAST-TERM-UNPAID: " TEMP-LAST-TERM-UNPAID
001900*                  "MATURITY-DATE: " TEMP-MATURITY-DATE
001901*                  "ARREARS-CTR: " TEMP-ARREARS-CTR
001902*                  "LOAN-CLASS: " BORP-LOAN-CLASS
001903*                  "REPAY-SCHED: " BORMR-REPAY-SCHED
001904*                  "REPAY-FREQ: " BORMR-REPAY-FREQ
001905*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001906*           PERFORM B1021-WRITE-FBRVDDL
001907*        END-IF
001908*     END-IF
001909*     IF TODAY-DATE >= BOIS-MATURITY-DATE AND BOIS-ARREARS-CTR = 0
001910*        IF BOIS-LAST-TERM-UNPAID = 0
001911*           CONTINUE
001912*        ELSE
001913*           INITIALIZE FBRVDDL-DESC
001914*           STRING "LAST-TERM-UNPAID NOT CORRCET 55"
001915*                  "ACCOUNT: " BORMR-KEY-1(4:16)
001916*                  "LAST-TERM-UNPAID: " TEMP-LAST-TERM-UNPAID
001917*                  "MATURITY-DATE: " TEMP-MATURITY-DATE
001918*                  "ARREARS-CTR: " TEMP-ARREARS-CTR
001919*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001920*           PERFORM B1021-WRITE-FBRVDDL
001921*        END-IF
001922*     END-IF
001923**
001924*     IF BOIS-SELF-LN-IND = 1 AND 
001925*        ((BOIS-MATURITY-DATE > TODAY-DATE) OR 
001926*         (BOIS-MATURITY-DATE <= TODAY-DATE 
001927*             AND BOIS-ARREARS-CTR > 0))
001928*        IF BOIS-LAST-TERM-UNPAID = 1
001929*           CONTINUE
001930*        ELSE
001931*           INITIALIZE FBRVDDL-DESC
001932*           STRING "LAST-TERM-UNPAID NOT CORRECT  666"
001933*                  "ACCOUNT: " BORMR-KEY-1(4:16)
001934*                  "LAST-TERM-UNPAID: " TEMP-LAST-TERM-UNPAID
001935*                  "SELF-SERVICE-LOAN: " BOIS-SELF-LN-IND
001936*                  "MATURITY-DATE: " TEMP-MATURITY-DATE
001937*                  "ARREARS-CTR: " TEMP-ARREARS-CTR
001938*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001939*           PERFORM B1021-WRITE-FBRVDDL
001940*        END-IF
001941*     END-IF
001942*
001943     IF BORMR-BAD-DEBT-IND = 00 OR BORMR-BAD-DEBT-IND = 50
001944        IF BOIS-BAD-DEBT-TRF-DTE = 0 
001945           CONTINUE
001946        ELSE 
001947           INITIALIZE FBRVDDL-DESC
001948           STRING "TO NPL DATE NOT CORRECT "
001949                  "ACCOUNT: " BORMR-KEY-1(4:16)
001950                  "PERF-TRF-DATE: " TEMP-BAD-DEBT-TRF-DTE
001951                  "BAD-DEBT-IND: " BORMR-BAD-DEBT-IND
001952                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001953           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????" TO ERR-DESC
                 WRITE LONERR-REC
001954        END-IF
001955     END-IF
001956*
001957     IF BORMR-BAD-DEBT-IND NOT = 00 AND BORMR-BAD-DEBT-IND NOT = 50
001958        IF BOIS-FIRST-ADV-DATE <= BOIS-BAD-DEBT-TRF-DTE AND 
001959             BOIS-BAD-DEBT-TRF-DTE <= TODAY-DATE
001960           CONTINUE
001961        ELSE
001962           INITIALIZE FBRVDDL-DESC
001963           MOVE BOIS-FIRST-ADV-DATE TO TEMP-DATE
001964           STRING "TO NPL DATE NOT CORRECT  111"
001965                  "ACCOUNT: " BORMR-KEY-1(4:16)
001966                  "NON-PERF-TRF-DATE: " TEMP-BAD-DEBT-TRF-DTE
001967                  "BAD-DEBT-IND: " BORMR-BAD-DEBT-IND
001968                  "FIRST-ADV-DATE: " TEMP-DATE
001969                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001970           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????" TO ERR-DESC
                 WRITE LONERR-REC
001971        END-IF
001972     END-IF
001973     IF BORMR-BAD-DEBT-IND = 54
001974        IF BOIS-TOT-BAD-DEBT-AMT = (
001975                       BORMR-UNPD-PRIN-BAL +
001976                          BORMR-CAP-UNPD-INT +
001977                         BOIS-UNPD-ARR-PRN-BAL +
001978                       BORMR-UNPD-ARRS-INT-BAL +
001979                       BOIS-UNPD-INT-ARR-PRN)
001980           CONTINUE
001981        ELSE 
001982           INITIALIZE FBRVDDL-DESC
001983           STRING "TOT-BAD-DEBT-AMOUNT NOT CORRCET"
001984                  "ACCOUNT: " BORMR-KEY-1(4:16)
001985                  "BAD-DEBT-IND: " BORMR-BAD-DEBT-IND
001986                  "TOT AMT: " TEMP-TOT-BAD-DEBT-AMT
001987                  "P: " TEMP-UNPD-PRIN-BAL
001988                  "I: " TEMP-CAP-UNPD-INT
001989                  "W: " TEMP-UNPD-ARR-PRN-BAL
001990                  "A: " TEMP-UNPD-ARRS-INT-BAL
001991                  "E: " TEMP-UNPD-INT-ARR-PRN
001992                  DELIMITED BY SIZE INTO FBRVDDL-DESC
001993           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????" TO ERR-DESC
                 WRITE LONERR-REC
001994        END-IF
001995     END-IF
001996*
001997     IF BORMR-BAD-DEBT-IND = 00 OR 50
001998        IF BOIS-GL-TRF-ORG-AMT-P = 0 
001999           CONTINUE
002000        ELSE
002001           INITIALIZE FBRVDDL-DESC
002002           STRING "GL-TRNSF-ORIG-AMT-P NOT CORRECT "
002003                  "ACCOUNT: " BORMR-KEY-1(4:16)
002004                  "BAD-DEBT-IND: " BORMR-BAD-DEBT-IND
002005                  "GL-TRNSF-ORIG-AMT-P: " 
002006                       TEMP-GL-TRF-ORG-AMT-P
002007                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002008           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????" TO ERR-DESC
                 WRITE LONERR-REC
002009        END-IF
002010     ELSE
002011        IF BOIS-GL-TRF-ORG-AMT-P > 0
002012           CONTINUE
002013        ELSE
002014           INITIALIZE FBRVDDL-DESC
002015           STRING "GL-TRNSF-ORIG-AMT-P NOT CORRECT "
002016                  "ACCOUNT: " BORMR-KEY-1(4:16)
002017                  "BAD-DEBT-IND: " BORMR-BAD-DEBT-IND
002018                  "GL-TRNSF-ORIG-AMT-P: " 
002019                       TEMP-GL-TRF-ORG-AMT-P
002020                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002021           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????" TO ERR-DESC
                 WRITE LONERR-REC
002022        END-IF
002023     END-IF
002024     IF BORMR-BAD-DEBT-IND = 00 OR 50
002025        IF BOIS-GL-TRF-ORG-AMT-I = 0
002026           CONTINUE
002027        ELSE
002028           INITIALIZE FBRVDDL-DESC
002029           STRING "ORIG-AMT-I NOT CORRCET"
002030                  "ACCOUNT: " BORMR-KEY-1(4:16)
002031                  "BAD-DEBT-IND: " BORMR-BAD-DEBT-IND
002032                  "ORIG-AMT-I: " TEMP-GL-TRF-ORG-AMT-I
002033                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002034           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????" TO ERR-DESC
                 WRITE LONERR-REC
002035         END-IF
002036     ELSE
002037         IF BOIS-GL-TRF-ORG-AMT-I > 0
002038            CONTINUE
002039         ELSE
002040           INITIALIZE FBRVDDL-DESC
002041           STRING "ORIG-AMT-I NOT CORRCET"
002042                  "ACCOUNT: " BORMR-KEY-1(4:16)
002043                  "BAD-DEBT-IND: " BORMR-BAD-DEBT-IND
002044                  "ORIG-AMT-I: " TEMP-GL-TRF-ORG-AMT-I
002045                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002046           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????" TO ERR-DESC
                 WRITE LONERR-REC
002047         END-IF
002048     END-IF
002049*
002050     IF BOIS-ORIG-APLY-ID = "CT"
002051        IF BOIS-CTA-REFERENCE = ZEROS OR SPACES
002052           INITIALIZE FBRVDDL-DESC
002053           STRING "CTA-REFERENCE NOT CORRECT "
002054                  "ACCOUNT: " BORMR-KEY-1(4:16)
002055                  "ORIG-APLY-ID: " BOIS-ORIG-APLY-ID
002056                  "CTA-REFERENCE: " BOIS-CTA-REFERENCE
002057                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002058           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "CTA ?????????" TO ERR-DESC
                 WRITE LONERR-REC
002059        END-IF
002060     END-IF
002061     IF BORP-LOAN-CLASS = 1 OR BOIS-ORIG-APLY-ID NOT = "CT"
002062        IF BOIS-CTA-REFERENCE = ZEROS OR SPACES
002063           CONTINUE
002064        ELSE
002065           INITIALIZE FBRVDDL-DESC
002066           STRING "CTA-REFERENCE NOT CORRECT "
002067                  "ACCOUNT: " BORMR-KEY-1(4:16)
002068                  "ORIG-APLY-ID: " BOIS-ORIG-APLY-ID
002069                  "CTA-REFERENCE: " BOIS-CTA-REFERENCE
002070                  "LOAN-CLASS: " BORP-LOAN-CLASS
002071                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002072           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "CTA ?????????" TO ERR-DESC
                 WRITE LONERR-REC
002073        END-IF
002074     END-IF
002075*
002076     IF BOIS-ORIG-APLY-ID = "CT"
002077        IF BOIS-CTA-PROCESS-FLAG = "B"
002078           CONTINUE
002079        ELSE
002080           INITIALIZE FBRVDDL-DESC
002081           STRING "CTA-PROCESS-FLAG NOT CORRECT "
002082                  "ACCOUNT: " BORMR-KEY-1(4:16)
002083                  "CTA-PROCESS-FLAG: " BOIS-CTA-PROCESS-FLAG
002084                  "ORIG-APLY-ID: " BOIS-ORIG-APLY-ID
002085                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002086           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "CTA??????????" TO ERR-DESC
                 WRITE LONERR-REC
002087        END-IF
002088     END-IF
002089     IF BORP-LOAN-CLASS = 1 OR BOIS-ORIG-APLY-ID NOT = "CT"
002090        IF BOIS-CTA-PROCESS-FLAG = ZEROS OR SPACES
002091           CONTINUE
002092        ELSE
002093           INITIALIZE FBRVDDL-DESC
002094           STRING "CTA-PROCESS-FLAG NOT CORRECT "
002095                  "ACCOUNT: " BORMR-KEY-1(4:16)
002096                  "CTA-PROCESS-FLAG: " BOIS-CTA-PROCESS-FLAG
002097                  "ORIG-APLY-ID: " BOIS-ORIG-APLY-ID
002098                  "LOAN-CLASS: " BORP-LOAN-CLASS
002099                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002100           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "CTA??????????" TO ERR-DESC
                 WRITE LONERR-REC
002101        END-IF
002102     END-IF        
002103*
002104     IF BOIS-FIRST-ADV-DATE <= BOIS-PREV-DUE-DATE AND
002105               BOIS-PREV-DUE-DATE <= BOIS-MATURITY-DATE
002106        CONTINUE
002107     ELSE
002108        IF BORMR-LOAN-TRM = BORMR-REM-REPAYS
002109          AND BOIS-PREV-DUE-DATE = 0
002110           CONTINUE
002111        ELSE
002112        INITIALIZE FBRVDDL-DESC
002113        MOVE BOIS-FIRST-ADV-DATE TO TEMP-DATE
002114        STRING "PREV-DUE-DATE NOT CORRECT "
002115               "ACCOUNT: " BORMR-KEY-1(4:16)
002116               "PREV-DUE-DATE: " TEMP-PREV-DUE-DATE
002117               "FIRST-ADV-DATE: " TEMP-DATE
002118               "MATURITY-DATE: " TEMP-MATURITY-DATE
002119               DELIMITED BY SIZE INTO FBRVDDL-DESC
002120        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "????????????" TO ERR-DESC
              WRITE LONERR-REC
002121        END-IF
002122     END-IF
002123*     IF BOIS-ARREARS-CTR = 0 AND 
002124*          (BORMR-LOAN-TRM - BORMR-REM-REPAYS) > 1
002125*        IF BOIS-PREV-DUE-DATE = (BOIS-NEXT-DUE-DATE - 
002126*                                 BORMR-REPAY-FREQ)
002127*           CONTINUE
002128*        ELSE
002129*           INITIALIZE FBRVDDL-DESC
002130*           STRING "PREV-DUE-DATE NOT CORRCET 111"
002131*                  "ACCOUNT: " BORMR-KEY-1(4:16)
002132*                  "PREV-DUE-DATE: " TEMP-PREV-DUE-DATE
002133*                  "ARREARS-CTR: " TEMP-ARREARS-CTR
002134*                  "LOAN-TRM: " TEMP-LOAN-TRM
002135*                  "REM-REPAYS: " TEMP-REM-REPAYS
002136*                  "NEXT-DUE-DATE: " TEMP-NEXT-DUE-DATE
002137*                  "REPAY-FREQ: " BORMR-REPAY-FREQ
002138*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002139*            PERFORM B1021-WRITE-FBRVDDL
002140*        END-IF
002141*     END-IF
002142     IF TEMP-STAT <= 05 OR (TEMP-STAT >= 08 AND 
002143            (BORMR-LOAN-TRM = BORMR-REM-REPAYS))
002144        IF BOIS-PREV-DUE-DATE = 0
002145           CONTINUE
002146        ELSE
002147           INITIALIZE FBRVDDL-DESC
002148           STRING "PREV-DUE-DATE NOT CORRCET 222"
002149                  "ACCOUNT: " BORMR-KEY-1(4:16)
002150                  "PREV-DUE-DATE: " TEMP-PREV-DUE-DATE
002151                  "STAT: " BORMR-STAT
002152                  "LOAN-TRM: " TEMP-LOAN-TRM
002153                  "REM-REPAYS: " TEMP-REM-REPAYS
002154                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002155           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????" TO ERR-DESC
                 WRITE LONERR-REC
002156        END-IF
002157     END-IF
002158     IF BOIS-ORIG-APLY-ID NOT = ZEROS AND SPACES OR
002159          BOIS-SELF-LN-IND = 1
002160        IF BOIS-PREV-DUE-DATE = BOIS-MATURITY-DATE
002161           CONTINUE
002162        ELSE
002163           INITIALIZE FBRVDDL-DESC
002164           STRING "PREV-DUE-DATE NOT CORRECT  333"
002165                  "ACCOUNT: " BORMR-KEY-1(4:16)
002166                  "PREV-DUE-DATE: " TEMP-PREV-DUE-DATE
002167                  "ORIG-APLY-ID: " BOIS-ORIG-APLY-ID
002168                  "SELF-SERVICE-LOAN: " BOIS-SELF-LN-IND
002169                  "MATURITY-DATE: " TEMP-MATURITY-DATE
002170                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002171           PERFORM B1021-WRITE-FBRVDDL  
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????" TO ERR-DESC
                 WRITE LONERR-REC  
002172        END-IF
002173     END-IF
002174*
002175     IF BOIS-CREDIT-TYPE NOT = "F" AND "M" AND "R"
002176        INITIALIZE FBRVDDL-DESC
002177        STRING "CREDIT-TYPE NOT CORRECT "
002178               "ACCOUNT: " BORMR-KEY-1(4:16)
002179               "CREDIT-TYPE: " BOIS-CREDIT-TYPE
002180               DELIMITED BY SIZE INTO FBRVDDL-DESC
002181        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????????" TO ERR-DESC
              WRITE LONERR-REC
002182     END-IF
002183*     IF BORP-LOAN-CLASS = 1
002184*        IF BOIS-CREDIT-TYPE = "M"
002185*           CONTINUE
002186*        ELSE
002187*           INITIALIZE FBRVDDL-DESC
002188*            STRING "CREDIT-TYPE NOT CORRECT  222"
002189*                   "ACCOUNT: " BORMR-KEY-1(4:16)
002190*                   "CREDIT-TYPE: " BOIS-CREDIT-TYPE
002191*                   "LOAN-CLASS: " BORP-LOAN-CLASS
002192*                   DELIMITED BY SIZE INTO FBRVDDL-DESC
002193*            PERFORM B1021-WRITE-FBRVDDL
002194*        END-IF
002195*     END-IF
002196*
002197*     IF BOIS-INT-RPAT-NTCE NOT = "N" OR
002198*          BOIS-CYCLE-NO NOT =  "001" 
002199*        INITIALIZE FBRVDDL-DESC
002200*        STRING "REPAY-NOTICE OR  CYCLE-NO NOT CORRECT "
002201*               "ACCOUNT: " BORMR-KEY-1(4:16)
002202*               "INT REAPY NOTICE: " BOIS-INT-RPAT-NTCE
002203*               "CYCLE-NO: " BOIS-CYCLE-NO
002204*               DELIMITED BY SIZE INTO FBRVDDL-DESC
002205*        PERFORM B1021-WRITE-FBRVDDL
002206*     END-IF
002207*
002208     IF BOIS-FST-DRWDWN-DATE > BOIS-MATURITY-DATE
002209        INITIALIZE FBRVDDL-DESC
002210        STRING "DRAWDOWN-PD NOT CORRECT "
002211               "ACCOUNT: " BORMR-KEY-1(4:16)
002212               "DRAWDOWN-PD: " TEMP-FST-DRWDWN-DATE
002213               "MATURITY-DATE: " TEMP-MATURITY-DATE
002214               DELIMITED BY SIZE INTO FBRVDDL-DESC
002215        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??¦???????????" TO ERR-DESC
              WRITE LONERR-REC
002216     END-IF              
002217*
002218     IF BOIS-ORIG-GRACE-PERIOD > BORMR-LOAN-TRM
002219        INITIALIZE FBRVDDL-DESC
002220        STRING "ORIG-GRACE-PERIOD NOT CORRECT "
002221               "ACCOUNT: " BORMR-KEY-1(4:16)
002222               "ORIG-GRACE-PERIOD: " BOIS-ORIG-GRACE-PERIOD
002223               "LOAN-TRM: " TEMP-LOAN-TRM
002224               DELIMITED BY SIZE INTO FBRVDDL-DESC
002225         PERFORM B1021-WRITE-FBRVDDL
               MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
               MOVE "??????????" TO ERR-DESC
               WRITE LONERR-REC
002226     END-IF
002227     IF BORMR-ACT-TYPE = "1201" AND BORMR-CAT = "0031" OR "0032" 
002228            OR "0033" OR "0034" OR "0035" OR "0036"
002229        IF BOIS-ORIG-GRACE-PERIOD NOT = "0000"
002230           CONTINUE
002231        ELSE
002232           INITIALIZE FBRVDDL-DESC
002233           STRING "ORIG-GRACE-PERIOD NOT CORRECT  222"
002234                  "ACCOUNT: " BORMR-KEY-1(4:16)
002235                  "ORIG-GRACE-PERIOD: " BOIS-ORIG-GRACE-PERIOD
002236                  "ACT-TYPE: " BORMR-ACT-TYPE
002237                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002238           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????" TO ERR-DESC
                 WRITE LONERR-REC
002239        END-IF
002240     END-IF
002241     IF BORP-LOAN-CLASS = 0 OR NOT (BORMR-ACT-TYPE = "1201" AND
002242        BORMR-CAT = "0031" OR "0032" OR "0033" 
002243                OR "0034" OR "0035" OR "0036")
002244        IF BOIS-ORIG-GRACE-PERIOD = "0000"
002245           CONTINUE
002246        ELSE
002247           INITIALIZE FBRVDDL-DESC
002248           STRING "ORIG-GRACE-PERIOD NOT CORRECT  333"
002249                  "ACCOUNT: " BORMR-KEY-1(4:16)
002250                  "ORIG-GRACE-PERIOD: " BOIS-ORIG-GRACE-PERIOD
002251                  "LOAN-CLASS: " BORP-LOAN-CLASS
002252                  "ACT-TYPE: " BORMR-ACT-TYPE
002253                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002254           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????" TO ERR-DESC
                 WRITE LONERR-REC
002255        END-IF
002256     END-IF
002257*
002258     IF BOIS-RT-INCR-OPTION NOT = 0 AND 1 AND 2
002259        INITIALIZE FBRVDDL-DESC
002260        STRING "RT-INCR-OPTION NOT CORRECT "
002261               "ACCOUNT: " BORMR-KEY-1(4:16)
002262               "RT-INCR-OPTION: " BOIS-RT-INCR-OPTION
002263               DELIMITED BY SIZE INTO FBRVDDL-DESC
002264        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "????????????" TO ERR-DESC
              WRITE LONERR-REC
002265     END-IF
002266     IF BOIS-SELF-LN-IND = 1
002267        IF BOIS-RT-INCR-OPTION = 0 
002268           CONTINUE
002269        ELSE
002270           INITIALIZE FBRVDDL-DESC
002271           STRING "RT-INCR-OPTION NOT CORRCET 222"
002272                  "ACCOUNT: " BORMR-KEY-1(4:16)
002273                  "RT-INCR-OPTION: " BOIS-RT-INCR-OPTION
002274                  "SELF-SERVICE-LOAN: " BOIS-SELF-LN-IND
002275                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002276           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????" TO ERR-DESC
                 WRITE LONERR-REC
002277        END-IF
002278     END-IF
002279*
002280     IF BOIS-FINE1-RT-INCR < 0 
002281        INITIALIZE FBRVDDL-DESC
002282        STRING "FINE1-RT-INCR NOT CORRCET"
002283               "ACCOUNT: " BORMR-KEY-1(4:16)
002284               "FINE1-RT-INCR: " TEMP-FINE1-RT-INCR
002285               DELIMITED BY SIZE INTO FBRVDDL-DESC
002286        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????????" TO ERR-DESC
              WRITE LONERR-REC
002287     END-IF
002288     IF BOIS-FINE1-INCR-OPT =  ZEROS OR SPACES
002289        IF BOIS-FINE1-RT-INCR = 0 
002290           CONTINUE
002291        ELSE
002292           INITIALIZE FBRVDDL-DESC
002293           STRING "FINE1-RT-INCR NOT CORRCET 222"
002294                  "ACCOUNT: " BORMR-KEY-1(4:16)
002295                  "FINE1-RT-INCR: " TEMP-FINE1-RT-INCR
002296                  "FINE1-RT-INCR-OPTION: " BOIS-FINE1-INCR-OPT
002297                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002298           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????????????" TO ERR-DESC
                 WRITE LONERR-REC
002299        END-IF
002300     END-IF
002301     IF BOIS-FINE1-INCR-OPT = 1
002302        IF BOIS-FINE1-RT-INCR >= BORP-FINE1-RT-INCR-MIN-VALUE AND 
002303            BOIS-FINE1-RT-INCR <= BORP-FINE1-RT-INCR-MAX-VALUE
002304           CONTINUE
002305        ELSE
002306           INITIALIZE FBRVDDL-DESC
002307           STRING "FINE1-RT-INCR NOT CORRCET 333"
002308                  "ACCOUNT: " BORMR-KEY-1(4:16)
002309                  "FINE1-RT-INCR: " TEMP-FINE1-RT-INCR
002310                  "RT-INCR-OPTION: " BOIS-FINE1-INCR-OPT
002311                  "MIN-VALUE: " TEMP-FINE1-RT-INCR-MIN-VALUE
002312                  "MAX VALUE: " TEMP-FINE1-RT-INCR-MAX-VALUE
002313                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002314           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????????????" TO ERR-DESC
                 WRITE LONERR-REC
002315        END-IF
002316     END-IF
002317     IF BOIS-FINE1-INCR-OPT = 2
002318        IF BOIS-FINE1-RT-INCR >= BORP-FINE1-RT-INCR-MIN-PERC AND 
002319            BOIS-FINE1-RT-INCR <= BORP-FINE1-RT-INCR-MAX-PERC
002320           CONTINUE
002321        ELSE
002322           INITIALIZE FBRVDDL-DESC
002323           STRING "FINE1-RT-INCR NOT CORRCET 333"
002324                  "ACCOUNT: " BORMR-KEY-1(4:16)
002325                  "FINE1-RT-INCR: " TEMP-FINE1-RT-INCR
002326                  "RT-INCR-OPTION: " BOIS-FINE1-INCR-OPT
002327                  "MIN-VALUE: " TEMP-FINE1-RT-INCR-MIN-PERC
002328                  "MAX VALUE: " TEMP-FINE1-RT-INCR-MAX-PREC
002329                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002330           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????????????" TO ERR-DESC
                 WRITE LONERR-REC
002331        END-IF
002332     END-IF
002333*
002334     IF BOIS-FINE1-INCR-OPT NOT = 0 AND 1 AND 2 
002335        INITIALIZE FBRVDDL-DESC
002336        STRING "FINE1-INCR-OPT NOT CORRECT "
002337               "ACCOUNT: " BORMR-KEY-1(4:16)
002338               "FINE1-INCR-OPT: " BOIS-FINE1-INCR-OPT
002339               DELIMITED BY SIZE INTO FBRVDDL-DESC
002340        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????????????????" TO ERR-DESC
              WRITE LONERR-REC
002341     END-IF
002342     IF BOIS-SELF-LN-IND = 1 
002343        IF BOIS-FINE1-INCR-OPT = 0 
002344           CONTINUE
002345        ELSE
002346           INITIALIZE FBRVDDL-DESC
002347           STRING "FINE1-INCR-OPT NOT CORRECT  222"
002348                  "ACCOUNT: " BORMR-KEY-1(4:16)
002349                  "FINE1-INCR-OPT: " BOIS-FINE1-INCR-OPT
002350                  "SELF-SERVICE-LOAN: " BOIS-SELF-LN-IND
002351                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002352           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????????????" TO ERR-DESC
                 WRITE LONERR-REC
002353        END-IF
002354     END-IF
002355*
002356     IF BOIS-FINE1-INCR-OPT = ZEROS OR SPACES
002357        IF BOIS-FINE1-INT-RATE = BOIS-FINE1-FIX-RATE
002358           CONTINUE
002359        ELSE
002360           INITIALIZE FBRVDDL-DESC
002361           STRING "FINE1-INT-RATE NOT CORRECT "
002362                  "ACCOUNT: " BORMR-KEY-1(4:16)
002363                  "FINE1-INT-RATE: " TEMP-FINE1-INT-RATE
002364                  "FINE1-FIX-RATE: " TEMP-FINE1-FIX-RATE
002365                  "FINE1-INCR-OPT: " BOIS-FINE1-INCR-OPT
002366                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002367           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????????" TO ERR-DESC
                 WRITE LONERR-REC
002368        END-IF
002369     END-IF
002370     IF BOIS-FINE1-INCR-OPT = 1 
002371        IF BOIS-FINE1-INT-RATE = (BORMR-STORE-RATE + 
002372                         BOIS-FINE1-RT-INCR)
002373           CONTINUE
002374        ELSE
002375           INITIALIZE FBRVDDL-DESC
002376           STRING "FINE1-INT-RATE NOT CORRCET 222"
002377                  "ACCOUNT: " BORMR-KEY-1(4:16)
002378                  "FINE1-INT-RATE: " TEMP-FINE1-INT-RATE
002379                  "FINE1-INCR-OPT: " BOIS-FINE1-INCR-OPT
002380                  "STORE-RATE: " TEMP-STORE-RATE
002381                  "FINE1-RT-INCR: " TEMP-FINE1-RT-INCR
002382                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002383           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????????" TO ERR-DESC
                 WRITE LONERR-REC
002384        END-IF
002385     END-IF
002386     IF BOIS-FINE1-INCR-OPT = 2 
002387        COMPUTE WS-FINE1-INT-RATE ROUNDED = BORMR-STORE-RATE * 
002388                      (1 + BOIS-FINE1-RT-INCR / 100)
002389        COMPUTE D-VALUE-9 = WS-FINE1-INT-RATE - 
002390                            BOIS-FINE1-INT-RATE
002391        IF D-VALUE-9 > 0.01 OR D-VALUE-9 < -0.01
002392           MOVE D-VALUE-9 TO D-VALUE-Z 
002393           MOVE WS-FINE1-INT-RATE TO IN-CALC-AMT-Z
002394           INITIALIZE FBRVDDL-DESC
002395           STRING "FINE1-INT-RATE NOT CORRCET 222"
002396                  "ACCOUNT: " BORMR-KEY-1(4:16)
002397                  "FINE1-INCR-OPT: " BOIS-FINE1-INCR-OPT
002398                  "STORE-RATE: " TEMP-STORE-RATE
002399                  "FINE1-RT-INCR: " TEMP-FINE1-RT-INCR
002400                  "FINE1-INT-RATE: " TEMP-FINE1-INT-RATE
002401                  "IN CALC FINE1 INT RATE: " IN-CALC-AMT-Z
002402                  "D-VALUE: " D-VALUE-Z
002403                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002404           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????????" TO ERR-DESC
                 WRITE LONERR-REC
002405        END-IF
002406     END-IF
002407*
002408     IF BOIS-FINE2-INCR-OPT NOT = 0 AND 1 AND 2 
002409        INITIALIZE FBRVDDL-DESC
002410        STRING "FINE2-INCR-OPT NOT CORRECT "
002411               "ACCOUNT: " BORMR-KEY-1(4:16)
002412               "FINE2-INCR-OPT: " BOIS-FINE2-INCR-OPT
002413               DELIMITED BY SIZE INTO FBRVDDL-DESC
002414        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????????????" TO ERR-DESC
              WRITE LONERR-REC
002415     END-IF
002416     IF BOIS-SELF-LN-IND = 1 
002417        IF BOIS-FINE2-INCR-OPT = 0 
002418           CONTINUE
002419        ELSE
002420           INITIALIZE FBRVDDL-DESC
002421           STRING "FINE1-INCR-OPT NOT CORRECT  222"
002422                  "ACCOUNT: " BORMR-KEY-1(4:16)
002423                  "FINE2-INCR-OPT: " BOIS-FINE2-INCR-OPT
002424                  "SELF-SERVICE-LOAN: " BOIS-SELF-LN-IND
002425                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002426           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????????????" TO ERR-DESC
                 WRITE LONERR-REC
002427        END-IF
002428     END-IF
002429*
002430     COMPUTE WS-FINE2-INCR ROUNDED = (BORMR-CAP-UNPD-INT *
002431                                   BOIS-FINE2-INT-RATE /
002432                                   360 / 100)
002433     COMPUTE D-VALUE-9 = WS-FINE2-INCR - BOIS-FINE2-INT-INCR
002434     IF D-VALUE-9 > 0.01 OR D-VALUE-9 < -0.01
002435        MOVE D-VALUE-9 TO D-VALUE-Z
002436        MOVE WS-FINE2-INCR TO IN-CALC-AMT-Z
002437       INITIALIZE FBRVDDL-DESC
002438       STRING "FINE2-INT-INCR NOT CORRECT "
002439              "ACCOUNT: " BORMR-KEY-1(4:16)
002440              "CAP-UNPAID-INT: " TEMP-CAP-UNPD-INT
002441              "FINE2-INT-RATE: " TEMP-FINE2-INT-RATE
002442              "FINE2-INT-INCR: " TEMP-FINE2-INT-INCR
002443              "IN CALC FINE2-INT-INCR: " IN-CALC-AMT-Z
002444              "D-VALUE: " D-VALUE-Z
002445              DELIMITED BY SIZE INTO FBRVDDL-DESC
002446       PERFORM B1021-WRITE-FBRVDDL
             MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
             MOVE "??????????????" TO ERR-DESC
             WRITE LONERR-REC
002447     END-IF
002448     IF BOIS-SELF-LN-IND = 1 
002449        IF BOIS-FINE2-INT-INCR = 0 
002450           CONTINUE
002451        ELSE
002452           INITIALIZE FBRVDDL-DESC
002453           STRING "FINE2-INT-INCR NOT CORRECT  222"
002454                  "ACCOUNT: " BORMR-KEY-1(4:16)
002455                  "FINE2-INT-INCR: " TEMP-FINE2-INT-INCR
002456                  "SELF-SERVICE-LOAN: " BOIS-SELF-LN-IND
002457                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002458           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????????????" TO ERR-DESC
                 WRITE LONERR-REC
002459        END-IF
002460     END-IF
002461     IF BOIS-FINE2-INT-ACCR < 0 
002462        INITIALIZE FBRVDDL-DESC
002463        STRING "FINE2-INT-ACCR NOT CORRECT "
002464               "ACCOUNT: " BORMR-KEY-1(4:16)
002465               "FINE2-INT-ACCR: " TEMP-FINE2-INT-ACCR
002466               DELIMITED BY SIZE INTO FBRVDDL-DESC
002467         PERFORM B1021-WRITE-FBRVDDL
               MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
               MOVE "???????????????" TO ERR-DESC
               WRITE LONERR-REC
002468     END-IF
002469     IF BORMR-CAP-UNPD-INT = 0 OR BOIS-FINE2-INT-RATE = 0 
002470        IF BOIS-FINE2-INT-ACCR NOT = 0 
002471           STRING "FINE2-INT-ACCR NOT CORRECT  222"
002472                  "ACCOUNT: " BORMR-KEY-1(4:16)
002473                  "FINE2-INT-ACCR: " TEMP-FINE2-INT-ACCR
002474                  "CAP-UNPAID-INT: " TEMP-CAP-UNPD-INT
002475                  "FINE2-INT-RATE: " TEMP-FINE2-INT-RATE
002476                  "LOAN CLASS: " BORP-LOAN-CLASS
002477                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002478           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????????" TO ERR-DESC
                 WRITE LONERR-REC
002479        END-IF
002480     END-IF
002481     IF BOIS-FINE2-INCR-OPT = ZEROS OR SPACES
002482        IF BOIS-FINE2-INT-RATE = BOIS-FINE2-FIX-RATE
002483           CONTINUE
002484        ELSE
002485           INITIALIZE FBRVDDL-DESC
002486           STRING "FINE2-INT-RATE NOT CORRECT "
002487                  "ACCOUNT: " BORMR-KEY-1(4:16)
002488                  "FINE2-INT-RATE: " TEMP-FINE2-INT-RATE
002489                  "FINE2-FIX-RATE: " TEMP-FINE2-FIX-RATE
002490                  "FINE2-INCR-OPT: " BOIS-FINE2-INCR-OPT
002491                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002492           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????????" TO ERR-DESC
                 WRITE LONERR-REC
002493        END-IF
002494     END-IF
002495     IF BOIS-FINE2-INCR-OPT = 1 
002496        IF BOIS-FINE2-INT-RATE = (BORMR-STORE-RATE + 
002497                         BOIS-FINE2-RT-INCR)
002498           CONTINUE
002499        ELSE
002500           INITIALIZE FBRVDDL-DESC
002501           STRING "FINE2-INT-RATE NOT CORRCET 222"
002502                  "ACCOUNT: " BORMR-KEY-1(4:16)
002503                  "FINE2-INT-RATE: " TEMP-FINE2-INT-RATE
002504                  "FINE2-INCR-OPT: " BOIS-FINE2-INCR-OPT
002505                  "STORE-RATE: " TEMP-STORE-RATE
002506                  "FINE2-RT-INCR: " TEMP-FINE2-RT-INCR
002507                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002508           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????????" TO ERR-DESC
                 WRITE LONERR-REC
002509        END-IF
002510     END-IF
002511     IF BOIS-FINE2-INCR-OPT = 2 
002512        COMPUTE WS-FINE2-INT-RATE ROUNDED = BORMR-STORE-RATE * 
002513                      (1 + BOIS-FINE2-RT-INCR / 100)
002514        COMPUTE D-VALUE-9 = WS-FINE2-INT-RATE - 
002515                            BOIS-FINE2-INT-RATE
002516        IF D-VALUE-9 > 0.01 OR D-VALUE-9 < -0.01
002517           MOVE D-VALUE-9 TO D-VALUE-Z
002518           MOVE WS-FINE2-INT-RATE TO IN-CALC-AMT-Z
002519           INITIALIZE FBRVDDL-DESC
002520           STRING "FINE2-INT-RATE NOT CORRCET 222"
002521                  "ACCOUNT: " BORMR-KEY-1(4:16)
002522                  "FINE2-INCR-OPT: " BOIS-FINE2-INCR-OPT
002523                  "STORE-RATE: " TEMP-STORE-RATE
002524                  "FINE2-RT-INCR: " TEMP-FINE2-RT-INCR
002525                  "FINE2-INT-RATE: " TEMP-FINE2-INT-RATE
002526                  "CALCED FINE2-INT-RATE: " IN-CALC-AMT-Z
002527                  "D-VALUE: " D-VALUE-Z
002528                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002529           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????????" TO ERR-DESC
                 WRITE LONERR-REC
002530        END-IF
002531     END-IF
002532     IF BOIS-SELF-LN-IND = 1 
002533        IF BOIS-FINE2-INT-RATE = 0 AND 
002534            BOIS-FINE2-FIX-RATE = 0
002535           CONTINUE
002536        ELSE
002537           INITIALIZE FBRVDDL-DESC
002538           STRING "FINE2-INT-RATE OR FINE2-FIX-RATE NOT CORRECT "
002539                  "ACCOUNT: " BORMR-KEY-1(4:16)
002540                  "SELF-SERVICE-LOAN: " BOIS-SELF-LN-IND
002541                  "FINE2-FIX-RATE: " TEMP-FINE2-FIX-RATE
002542                  "FINE2-INT-RATE: " TEMP-FINE2-INT-RATE
002543                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002544           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????????" TO ERR-DESC
                 WRITE LONERR-REC
002545        END-IF
002546     END-IF
002547*
002548     IF BOIS-FINE1-GRACE-PERIOD < 0 
002549        INITIALIZE FBRVDDL-DESC
002550        STRING "FINE1-GRACE-PERIOD NOT CORRECT "
002551               "ACCOUNT: " BORMR-KEY-1(4:16)
002552               "FINE1-GRACE-PERIOD: " BOIS-FINE1-GRACE-PERIOD
002553               DELIMITED BY SIZE INTO FBRVDDL-DESC
002554        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????????????" TO ERR-DESC
              WRITE LONERR-REC
002555     END-IF
002556     IF BORP-LOAN-CLASS = 1 
002557        IF BOIS-FINE1-GRACE-PERIOD = "00" 
002558           CONTINUE
002559        ELSE
002560           INITIALIZE FBRVDDL-DESC
002561           STRING "FINE1-GRACE-PERIOD NOT CORRECT  222"
002562                  "ACCOUNT: " BORMR-KEY-1(4:16)
002563                  "FINE1-GRACE-PERIOD: " BOIS-FINE1-GRACE-PERIOD
002564                  "LOAN-CLASS: " BORP-LOAN-CLASS
002565                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002566           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????????????" TO ERR-DESC
                 WRITE LONERR-REC
002567        END-IF
002568     END-IF
002569*
002570     IF BOIS-FINE2-GRACE-PERIOD NOT = "00" 
002571        INITIALIZE FBRVDDL-DESC
002572        STRING "FINE2-GRACE-PERIOD NOT CORRECT "
002573               "ACCOUNT: " BORMR-KEY-1(4:16)
002574               "FINE2-GRACE-PERIOD: " BOIS-FINE2-GRACE-PERIOD
002575               DELIMITED BY SIZE INTO FBRVDDL-DESC
002576        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "????????????????" TO ERR-DESC
              WRITE LONERR-REC
002577     END-IF
002578     IF BOIS-NO-OF-EXTN-MADE < 0 
002579        INITIALIZE FBRVDDL-DESC
002580        STRING "NO-OF-EXTNS-MADE NOT CORRECT "
002581               "ACCOUNT: " BORMR-KEY-1(4:16)
002582               "NO-OF-EXTNS-MADE: " BOIS-NO-OF-EXTN-MADE
002583               DELIMITED BY SIZE INTO FBRVDDL-DESC
002584        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
002585     END-IF
002586*     IF BORMR-ACT-TYPE = "1019" OR "1025" OR "1001"
002587*        IF BOIS-CONTRACT-NO = ZEROS OR SPACES
002588*           INITIALIZE FBRVDDL-DESC
002589*           STRING "COMPANY LOAN CONTRACT-NO ZERO"
002590*                  "ACCOUNT: " BORMR-KEY-1(4:16)
002591*                  "CONTRACT-NO: " BOIS-CONTRACT-NO
002592*                  "ACT-TYPE: " BORMR-ACT-TYPE
002593*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002594*           PERFORM B1021-WRITE-FBRVDDL
002595*        END-IF
002596*     END-IF
002597     IF BORMR-ACT-TYPE = "7302" OR "7303" OR "7301"
002598        IF BOIS-FUND-AGR-NO = ZEROS OR SPACES
002599           INITIALIZE FBRVDDL-DESC
002600           STRING "FUND ACCT AGREEMENT-NO ZERO"
002601                  "ACCOUNT: " BORMR-KEY-1(4:16)
002602                  "FUND-AGREEMENT-NO: " BOIS-FUND-AGR-NO
002603                  "ACT-TYPE: " BORMR-ACT-TYPE
002604                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002605           PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???§¿??????" TO ERR-DESC
              WRITE LONERR-REC
002606        END-IF
002607     ELSE
002608        IF BOIS-FUND-AGR-NO NOT = ZEROS AND SPACES
002609           INITIALIZE FBRVDDL-DESC
002610           STRING "ACCT AGREEMENT-NO HAS VALUE"
002611                  "ACCOUNT: " BORMR-KEY-1(4:16)
002612                  "FUND-AGREEMENT-NO: " BOIS-FUND-AGR-NO
002613                  "ACT-TYPE: " BORMR-ACT-TYPE
002614                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002615           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???§¿??????" TO ERR-DESC
                 WRITE LONERR-REC
002616        END-IF
002617     END-IF
002618     IF BOIS-ARREARS-CTR = 0 
002619        IF BOIS-UNPD-ARR-PRN-BAL NOT = 0 
002620           INITIALIZE FBRVDDL-DESC
002621           STRING "P NOT CORRECT "
002622                  "ACCOUNT: " BORMR-KEY-1(4:16)
002623                  "P AMT: " TEMP-UNPD-ARR-PRN-BAL
002624                  "ARREARS-CTR: " TEMP-ARREARS-CTR
002625                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002626           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "P???????" TO ERR-DESC
                 WRITE LONERR-REC
002627        END-IF
002628     END-IF
002629     IF BOIS-UNPD-INT-ARR-PRN >= 0 
002630        IF BOIS-ARREARS-CTR = 0 
002631           IF BOIS-UNPD-INT-ARR-PRN NOT = 0 
002632              INITIALIZE FBRVDDL-DESC
002633              STRING "E AMT NOT RIGHT"
002634                     "ACCOUNT: " BORMR-KEY-1(4:16)
002635                     "E AMT: " TEMP-UNPD-INT-ARR-PRN
002636                     "ARREARS-CTR: " TEMP-ARREARS-CTR
002637                     DELIMITED BY SIZE INTO FBRVDDL-DESC
002638              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "E?????" TO ERR-DESC
                    WRITE LONERR-REC
002639           END-IF
002640        END-IF
002641        IF BORP-LOAN-CLASS = 1 
002642           IF BOIS-UNPD-INT-ARR-PRN NOT = 0 
002643              INITIALIZE FBRVDDL-DESC
002644              STRING "E AMT NOT RIGHT"
002645                     "ACCOUNT: " BORMR-KEY-1(4:16)
002646                     "E AMT: " TEMP-UNPD-INT-ARR-PRN
002647                     "LOAN-CLASS: " BORP-LOAN-CLASS
002648                     DELIMITED BY SIZE INTO FBRVDDL-DESC
002649              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "E?????" TO ERR-DESC
                    WRITE LONERR-REC
002650           END-IF
002651        END-IF
002652     ELSE
002653        STRING "E AMT NOT RIGHT"
002654               "ACCOUNT: " BORMR-KEY-1(4:16)
002655               "E AMT: " TEMP-UNPD-INT-ARR-PRN
002656                DELIMITED BY SIZE INTO FBRVDDL-DESC
002657        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "E?????" TO ERR-DESC
              WRITE LONERR-REC
002658     END-IF
002659     IF BOIS-HOL-POST-ACCRU NOT = "N"
002660        STRING "PAST-ACCRU NOT CORRECT "
002661               "ACCOUNT: " BORMR-KEY-1
002662               "PAST-ACCRU: " BOIS-HOL-POST-ACCRU
002663               DELIMITED BY SIZE INTO FBRVDDL-DESC
002664        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
002665     END-IF
002666     IF BORMR-ACT-TYPE = "7302" OR "7303" OR "7301"
002667        IF BOIS-OFF-BAL-FUND-PERC NOT = 100
002668           INITIALIZE FBRVDDL-DESC
002669           STRING "FUND OFF BAL-FUND-AGREEMENT-NO NOT CORRECT "
002670                  "ACCOUNT: " BORMR-KEY-1(4:16)
002671                  "OFF-BAL-FUND-PERC: " BOIS-OFF-BAL-FUND-PERC
002672                  "ACT-TYPE: " BORMR-ACT-TYPE
002673                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002674           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??§ӿ??????????" TO ERR-DESC
                 WRITE LONERR-REC
002675        END-IF
002676     ELSE
002677        IF BOIS-OFF-BAL-FUND-PERC NOT = "000" 
002678           INITIALIZE FBRVDDL-DESC
002679           STRING "FUND OFF BAL-FUND-AGREEMENT-NO NOT CORRECT "
002680                  "ACCOUNT: " BORMR-KEY-1(4:16)
002681                  "OFF-BAL-FUND-PERC: " BOIS-OFF-BAL-FUND-PERC
002682                  "ACT-TYPE: " BORMR-ACT-TYPE
002683                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002684           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??§ӿ??????????" TO ERR-DESC
                 WRITE LONERR-REC
002685        END-IF
002686     END-IF
002687     IF BOIS-FEE-PRVN-AMT NOT = 0 
002688        INITIALIZE FBRVDDL-DESC
002689        STRING "FEE-PRVN-AMT NOT CORRECT "
002690               "ACCOUNT: " BORMR-KEY-1
002691               "FEE-PRVN-AMT: " TEMP-FEE-PRVN-AMT
002692               DELIMITED BY SIZE INTO FBRVDDL-DESC
002693        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???y??" TO ERR-DESC
              WRITE LONERR-REC
002694     END-IF
002695     IF BOIS-MIN-REPAY-AMT-PC NOT = 0 
002696        INITIALIZE FBRVDDL-DESC
002697        STRING "MIN-REPAY-AMT-PC NOT CORRECT "
002698               "ACCOUNT: " BORMR-KEY-1
002699               "MIN-REPAY-AMT-PC: " TEMP-MIN-REPAY-AMT-PC
002700               DELIMITED BY SIZE INTO FBRVDDL-DESC
002701        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??§³?????" TO ERR-DESC
              WRITE LONERR-REC
002702     END-IF
002703     IF BOIS-PRINCIPAL-NOT-DAYS < 0 
002704        INITIALIZE FBRVDDL-DESC
002705        STRING "PRIN NOTICE-DAYS NOT CORRECT "
002706               "ACCOUNT: " BORMR-KEY-1
002707               "PRIN NOTICE-DAYS: " BOIS-PRINCIPAL-NOT-DAYS
002708               DELIMITED BY SIZE INTO FBRVDDL-DESC
002709        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????" TO ERR-DESC
              WRITE LONERR-REC
002710     END-IF
002711     IF BOIS-INTEREST-NOT-DAYS < 0 
002712        INITIALIZE FBRVDDL-DESC
002713        STRING "INT NOTICE-DAYS NOT CORRECT "
002714               "ACCOUNT: " BORMR-KEY-1
002715               "INT NOTICE-DAYS: " BOIS-INTEREST-NOT-DAYS
002716               DELIMITED BY SIZE INTO FBRVDDL-DESC
002717        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????" TO ERR-DESC
              WRITE LONERR-REC
002718     END-IF
002719     IF BORMR-UNPD-CHRG-BAL NOT = 0 
002720        INITIALIZE FBRVDDL-DESC
002721        STRING "UNPAID-CHRG-BAL NOT CORRECT "
002722               "ACCOUNT: " BORMR-KEY-1
002723               "UNPAID-CHRG-BAL: " TEMP-UNPD-CHRG-BAL
002724               DELIMITED BY SIZE INTO FBRVDDL-DESC
002725        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????" TO ERR-DESC
              WRITE LONERR-REC
002726     END-IF
002727     IF BORMR-UNPD-PRIN-BAL >= 0 AND
002728       BORMR-UNPD-PRIN-BAL = (BORMR-LOAN-BAL - 
002729                            BORMR-THEO-LOAN-BAL)
002730        IF TODAY-DATE >= BOIS-MATURITY-DATE
002731           IF BORMR-UNPD-PRIN-BAL NOT = BORMR-LOAN-BAL
002732              INITIALIZE FBRVDDL-DESC
002733              STRING "P NOT CORRECT "
002734                     "ACCOUNT: " BORMR-KEY-1(4:16)
002735                     "P AMT: " TEMP-UNPD-PRIN-BAL
002736                     "LOAN-BAL: " TEMP-LOAN-BAL
002737                     "ACCT-TYPE: " BORMR-ACT-TYPE
002738                     "MATURITY-DATE: " TEMP-MATURITY-DATE
002739                     DELIMITED BY SIZE INTO FBRVDDL-DESC
002740              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "P?????" TO ERR-DESC
                    WRITE LONERR-REC
002741           END-IF
002742        END-IF
002743        IF BOIS-ARREARS-CTR = 0 
002744           IF BORMR-UNPD-PRIN-BAL NOT = 0 
002745              INITIALIZE FBRVDDL-DESC
002746              STRING "P AMT NOT CORRECT "
002747                     "ACCOUNT: " BORMR-KEY-1(4:16)
002748                     "P AMT: " TEMP-UNPD-PRIN-BAL
002749                     "ARREARS-CTR: " TEMP-ARREARS-CTR
002750                     DELIMITED BY SIZE INTO FBRVDDL-DESC
002751              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "P?????" TO ERR-DESC
                    WRITE LONERR-REC
002752           END-IF
002753        END-IF
002754     ELSE
002755        INITIALIZE FBRVDDL-DESC
002756        STRING "P AMT NOT CORRECT "
002757               "ACCOUNT: " BORMR-KEY-1(4:16)
002758               "P AMT: " TEMP-UNPD-PRIN-BAL
002759               "LOAN-BAL: " TEMP-LOAN-BAL
002760               "THEO-LOAN-BAL: " TEMP-THEO-LOAN-BAL
002761               DELIMITED BY SIZE INTO FBRVDDL-DESC
002762        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "P?????" TO ERR-DESC
              WRITE LONERR-REC
002763     END-IF
002764     IF BORMR-CAP-UNPD-INT >= 0
002765        IF BOIS-ARREARS-CTR = 0 
002766           IF BORMR-CAP-UNPD-INT NOT = 0 
002767              INITIALIZE FBRVDDL-DESC
002768              STRING "I AMT NOT CORRECT "
002769                     "ACCOUNT: " BORMR-KEY-1(4:16)
002770                     "I AMT: " TEMP-CAP-UNPD-INT
002771                     "ARREARS-CTR: " TEMP-ARREARS-CTR
002772                     DELIMITED BY SIZE INTO FBRVDDL-DESC
002773              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "I?????" TO ERR-DESC
                    WRITE LONERR-REC
002774           END-IF
002775        END-IF
002776     ELSE 
002777        INITIALIZE FBRVDDL-DESC
002778        STRING "I AMT NOT CORRECT "
002779               "ACCOUNT: " BORMR-KEY-1(4:16)
002780               "I AMT: " TEMP-CAP-UNPD-INT
002781               DELIMITED BY SIZE INTO FBRVDDL-DESC
002782        PERFORM B1021-WRITE-FBRVDDL 
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "I?????" TO ERR-DESC
              WRITE LONERR-REC
002783     END-IF
002784     IF BOIS-FIN-AC-IND NOT = "N"
002785        INITIALIZE FBRVDDL-DESC
002786        STRING "FIN-AC-IND NOT CORRECT "
002787               "ACCOUNT: " BORMR-KEY-1(4:16)
002788               "FIN-AC-IND: " BOIS-FIN-AC-IND
002789               DELIMITED BY SIZE INTO FBRVDDL-DESC
002790        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????????" TO ERR-DESC
              WRITE LONERR-REC
002791     END-IF
002792     IF BOIS-AUTO-RISK-GRADE = 00 OR 01 OR 02 OR 03 OR 04
002793        IF BOIS-SELF-LN-IND = 1 
002794           IF BOIS-AUTO-RISK-GRADE NOT = 00 
002795              INITIALIZE FBRVDDL-DESC
002796              STRING "AUTO-RISK-GRADE"
002797                     "ACCOUNT: " BORMR-KEY-1(4:16)
002798                     "AUTO-RISK-GRADE: " BOIS-AUTO-RISK-GRADE
002799                     "SELF-SERVICE-LOAN: " BOIS-SELF-LN-IND
002800                     DELIMITED BY SIZE INTO FBRVDDL-DESC
002801              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "??????????" TO ERR-DESC
                    WRITE LONERR-REC
002802           END-IF
002803        END-IF
002804     ELSE
002805        INITIALIZE FBRVDDL-DESC
002806        STRING "AUTO-RISK-GRADE"
002807               "ACCOUNT: " BORMR-KEY-1(4:16)
002808               "AUTO-RISK-GRADE: " BOIS-AUTO-RISK-GRADE
002809               DELIMITED BY SIZE INTO FBRVDDL-DESC
002810        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
002811     END-IF 
002812     IF BOIS-SUBSIDY-PERC >= 0 
002813        IF BORMR-ACT-TYPE = "1201" AND 
002814          BORMR-CAT = "0031" OR "0032" OR "0033"
002815              OR "0034" OR "0035" OR "0036"
002816           IF BOIS-SUBSIDY-PERC NOT = 50 AND 100
002817              INITIALIZE FBRVDDL-DESC
002818              STRING "STUDENT LOAN SUBSIDY-PERC NOT CORRECT "
002819                     "ACCOUNT: " BORMR-KEY-1(4:16)
002820                     "SUBSIDY-PERC: " BOIS-SUBSIDY-PERC
002821                     "ACT-TYPE: " BORMR-ACT-TYPE
002822                     DELIMITED BY SIZE INTO FBRVDDL-DESC
002823              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "??????????" TO ERR-DESC
                    WRITE LONERR-REC
002824           END-IF
002825        END-IF
002826        IF BORP-LOAN-CLASS = 0 OR NOT (BORMR-ACT-TYPE = "1201" 
002827             AND BORMR-CAT = "0031" OR "0032" OR 
002828                     "0033" OR "0034" OR "0035" OR "0036")
002829           IF BOIS-SUBSIDY-PERC NOT = 0 
002830              INITIALIZE FBRVDDL-DESC
002831              STRING "NOT STUDENT LOAN SUBSIDY-PERC ZERO"
002832                     "ACCOUNT: " BORMR-KEY-1(4:16)
002833                     "SUBSIDY-PERC: " BOIS-SUBSIDY-PERC
002834                     "LOAN-CLASS: " BORP-LOAN-CLASS
002835                     "ACT-TYPE: " BORMR-ACT-TYPE
002836                     DELIMITED BY SIZE INTO FBRVDDL-DESC
002837              PERFORM B1021-WRITE-FBRVDDL
                    MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                    MOVE "??????????" TO ERR-DESC
                    WRITE LONERR-REC
002838           END-IF
002839        END-IF
002840     ELSE
002841        INITIALIZE FBRVDDL-DESC
002842        STRING "SUBSIDY-PERC SMALLER THAN ZERO"
002843               "ACCOUNT: " BORMR-KEY-1(4:16)
002844               "SUBSIDY-PERC: " BOIS-SUBSIDY-PERC
002845               DELIMITED BY SIZE INTO FBRVDDL-DESC
002846        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
002847     END-IF
002848     IF BORMR-ACT-TYPE = "1201" AND BORMR-CAT = "0031" OR "0032" 
002849               OR "0033" OR "0034" OR "0035" OR "0036"
002850        IF BOIS-SUBSIDY-ACNO = ZEROS OR SPACES
002851           INITIALIZE FBRVDDL-DESC
002852           STRING "STUDENT LOAN SUBSIDY-ACNO ZERO"
002853                  "ACCOUNT: " BORMR-KEY-1(4:16)
002854                  "SUBSIDY-ACNO: " BOIS-SUBSIDY-ACNO
002855                  "ACT-TYPE: " BORMR-ACT-TYPE
002856                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002857           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????" TO ERR-DESC
                 WRITE LONERR-REC
002858        END-IF
002859     END-IF
002860     IF BORP-LOAN-CLASS = 0 OR NOT (BORMR-ACT-TYPE  = "1201" AND
002861           BORMR-CAT = "0031" OR "0032" OR "0033" 
002862                   OR "0034" OR "0035" OR "0036")
002863        IF BOIS-SUBSIDY-ACNO NOT = ZEROS AND SPACES
002864           INITIALIZE FBRVDDL-DESC
002865           STRING "SUBSIDY-ACNO NOT ZERO"
002866                  "ACCOUNT: " BORMR-KEY-1(4:16)
002867                  "SUBSIDY-ACNO: " BOIS-SUBSIDY-ACNO
002868                  "ACT-TYPE: " BORMR-ACT-TYPE
002869                  "LOAN-CLASS: " BORP-LOAN-CLASS
002870                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002871           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????" TO ERR-DESC
                 WRITE LONERR-REC
002872        END-IF
002873     END-IF
002874     IF BORMR-ACT-TYPE = "1201" AND BORMR-CAT = "0031" OR "0032" 
002875               OR "0033" OR "0034" OR "0035" OR "0036"
002876        IF BOIS-FIRST-ADV-DATE <= BOIS-DATE-OF-GRADUATION AND 
002877            BOIS-DATE-OF-GRADUATION <= BOIS-MATURITY-DATE
002878            CONTINUE
002879        ELSE
002880           INITIALIZE FBRVDDL-DESC
002881           MOVE BOIS-FIRST-ADV-DATE TO TEMP-DATE
002882           STRING "GRADUATION DATE NOT CORRECT "
002883                  "ACCOUNT: " BORMR-KEY-1(4:16)
002884                  "DATE-OF-GRADUATION: " TEMP-DATE-OF-GRADUATION
002885                  "ACT-TYPE: " BORMR-ACT-TYPE
002886                  "FIRST-ADV-DATE: " TEMP-FIRST-ADV-DATE
002887                  "MATURITY-DATE: " TEMP-MATURITY-DATE
002888                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002889           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????" TO ERR-DESC
                 WRITE LONERR-REC
002890        END-IF
002891     END-IF
002892     IF BORP-LOAN-CLASS = 0 OR NOT (BORMR-ACT-TYPE = "1021" AND
002893          BORMR-CAT = "0031" OR "0032" OR "0033" OR 
002894               "0034" OR "0035" OR "0036")
002895        IF BOIS-DATE-OF-GRADUATION NOT = 0 
002896           INITIALIZE FBRVDDL-DESC
002897           STRING "GRADUATION DATE NOT CORRECT "
002898                  "ACCOUNT: " BORMR-KEY-1(4:16)
002899                  "DATE-OF-GRADUATION: " TEMP-DATE-OF-GRADUATION
002900                  "LOAN-CLASS: " BORP-LOAN-CLASS
002901                  "ACT-TYPE: " BORMR-ACT-TYPE
002902                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002903           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????" TO ERR-DESC
                 WRITE LONERR-REC
002904        END-IF
002905     END-IF
002906     IF BORMR-ACT-TYPE = "1201" AND 
002907         BORMR-CAT = "0031" OR "0032" OR "0033" 
002908                 OR "0034" OR "0035" OR "0036"
002909        IF 0 < BOIS-SUBSIDY-PERD AND
002910               BOIS-SUBSIDY-PERD <= BORMR-LOAN-TRM
002911           CONTINUE
002912        ELSE
002913           INITIALIZE FBRVDDL-DESC
002914           STRING "SUBSIDY-PERIOD NOT CORRECT "
002915                  "ACCOUNT: " BORMR-KEY-1(4:16)
002916                  "SUBSIDY-PERIOD: " BOIS-SUBSIDY-PERD
002917                  "LOAN-TRM: " TEMP-LOAN-TRM
002918                  "ACT-TYPE: " BORMR-ACT-TYPE
002919                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002920           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????" TO ERR-DESC
                 WRITE LONERR-REC
002921        END-IF
002922     END-IF
002923     IF BORP-LOAN-CLASS = 0 OR NOT (BORMR-ACT-TYPE = "1201" AND
002924          BORMR-CAT = "0031" OR "0032" OR "0033" 
002925                  OR "0034" OR "0035" OR "0036")
002926        IF BOIS-SUBSIDY-PERD NOT = 0 
002927           INITIALIZE FBRVDDL-DESC
002928           STRING "SUBSIDY-PERIOD NOT CORRECT "
002929                  "ACCOUNT: " BORMR-KEY-1(4:16)
002930                  "SUBSIDY-PERIOD: " BOIS-SUBSIDY-PERD
002931                  "LOAN-CLASS: " BORP-LOAN-CLASS
002932                  "ACT-TYPE: " BORMR-ACT-TYPE
002933                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002934           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????" TO ERR-DESC
                 WRITE LONERR-REC
002935        END-IF
002936     END-IF
002937*
002938     IF BORMR-UNPD-ARRS-INT-BAL >= 0
002939        CONTINUE
002940     ELSE
002941        INITIALIZE FBRVDDL-DESC
002942        STRING "UNPAID-ARRS-INT-BAL NOT CORRECT "
002943               "ACCOUNT: " BORMR-KEY-1(4:16)
002944               "UNPAID-ARRS-INT-BAL:" TEMP-UNPD-ARRS-INT-BAL
002945               DELIMITED BY SIZE INTO FBRVDDL-DESC
002946        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "A?????" TO ERR-DESC
              WRITE LONERR-REC
002947     END-IF
002948*
002949     IF BOIS-ARREARS-CTR = 0
002950        IF BORMR-UNPD-ARRS-INT-BAL = 0
002951           CONTINUE
002952        ELSE
002953           INITIALIZE FBRVDDL-DESC
002954           STRING "UNPAID-ARRS-INT-BAL NOT CORRECT "
002955                  "ACCOUNT: " BORMR-KEY-1(4:16)
002956                  "UNPAID-ARRS-INT-BAL:" TEMP-UNPD-ARRS-INT-BAL
002957                  "ARREARS-CTR: " TEMP-ARREARS-CTR
002958                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002959           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "A?????" TO ERR-DESC
                 WRITE LONERR-REC
002960        END-IF
002961     END-IF
002962*
002963     IF BOIS-SELF-LN-IND = 1
002964        IF BORMR-UNPD-ARRS-INT-BAL = 0
002965           CONTINUE
002966        ELSE
002967           INITIALIZE FBRVDDL-DESC
002968           STRING "UNPAID-ARRS-INT-BAL NOT CORRECT "
002969                  "ACCOUNT: " BORMR-KEY-1(4:16)
002970                  "UNPAID-ARRS-INT-BAL:" TEMP-UNPD-ARRS-INT-BAL
002971                  "SELF-SERVICE-LOAN: " BOIS-SELF-LN-IND
002972                  DELIMITED BY SIZE INTO FBRVDDL-DESC
002973           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "A?????" TO ERR-DESC
                 WRITE LONERR-REC
002974        END-IF
002975     END-IF
002976*
002977     COMPUTE WS-ARR-INT-INCR ROUNDED = BORMR-UNPD-PRIN-BAL *
002978                              BOIS-FINE1-INT-RATE / 36000
002979     COMPUTE D-VALUE-9 = WS-ARR-INT-INCR - BORMR-ARR-INT-INCR
002980     IF (D-VALUE-9 > 0.01 OR D-VALUE-9 < -0.01) AND
000000           (BOIS-STOP-ACCRUAL NOT = 'Y')
002981        MOVE D-VALUE-9 TO D-VALUE-Z
002982        MOVE WS-ARR-INT-INCR TO IN-CALC-AMT-Z
002983        INITIALIZE FBRVDDL-DESC
002984        STRING "ARR-INT-INCR NOT CORRECT "
002985               "ACCOUNT: " BORMR-KEY-1(4:16)
002986               "P AMT: " TEMP-UNPD-PRIN-BAL
002987               "INT RATE: " TEMP-FINE1-INT-RATE
002988               "ARR-INT-INCR:" TEMP-ARR-INT-INCR
002989               "IN CALCED ARR-INT-INCR: " IN-CALC-AMT-Z
002990               "D-VALUE: " D-VALUE-Z
002991               DELIMITED BY SIZE INTO FBRVDDL-DESC
002992        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????????" TO ERR-DESC
              WRITE LONERR-REC
002993     END-IF
002994*
002995     IF BOIS-ARREARS-CTR = 0
002996        IF BORMR-ARR-INT-INCR = 0
002997           CONTINUE
002998        ELSE
002999           INITIALIZE FBRVDDL-DESC
003000           STRING "ARR-INT-INCR NOT CORRECT "
003001                  "ACCOUNT: " BORMR-KEY-1(4:16)
003002                  "ARR-INT-INCR:" TEMP-ARR-INT-INCR
003003                  "ARREARS-CTR: " TEMP-ARREARS-CTR
003004                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003005           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????????" TO ERR-DESC
                 WRITE LONERR-REC
003006        END-IF
003007     END-IF
003008*
003009     IF BORMR-ARR-INT-ACCR >= 0
003010        CONTINUE
003011     ELSE
003012        INITIALIZE FBRVDDL-DESC
003013        STRING "ARR-INT-ACCR NOT CORRECT "
003014               "ACCOUNT: " BORMR-KEY-1(4:16)
003015               "ARR-INT-ACCR:" TEMP-ARR-INT-ACCR
003016               DELIMITED BY SIZE INTO FBRVDDL-DESC
003017        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????????" TO ERR-DESC
              WRITE LONERR-REC
003018     END-IF
003019*
003020     IF BOIS-ARREARS-CTR = 0
003021        IF BORMR-ARR-INT-ACCR = 0
003022           CONTINUE
003023        ELSE
003024           INITIALIZE FBRVDDL-DESC
003025           STRING "ARR-INT-ACCR NOT CORRECT "
003026                  "ACCOUNT: " BORMR-KEY-1(4:16)
003027                  "ARR-INT-ACCR:" TEMP-ARR-INT-ACCR
003028                  "LOAN-CLASS: " BORP-LOAN-CLASS
003029                  "ARREARS-CTR: " TEMP-ARREARS-CTR
003030                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003031           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????????" TO ERR-DESC
                 WRITE LONERR-REC
003032        END-IF
003033     END-IF
003034*
000000     IF BORMR-REPAY-SCHED = 'B' AND BOIS-STOP-ACCRUAL NOT = 'Y'
000000         AND BOIS-NEXT-DUE-DATE NOT = BOIS-MATURITY-DATE
000000        COMPUTE IN-DUE-AMT ROUNDED = BORMR-INT-ACCR +
000000                                     ((BOIS-NEXT-DUE-DATE - 
000000                                       TODAY-DATE) * 
000000                                       BORMR-INT-INCR)
000000        COMPUTE D-VALUE-9 = IN-DUE-AMT - BORMR-DUE-AMT
000000        IF D-VALUE-9 > 0.01 OR D-VALUE-9 < -0.01
000000           MOVE IN-DUE-AMT TO IN-CALC-AMT-Z
000000           MOVE D-VALUE-9 TO D-VALUE-Z
000000           INITIALIZE FBRVDDL-DESC
000000           STRING "DUE AMT NOT CORRECT AAA "
000000                  "ACCOUNT: " BORMR-KEY-1(4:16)
000000                  "INT ACCR: " TEMP-INT-ACCR
000000                  "NEXT DUE DATE: " TEMP-NEXT-DUE-DATE
000000                  "INCR : " TEMP-INT-INCR
000000                  "OUT DUE AMT: " TEMP-DUE-AMT
000000                  "OUT DUE AMT: " IN-CALC-AMT-Z
000000                  DELIMITED BY SIZE INTO FBRVDDL-DESC
000000           PERFORM B1021-WRITE-FBRVDDL
000000        END-IF
000000     END-IF 
003035     IF BOIS-INT-AFTER-ADVANCE = "R" OR "T" OR "S" OR "N"
003036        CONTINUE
003037     ELSE
003038        INITIALIZE FBRVDDL-DESC
003039        STRING "INT-AFTER-ADVANCE NOT CORRECT "
003040               "ACCOUNT: " BORMR-KEY-1(4:16)
003041               "INT-AFTER-ADVANCE:" BOIS-INT-AFTER-ADVANCE
003042               DELIMITED BY SIZE INTO FBRVDDL-DESC
003043        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????????????????" TO ERR-DESC
              WRITE LONERR-REC
003044     END-IF
003045*
003046     IF BORP-LOAN-CLASS = 0
003047        IF BOIS-INT-AFTER-ADVANCE = "N"
003048           CONTINUE
003049        ELSE
003050           INITIALIZE FBRVDDL-DESC
003051           STRING "INT-AFTER-ADVANCE NOT CORRECT "
003052                  "ACCOUNT: " BORMR-KEY-1(4:16)
003053                  "INT-AFTER-ADVANCE:" BOIS-INT-AFTER-ADVANCE
003054                  "LOAN-CLASS: " BORP-LOAN-CLASS
003055                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003056           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????????????????" TO ERR-DESC
                 WRITE LONERR-REC
003057        END-IF
003058     END-IF
003059*
003060     IF BORP-LOAN-CLASS = 1 AND ((BORMR-REPAY-SCHED = "B" AND 
003061         BORMR-REPAY-FREQ = 98) OR
003062             BORMR-REPAY-SCHED = "N")
003063        IF BOIS-INT-AFTER-ADVANCE = "N"
003064           CONTINUE
003065        ELSE
003066           INITIALIZE FBRVDDL-DESC
003067           STRING "INT-AFTER-ADVANCE NOT CORRECT "
003068                  "ACCOUNT: " BORMR-KEY-1(4:16)
003069                  "INT-AFTER-ADVANCE:" BOIS-INT-AFTER-ADVANCE
003070                  "LOAN-CLASS: " BORP-LOAN-CLASS
003071                  "REPAY-SCHED: " BORMR-REPAY-SCHED
003072                  "REPAY-FREQ: " BORMR-REPAY-FREQ
003073                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003074           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????????????????" TO ERR-DESC
                 WRITE LONERR-REC
003075        END-IF
003076     END-IF
003077*
003078*     IF BORP-LOAN-CLASS = 1 AND (BORMR-REPAY-SCHED NOT = "B" OR 
003079*        BORMR-REPAY-FREQ NOT = 98) AND
003080*            BORMR-REPAY-SCHED NOT = "N"
003081*        IF BOIS-INT-AFTER-ADVANCE = "R"
003082*           CONTINUE
003083*        ELSE
003084*           INITIALIZE FBRVDDL-DESC
003085*           STRING "INT-AFTER-ADVANCE NOT CORRECT "
003086*                  "ACCOUNT: " BORMR-KEY-1(4:16)
003087*                  "INT-AFTER-ADVANCE:" BOIS-INT-AFTER-ADVANCE
003088*                  "LOAN-CLASS: " BORP-LOAN-CLASS
003089*                  "REPAY-SCHED: " BORMR-REPAY-SCHED
003090*                  "REPAY-FREQ: " BORMR-REPAY-FREQ
003091*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003092*           PERFORM B1021-WRITE-FBRVDDL
003093*        END-IF
003094*     END-IF
003095*
003096     IF BOIS-AUTO-REPAY-IND = 1 OR 2 OR 3 OR 4
003097        CONTINUE
003098     ELSE
003099        INITIALIZE FBRVDDL-DESC
003100        STRING "AUTO-REPAY-IND NOT CORRECT "
003101               "ACCOUNT: " BORMR-KEY-1(4:16)
003102               "AUTO-REPAY-IND:" BOIS-AUTO-REPAY-IND
003103               DELIMITED BY SIZE INTO FBRVDDL-DESC
003104        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????????" TO ERR-DESC
              WRITE LONERR-REC
003105     END-IF
003106*
003107     IF BORP-LOAN-CLASS = 1
003108        IF BOIS-AUTO-REPAY-IND = 3
003109           CONTINUE
003110        ELSE
003111           INITIALIZE FBRVDDL-DESC
003112           STRING "AUTO-REPAY-IND NOT CORRECT "
003113                  "ACCOUNT: " BORMR-KEY-1(4:16)
003114                  "AUTO-REPAY-IND:" BOIS-AUTO-REPAY-IND
003115                  "LOAN-CLASS: " BORP-LOAN-CLASS
003116                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003117           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????????" TO ERR-DESC
                 WRITE LONERR-REC
003118        END-IF
003119     END-IF
003120*
003121     IF BOIS-SELF-LN-IND = 1
003122        IF BOIS-AUTO-REPAY-IND = 4
003123           CONTINUE
003124        ELSE
003125           INITIALIZE FBRVDDL-DESC
003126           STRING "AUTO-REPAY-IND NOT CORRECT "
003127                  "ACCOUNT: " BORMR-KEY-1(4:16)
003128                  "AUTO-REPAY-IND:" BOIS-AUTO-REPAY-IND
003129                  "SELF-SERVICE-LOAN: " BOIS-SELF-LN-IND
003130                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003131           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????????" TO ERR-DESC
                 WRITE LONERR-REC
003132        END-IF
003133     END-IF
003134*
003135     IF BOIS-AUTO-REPAY-TYPE = 1 OR 2 OR SPACES
003136        CONTINUE
003137     ELSE
003138        INITIALIZE FBRVDDL-DESC
003139        STRING "AUTO-REPAY-TYPE NOT CORRECT "
003140               "ACCOUNT: " BORMR-KEY-1(4:16)
003141               "AUTO-REPAY-TYPE:" BOIS-AUTO-REPAY-TYPE
003142               DELIMITED BY SIZE INTO FBRVDDL-DESC
003143        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????????" TO ERR-DESC
              WRITE LONERR-REC
003144     END-IF
003145*
003146     IF BOIS-SELF-LN-IND = 1
003147        IF BOIS-AUTO-REPAY-TYPE = SPACE
003148           CONTINUE
003149        ELSE
003150           INITIALIZE FBRVDDL-DESC
003151           STRING "AUTO-REPAY-TYPE NOT CORRECT "
003152                  "ACCOUNT: " BORMR-KEY-1(4:16)
003153                  "AUTO-REPAY-TYPE:" BOIS-AUTO-REPAY-TYPE
003154                  "SELF-SERVICE-LOAN: " BOIS-SELF-LN-IND
003155                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003156           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????????" TO ERR-DESC
                 WRITE LONERR-REC
003157        END-IF
003158     END-IF
003159*
003160     IF BOIS-SELF-LN-IND NOT = 1
003161        IF BOIS-AUTO-REPAY-TYPE = 2
003162           CONTINUE
003163        ELSE
003164           INITIALIZE FBRVDDL-DESC
003165           STRING "AUTO-REPAY-TYPE NOT CORRECT "
003166                  "ACCOUNT: " BORMR-KEY-1(4:16)
003167                  "AUTO-REPAY-TYPE:" BOIS-AUTO-REPAY-TYPE
003168                  "SELF-SERVICE-LOAN: " BOIS-SELF-LN-IND
003169                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003170           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????????" TO ERR-DESC
                 WRITE LONERR-REC
003171        END-IF
003172     END-IF
003173*
003174     IF BOIS-AUTO-OVERDUE-IND = "Y"
003175        CONTINUE
003176     ELSE
003177        INITIALIZE FBRVDDL-DESC
003178        STRING "AUTO-OVERDUE-IND NOT CORRECT "
003179               "ACCOUNT: " BORMR-KEY-1(4:16)
003180               "AUTO-OVERDUE-IND:" BOIS-AUTO-OVERDUE-IND
003181               DELIMITED BY SIZE INTO FBRVDDL-DESC
003182        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????????" TO ERR-DESC
              WRITE LONERR-REC
003183     END-IF
003184*
003185     IF BOIS-INCR-DEG = 0
003186        CONTINUE
003187     ELSE
003188        INITIALIZE FBRVDDL-DESC
003189        STRING "INCR-DEG NOT CORRECT "
003190               "ACCOUNT: " BORMR-KEY-1(4:16)
003191               "INCR-DEG:" TEMP-INCR-DEG
003192               DELIMITED BY SIZE INTO FBRVDDL-DESC
003193        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????????" TO ERR-DESC
              WRITE LONERR-REC
003194     END-IF
003195*
003196     IF BORP-LOAN-CLASS = 1 AND 
003197         BOIS-MANUAL-RISK-GRADE NOT = BOIS-AUTO-RISK-GRADE
003198        IF BOIS-FIRST-LVL-REA-CD = 08
003199           CONTINUE
003200        ELSE
003201           INITIALIZE FBRVDDL-DESC
003202           STRING "FIRST-LVL-REASON-CODE NOT CORRECT "
003203                  "ACCOUNT: " BORMR-KEY-1(4:16)
003204                  "FIRST-LVL-REASON-CODE:" 
003205                      BOIS-FIRST-LVL-REA-CD
003206                  "LOAN-CLASS: " BORP-LOAN-CLASS
003207                  "MENU-RISK-STS: " BOIS-MANUAL-RISK-GRADE
003208                  "SYS-RISK-STS: " BOIS-AUTO-RISK-GRADE
003209                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003210           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??¦ſ????????" TO ERR-DESC
                 WRITE LONERR-REC
003211        END-IF
003212     END-IF
003213*
003214     IF BORP-LOAN-CLASS = 0 OR 
003215            BOIS-MANUAL-RISK-GRADE = BOIS-AUTO-RISK-GRADE
003216        IF BOIS-FIRST-LVL-REA-CD = 00
003217           CONTINUE
003218        ELSE
003219           INITIALIZE FBRVDDL-DESC
003220           STRING "FIRST-LVL-REASON-CODE NOT CORRECT "
003221                  "ACCOUNT: " BORMR-KEY-1(4:16)
003222                  "FIRST-LVL-REASON-CODE: " 
003223                      BOIS-FIRST-LVL-REA-CD
003224                  "LOAN-CLASS: " BORP-LOAN-CLASS
003225                  "MENU-RISK-STS: " BOIS-MANUAL-RISK-GRADE
003226                  "SYS-RISK-STS: " BOIS-AUTO-RISK-GRADE
003227                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003228           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??¦ſ????????" TO ERR-DESC
                 WRITE LONERR-REC
003229        END-IF
003230     END-IF
003231*
003232     IF BOIS-SECOND-LVL-REA-CD = 0
003233        CONTINUE
003234     ELSE
003235        INITIALIZE FBRVDDL-DESC
003236        STRING "SECOND-LVL-REASON-CODE NOT CORRECT "
003237               "ACCOUNT: " BORMR-KEY-1(4:16)
003238               "SECOND-LVL-REASON-CODE:" 
003239                   BOIS-SECOND-LVL-REA-CD
003240               DELIMITED BY SIZE INTO FBRVDDL-DESC
003241        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????" TO ERR-DESC
              WRITE LONERR-REC
003242     END-IF
003243*
003244     IF BOIS-PROV-AMOUNT >= 0
003245        CONTINUE
003246     ELSE
003247        INITIALIZE FBRVDDL-DESC
003248        STRING "PROV-AMOUNT NOT CORRECT "
003249               "ACCOUNT: " BORMR-KEY-1(4:16)
003250               "PROV-AMOUNT:" TEMP-PROV-AMOUNT
003251               DELIMITED BY SIZE INTO FBRVDDL-DESC
003252        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "????????" TO ERR-DESC
              WRITE LONERR-REC
003253     END-IF
003254*
003255     IF BORMR-BAD-DEBT-IND = 54
003256        IF BOIS-PROV-AMOUNT = 0
003257           CONTINUE
003258        ELSE
003259           INITIALIZE FBRVDDL-DESC
003260           STRING "PROV-AMOUNT NOT CORRECT "
003261                  "ACCOUNT: " BORMR-KEY-1(4:16)
003262                  "PROV-AMOUNT:" TEMP-PROV-AMOUNT
003263                  "BAD-DEBT-IND: " BORMR-BAD-DEBT-IND
003264                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003265           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????" TO ERR-DESC
                 WRITE LONERR-REC
003266        END-IF
003267     END-IF
003268*
003269     IF 0 <= BOIS-PROV-CURT-DATE AND 
003270        BOIS-PROV-CURT-DATE <= TODAY-DATE
003271        CONTINUE
003272     ELSE
003273        INITIALIZE FBRVDDL-DESC
003274        STRING "PROV-CURT-DATE NOT CORRECT "
003275               "ACCOUNT: " BORMR-KEY-1(4:16)
003276               "PROV-CURT-DATE:" TEMP-PROV-CURT-DATE
003277               DELIMITED BY SIZE INTO FBRVDDL-DESC
003278        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????????" TO ERR-DESC
              WRITE LONERR-REC
003279     END-IF
003280*
003281     IF BOIS-PROV-IND = "M"
003282        CONTINUE
003283     ELSE
003284        INITIALIZE FBRVDDL-DESC
003285        STRING "PROV-IND NOT CORRECT "
003286               "ACCOUNT: " BORMR-KEY-1(4:16)
003287               "PROV-IND:" BOIS-PROV-IND
003288               DELIMITED BY SIZE INTO FBRVDDL-DESC
003289        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
003290     END-IF
003291*
003292     IF BOIS-PROV-BAD-DEBT-IND = 0 OR 1
003293        CONTINUE
003294     ELSE
003295        INITIALIZE FBRVDDL-DESC
003296        STRING "PROV-BAD-DEBT-IND NOT CORRECT "
003297               "ACCOUNT: " BORMR-KEY-1(4:16)
003298               "PROV-BAD-DEBT-IND:" BOIS-PROV-BAD-DEBT-IND
003299               DELIMITED BY SIZE INTO FBRVDDL-DESC
003300        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????????" TO ERR-DESC
              WRITE LONERR-REC
003301     END-IF
003302*
003303     IF BORMR-BAD-DEBT-IND = 00 OR 50
003304        IF BOIS-PROV-BAD-DEBT-IND = 0
003305           CONTINUE
003306        ELSE
003307           INITIALIZE FBRVDDL-DESC
003308           STRING "PROV-BAD-DEBT-IND NOT CORRECT "
003309                  "ACCOUNT: " BORMR-KEY-1(4:16)
003310                  "PROV-BAD-DEBT-IND:" BOIS-PROV-BAD-DEBT-IND
003311                  "BAD-DEBT-IND: " BORMR-BAD-DEBT-IND
003312                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003313           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????????" TO ERR-DESC
                 WRITE LONERR-REC
003314        END-IF
003315     END-IF
003316*
003317     IF BORMR-BAD-DEBT-IND = 02 OR 52 OR 54 
003318        IF BOIS-PROV-BAD-DEBT-IND = 1
003319           CONTINUE
003320        ELSE
003321           INITIALIZE FBRVDDL-DESC
003322           STRING "PROV-BAD-DEBT-IND NOT CORRECT "
003323                  "ACCOUNT: " BORMR-KEY-1(4:16)
003324                  "PROV-BAD-DEBT-IND:" BOIS-PROV-BAD-DEBT-IND
003325                  "BAD-DEBT-IND: " BORMR-BAD-DEBT-IND
003326                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003327           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????????" TO ERR-DESC
                 WRITE LONERR-REC
003328        END-IF
003329     END-IF
003330*
003331     IF BORMR-ACT-TYPE = "1022" OR "1058" OR "6190" OR "6200"
003332        IF BOIS-PROV-BAD-DEBT-IND = 0
003333           CONTINUE
003334        ELSE
003335           INITIALIZE FBRVDDL-DESC
003336           STRING "PROV-BAD-DEBT-IND NOT CORRECT "
003337                  "ACCOUNT: " BORMR-KEY-1(4:16)
003338                  "PROV-BAD-DEBT-IND:" BOIS-PROV-BAD-DEBT-IND
003339                  "ACT-TYPE: " BORMR-ACT-TYPE
003340                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003341           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????????" TO ERR-DESC
                 WRITE LONERR-REC
003342        END-IF
003343     END-IF
003344*
003345     IF BOIS-PROM-PREV-AMT >= 0
003346        CONTINUE
003347     ELSE
003348        INITIALIZE FBRVDDL-DESC
003349        STRING "PROM-PREV-AMT NOT CORRECT "
003350               "ACCOUNT: " BORMR-KEY-1(4:16)
003351               "PROM-PREV-AMT:" TEMP-PROM-PREV-AMT
003352               DELIMITED BY SIZE INTO FBRVDDL-DESC
003353        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "????????" TO ERR-DESC
              WRITE LONERR-REC
003354     END-IF
003355*
003356     IF BOIS-CONTRACT-IND = 0 OR 1
003357        CONTINUE
003358     ELSE
003359        INITIALIZE FBRVDDL-DESC
003360        STRING "CONTRACT-IND NOT CORRECT "
003361               "ACCOUNT: " BORMR-KEY-1(4:16)
003362               "CONTRACT-IND:" BOIS-CONTRACT-IND
003363               DELIMITED BY SIZE INTO FBRVDDL-DESC
003364        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
003365     END-IF
003366*
003367*     IF BORP-LOAN-CLASS = 0
003368*        IF BOIS-CONTRACT-IND = 1 AND 
003369*           BOIS-CONTRACT-NO NOT = SPACE AND ZEROS
003370*           CONTINUE
003371*        ELSE
003372*           INITIALIZE FBRVDDL-DESC
003373*           STRING "CONTRACT-NO NOT CORRECT "
003374*                  "ACCOUNT: " BORMR-KEY-1(4:16)
003375*                  "CONTRACT-NO:" BOIS-CONTRACT-NO
003376*                  "CONTRACT-IND: " BOIS-CONTRACT-IND
003377*                  "LOAN-CLASS: " BORP-LOAN-CLASS
003378*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003379*           PERFORM B1021-WRITE-FBRVDDL
003380*        END-IF
003381*     END-IF
003382*
003383*     IF BORP-LOAN-CLASS = 1 AND BOIS-CONTRACT-IND = 1
003384*        IF BOIS-CONTRACT-NO NOT = SPACE AND ZEROS
003385*           CONTINUE
003386*        ELSE
003387*           INITIALIZE FBRVDDL-DESC
003388*           STRING "CONTRACT-NO NOT CORRECT "
003389*                  "ACCOUNT: " BORMR-KEY-1(4:16)
003390*                  "CONTRACT-NO:" BOIS-CONTRACT-NO
003391*                  "CONTRACT-IND: " BOIS-CONTRACT-IND
003392*                  "LOAN-CLASS: " BORP-LOAN-CLASS
003393*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003394*           PERFORM B1021-WRITE-FBRVDDL
003395*        END-IF
003396*     END-IF
003397*
003398*     IF BORP-LOAN-CLASS = 1 AND BOIS-CONTRACT-IND = 0
003399*        IF BOIS-CONTRACT-NO = 0
003400*           CONTINUE
003401*        ELSE
003402*           INITIALIZE FBRVDDL-DESC
003403*           STRING "CONTRACT-NO NOT CORRECT "
003404*                  "ACCOUNT: " BORMR-KEY-1(4:16)
003405*                  "CONTRACT-NO:" BOIS-CONTRACT-NO
003406*                  "CONTRACT-IND: " BOIS-CONTRACT-IND
003407*                  "LOAN-CLASS: " BORP-LOAN-CLASS
003408*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003409*           PERFORM B1021-WRITE-FBRVDDL
003410*        END-IF
003411*     END-IF
003412*
003413     IF BORP-LOAN-CLASS = 0
003414        IF BOIS-PAPER-CONTRACT-NO NOT = SPACE AND ZEROS
003415           CONTINUE
003416        ELSE
003417           INITIALIZE FBRVDDL-DESC
003418           STRING "PAPER-CONTRACT-NO NOT CORRECT "
003419                  "ACCOUNT: " BORMR-KEY-1(4:16)
003420                  "PAPER-CONTRACT-NO:" BOIS-PAPER-CONTRACT-NO
003421                  "LOAN-CLASS: " BORP-LOAN-CLASS
003422                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003423           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????" TO ERR-DESC
                 WRITE LONERR-REC
003424        END-IF
003425     END-IF
003426*
003427     IF BOIS-SUM-REPAY-AMT >= 0
003428        CONTINUE
003429     ELSE
003430        INITIALIZE FBRVDDL-DESC
003431        STRING "SUM-REPAY-AMT NOT CORRECT "
003432               "ACCOUNT: " BORMR-KEY-1(4:16)
003433               "SUM-REPAY-AMT:" TEMP-SUM-REPAY-AMT
003434               DELIMITED BY SIZE INTO FBRVDDL-DESC
003435        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "????????" TO ERR-DESC
              WRITE LONERR-REC
003436     END-IF
003437*
003438*     IF 0 <= BOIS-SUM-REPAY-INT-AMT AND 
003439*        BOIS-SUM-REPAY-INT-AMT <= BOIS-SUM-REPAY-AMT
003440*        CONTINUE
003441*     ELSE
003442*        INITIALIZE FBRVDDL-DESC
003443*        STRING "SUM-REPAY-INT-AMT NOT CORRECT "
003444*               "ACCOUNT: " BORMR-KEY-1(4:16)
003445*               "SUM-REPAY-INT-AMT:" TEMP-SUM-REPAY-INT-AMT
003446*               "SUM-REPAY-AMT: " TEMP-SUM-REPAY-AMT
003447*               DELIMITED BY SIZE INTO FBRVDDL-DESC
003448*        PERFORM B1021-WRITE-FBRVDDL
003449*     END-IF
003450*
003451*
003452*     COMPUTE TEMP-SUN-REPAY-CNT = BOIS-SUM-REPAY-PRIN-CNT +
003453*                                  BOIS-SUM-REPAY-INT-CNT
003454*     IF 0 <= BOIS-SUM-REPAY-CNT AND 
003455*        BOIS-SUM-REPAY-CNT <= TEMP-SUN-REPAY-CNT
003456*        CONTINUE
003457*     ELSE
003458*        INITIALIZE FBRVDDL-DESC
003459*        STRING "SUM-REPAY-CNT NOT CORRECT "
003460*               "ACCOUNT: " BORMR-KEY-1(4:16)
003461*               "SUM-REPAY-CNT:" BOIS-SUM-REPAY-CNT
003462*               "SUM-REPAY-PRIN-CNT: " BOIS-SUM-REPAY-PRIN-CNT 
003463*               "SUM-REPAY-INT-CNT: " BOIS-SUM-REPAY-INT-CNT
003464*               DELIMITED BY SIZE INTO FBRVDDL-DESC
003465*        PERFORM B1021-WRITE-FBRVDDL
      *        MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
      *        MOVE "???????????" TO ERR-DESC
      *        WRITE LONERR-REC
003466*     END-IF
003467*
003468     IF BOIS-SUM-REPAY-PRIN-CNT >= 0
003469        CONTINUE
003470     ELSE
003471        INITIALIZE FBRVDDL-DESC
003472        STRING "REPAY-PRIN-CNT NOT CORRECT "
003473               "ACCOUNT: " BORMR-KEY-1(4:16)
003474               "REPAY-PRIN-CNT:" BOIS-SUM-REPAY-PRIN-CNT
003475               DELIMITED BY SIZE INTO FBRVDDL-DESC
003476        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????????" TO ERR-DESC
              WRITE LONERR-REC
003477     END-IF
003478*
003479     IF BOIS-SUM-REPAY-INT-CNT >= 0
003480        CONTINUE
003481     ELSE
003482        INITIALIZE FBRVDDL-DESC
003483        STRING "SUM-REPAY-INT-CNT NOT CORRECT "
003484               "ACCOUNT: " BORMR-KEY-1(4:16)
003485               "SUM-REPAY-INT-CNT:" BOIS-SUM-REPAY-INT-CNT
003486               DELIMITED BY SIZE INTO FBRVDDL-DESC
003487        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????????" TO ERR-DESC
              WRITE LONERR-REC
003488     END-IF
003489*
003490     IF BOIS-ACT-FIRST-RPY-DAY >= 0
003491        CONTINUE
003492     ELSE
003493        INITIALIZE FBRVDDL-DESC
003494        STRING "FIRST-REPAY-DAY NOT CORRECT "
003495               "ACCOUNT: " BORMR-KEY-1(4:16)
003496               "FIRST-REPAY-DAY:" TEMP-ACT-FIRST-RPY-DAY
003497               DELIMITED BY SIZE INTO FBRVDDL-DESC
003498        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??¦ɿ???????" TO ERR-DESC
              WRITE LONERR-REC
003499     END-IF
003500*
003501     IF BORP-LOAN-CLASS = 0
003502        IF BOIS-ACT-FIRST-RPY-DAY > 0
003503           CONTINUE
003504        ELSE
003505           INITIALIZE FBRVDDL-DESC
003506           STRING "ACT-FIRST-REPAY-DAY NOT CORRECT "
003507                  "ACCOUNT: " BORMR-KEY-1(4:16)
003508                  "ACT-FIRST-REPAY-DAY:" TEMP-ACT-FIRST-RPY-DAY
003509                  "LOAN-CLASS: " BORP-LOAN-CLASS
003510                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003511           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??¦ɿ???????" TO ERR-DESC
                 WRITE LONERR-REC
003512        END-IF
003513     END-IF
003514*
003515     IF TEMP-SUM-ARREARS-CNT >= 0
003516        CONTINUE
003517     ELSE
003518        INITIALIZE FBRVDDL-DESC
003519        STRING "SUM-ARREARS-CNT NOT CORRECT "
003520               "ACCOUNT: " BORMR-KEY-1(4:16)
003521               "SUM-ARREARS-CNT:" TEMP-SUM-ARREARS-CNT
003522               DELIMITED BY SIZE INTO FBRVDDL-DESC
003523        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????????" TO ERR-DESC
              WRITE LONERR-REC
003524     END-IF
003525*
003526     IF BOIS-ARREARS-CTR > 0
003527        IF TEMP-SUM-ARREARS-CNT > 0 AND 
003528           TEMP-SUM-ARREARS-CNT >= BOIS-ARREARS-CTR
003529           CONTINUE
003530        ELSE
003531           INITIALIZE FBRVDDL-DESC
003532           STRING "SUM-ARREARS-CNT NOT CORRECT "
003533                  "ACCOUNT: " BORMR-KEY-1(4:16)
003534                  "SUM-ARREARS-CNT:" TEMP-SUM-ARREARS-CNT
003535                  "ARREARS-CTR: " TEMP-ARREARS-CTR
003536                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003537           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????????" TO ERR-DESC
                 WRITE LONERR-REC
003538        END-IF
003539     END-IF
003540*
003541     IF BOIS-SUM-ARREARS-AMT >= 0
003542        CONTINUE
003543     ELSE
003544        INITIALIZE FBRVDDL-DESC
003545        STRING "SUM-ARREARS-AMT NOT CORRECT "
003546               "ACCOUNT: " BORMR-KEY-1(4:16)
003547               "SUM-ARREARS-AMT:" TEMP-SUM-ARREARS-AMT
003548               DELIMITED BY SIZE INTO FBRVDDL-DESC
003549        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
003550     END-IF
003551*
003552     IF BOIS-FINE1-TMP-INT-ACCR = 0
003553        CONTINUE
003554     ELSE
003555        INITIALIZE FBRVDDL-DESC
003556        STRING "FINE1-TEMP-INT-ACCR NOT CORRECT "
003557               "ACCOUNT: " BORMR-KEY-1(4:16)
003558               "FINE1-TEMP-INT-ACCR:" TEMP-FINE1-TEMP-INT-ACCR
003559               DELIMITED BY SIZE INTO FBRVDDL-DESC
003560        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
003561     END-IF
003562*
003563     IF BOIS-FINE2-TMP-INT-ACCR = 0
003564        CONTINUE
003565     ELSE
003566        INITIALIZE FBRVDDL-DESC
003567        STRING "FINE2-TEMP-INT-ACCR NOT CORRECT "
003568               "ACCOUNT: " BORMR-KEY-1(4:16)
003569               "FINE2-TEMP-INT-ACCR:" TEMP-FINE2-TMP-INT-ACCR
003570               DELIMITED BY SIZE INTO FBRVDDL-DESC
003571        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
003572     END-IF
003573*
003574     IF BOIS-FINE4-INT-INCR >= 0
003575        CONTINUE
003576     ELSE
003577        INITIALIZE FBRVDDL-DESC
003578        STRING "FINE4-INT-INCR NOT CORRECT "
003579               "ACCOUNT: " BORMR-KEY-1(4:16)
003580               "FINE4-INT-INCR:" TEMP-FINE4-INT-INCR
003581               DELIMITED BY SIZE INTO FBRVDDL-DESC
003582        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "????????????????" TO ERR-DESC
              WRITE LONERR-REC
003583     END-IF
003584*
003585     IF BORP-LOAN-CLASS = 1
003586        IF BOIS-FINE4-INT-INCR = 0
003587           CONTINUE
003588        ELSE
003589           INITIALIZE FBRVDDL-DESC
003590           STRING "FINE4-INT-INCR NOT CORRECT "
003591                  "ACCOUNT: " BORMR-KEY-1(4:16)
003592                  "FINE4-INT-INCR:" TEMP-FINE4-INT-INCR
003593                  "LOAN-CLASS: " BORP-LOAN-CLASS
003594                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003595           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????????" TO ERR-DESC
                 WRITE LONERR-REC
003596        END-IF
003597     END-IF
003598*
003599     IF BOIS-FINE4-INT-ACCR >= 0
003600        CONTINUE
003601     ELSE
003602        INITIALIZE FBRVDDL-DESC
003603        STRING "FINE4-INT-ACCR NOT CORRECT "
003604               "ACCOUNT: " BORMR-KEY-1(4:16)
003605               "FINE4-INT-ACCR:" TEMP-FINE4-INT-ACCR
003606               DELIMITED BY SIZE INTO FBRVDDL-DESC
003607        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
003608     END-IF
003609*
003610     IF BORP-LOAN-CLASS = 1
003611        IF BOIS-FINE4-INT-ACCR = 0
003612           CONTINUE
003613        ELSE
003614           INITIALIZE FBRVDDL-DESC
003615           STRING "FINE4-INT-ACCR NOT CORRECT "
003616                  "ACCOUNT: " BORMR-KEY-1(4:16)
003617                  "FINE4-INT-ACCR:" TEMP-FINE4-INT-ACCR
003618                  "LOAN-CLASS: " BORP-LOAN-CLASS
003619                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003620           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????????" TO ERR-DESC
                 WRITE LONERR-REC
003621        END-IF
003622     END-IF
003623*
003624     IF BOIS-FINE4-TMP-INT-ACCR = 0
003625        CONTINUE
003626     ELSE
003627        INITIALIZE FBRVDDL-DESC
003628        STRING "FINE4-TEMP-INT-ACCR NOT CORRECT "
003629               "ACCOUNT: " BORMR-KEY-1(4:16)
003630               "FINE4-TEMP-INT-ACCR:" TEMP-FINE4-TMP-INT-ACCR
003631               DELIMITED BY SIZE INTO FBRVDDL-DESC
003632        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????????" TO ERR-DESC
              WRITE LONERR-REC
003633     END-IF
003634*
003635     IF BOIS-FI1-OPT2-INT-ICR = 0
003636        CONTINUE
003637     ELSE
003638        INITIALIZE FBRVDDL-DESC
003639        STRING "INCR-IN-HOL NOT CORRECT "
003640               "ACCOUNT: " BORMR-KEY-1(4:16)
003641               "INCR-IN-HOL:" TEMP-FI1-OPT2-INT-ICR
003642               DELIMITED BY SIZE INTO FBRVDDL-DESC
003643        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??????????" TO ERR-DESC
              WRITE LONERR-REC
003644     END-IF
003645*
003646     IF BOIS-FI1-OPT2-INT-ACR = 0
003647        CONTINUE
003648     ELSE
003649        INITIALIZE FBRVDDL-DESC
003650        STRING "ACCR-IN-HOL NOT CORRECT "
003651               "ACCOUNT: " BORMR-KEY-1(4:16)
003652               "ACCR-IN-HOL:" TEMP-FI1-OPT2-INT-ACR
003653               DELIMITED BY SIZE INTO FBRVDDL-DESC
003654        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????????" TO ERR-DESC
              WRITE LONERR-REC
003655     END-IF
003656*
003657     IF BOIS-FI2-OPT2-INT-ICR = 0
003658        CONTINUE
003659     ELSE
003660        INITIALIZE FBRVDDL-DESC
003661        STRING "FINE2-OPT2-INT-INCR NOT CORRECT "
003662               "ACCOUNT: " BORMR-KEY-1(4:16)
003663               "FINE2-OPT2-INT-INCR:" TEMP-FI2-OPT2-INT-ICR
003664               DELIMITED BY SIZE INTO FBRVDDL-DESC
003665        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??vfv ????" TO ERR-DESC
              WRITE LONERR-REC
003666     END-IF
003667*
003668     IF BOIS-FI2-OPT2-INT-ACR = 0
003669        CONTINUE
003670     ELSE
003671        INITIALIZE FBRVDDL-DESC
003672        STRING "P-DUE-AMT-COMM NOT CORRECT "
003673               "ACCOUNT: " BORMR-KEY-1(4:16)
003674               "P-DUE-AMT-COMM:" TEMP-FI2-OPT2-INT-ACR
003675               DELIMITED BY SIZE INTO FBRVDDL-DESC
003676        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "????????" TO ERR-DESC
              WRITE LONERR-REC
003677     END-IF
003678*
003679     IF BOIS-FI4-OPT2-INT-ICR = 0
003680        CONTINUE
003681     ELSE
003682        INITIALIZE FBRVDDL-DESC
003683        STRING "FINE4-OPT2-INT-INCR NOT CORRECT "
003684               "ACCOUNT: " BORMR-KEY-1(4:16)
003685               "FINE4-OPT2-INT-INCR:" TEMP-FI4-OPT2-INT-ICR
003686               DELIMITED BY SIZE INTO FBRVDDL-DESC
003687        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "????????" TO ERR-DESC
              WRITE LONERR-REC
003688     END-IF
003689*
003690     IF BOIS-FI4-OPT2-INT-ACR = 0
003691        CONTINUE
003692     ELSE
003693        INITIALIZE FBRVDDL-DESC
003694        STRING "I-DUE-AMT-COMM NOT CORRECT "
003695               "ACCOUNT: " BORMR-KEY-1(4:16)
003696               "I-DUE-AMT-COMM:" TEMP-FI4-OPT2-INT-ACR
003697               DELIMITED BY SIZE INTO FBRVDDL-DESC
003698        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "????????" TO ERR-DESC
              WRITE LONERR-REC
003699     END-IF
003700*
003701     IF BOIS-STOP-ACCRUAL = "Y" OR 
003702        BOIS-STOP-ACCRUAL = "N"
003703        CONTINUE
003704     ELSE
003705        INITIALIZE FBRVDDL-DESC
003706        STRING "STOP-ACCRUAL NOT CORRECT "
003707               "ACCOUNT: " BORMR-KEY-1(4:16)
003708               "STOP-ACCRUAL:" BOIS-STOP-ACCRUAL
003709               DELIMITED BY SIZE INTO FBRVDDL-DESC
003710        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????e???» ??" TO ERR-DESC
              WRITE LONERR-REC
003711     END-IF
003712*
003713*     IF BORMR-BAD-DEBT-IND = 00 OR 50
003714*        IF BOIS-STOP-ACCRUAL = "N"
003715*           CONTINUE
003716*        ELSE
003717*           INITIALIZE FBRVDDL-DESC
003718*           STRING "STOP-ACCRUAL NOT CORRECT "
003719*                  "ACCOUNT: " BORMR-KEY-1(4:16)
003720*                  "STOP-ACCRUAL:" BOIS-STOP-ACCRUAL
003721*                  "BAD-DEBT-IND: " BORMR-BAD-DEBT-IND
003722*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003723*           PERFORM B1021-WRITE-FBRVDDL
      *           MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
      *           MOVE "?????e???» ??" TO ERR-DESC
      *           WRITE LONERR-REC
003724*        END-IF
003725*     END-IF
003726*
003727     IF BORMR-BAD-DEBT-IND = 54
003728        IF BOIS-STOP-ACCRUAL = "Y"
003729           CONTINUE
003730        ELSE
003731           INITIALIZE FBRVDDL-DESC
003732           STRING "STOP-ACCRUAL NOT CORRECT "
003733                  "ACCOUNT: " BORMR-KEY-1(4:16)
003734                  "STOP-ACCRUAL:" BOIS-STOP-ACCRUAL
003735                  "BAD-DEBT-IND: " BORMR-BAD-DEBT-IND
003736                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003737           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????e???» ??" TO ERR-DESC
                 WRITE LONERR-REC
003738        END-IF
003739     END-IF
003740*
003741     IF (BOIS-NEGO-RATE-IND = 0 AND BOIS-EFR-CHNG-IND NOT = SPACE) 
003742         OR TEMP-STAT > 05
003743        IF 0 < BOIS-FRST-INT-VAL-DT AND 
003744           BOIS-FRST-INT-VAL-DT <= BOIS-FIRST-ADV-DATE
003745           CONTINUE
003746        ELSE
003747           INITIALIZE FBRVDDL-DESC
003748           MOVE BOIS-FIRST-ADV-DATE TO TEMP-DATE
003749           STRING "1ST-INT-VAL-DT NOT CORRECT "
003750                  "ACCOUNT: " BORMR-KEY-1(4:16)
003751                  "1ST-INT-VAL-DT:" TEMP-FRST-INT-VAL-DT
003752                  "NEGO-RATE-IND: " BOIS-NEGO-RATE-IND
003753                  "EFR-CHNG-IND: " BOIS-EFR-CHNG-IND
003754                  "FIRST-ADV-DATE: " TEMP-DATE
003755                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003756           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????????" TO ERR-DESC
                 WRITE LONERR-REC
003757        END-IF
003758     END-IF
003759*
003760     IF BOIS-RATE-OPT-TO-EXE = "Y" OR "N"
003761        CONTINUE
003762     ELSE
003763        INITIALIZE FBRVDDL-DESC
003764        STRING "RATE-OPT-TO-EXE NOT CORRECT "
003765               "ACCOUNT: " BORMR-KEY-1(4:16)
003766               "RATE-OPT-TO-EXE:" BOIS-RATE-OPT-TO-EXE
003767               DELIMITED BY SIZE INTO FBRVDDL-DESC
003768        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????§ѿ??" TO ERR-DESC
              WRITE LONERR-REC
003769     END-IF
003770*
003771     IF BOIS-NEGO-RATE-IND NOT = 2 OR
003772               BORP-RATE-OPT-APPLIC NOT = "Y"
003773        IF BOIS-RATE-OPT-TO-EXE = "N"
003774           CONTINUE
003775        ELSE
003776           INITIALIZE FBRVDDL-DESC
003777           STRING "RATE-OPT-TO-EXE NOT CORRECT "
003778                  "ACCOUNT: " BORMR-KEY-1(4:16)
003779                  "RATE-OPT-TO-EXE:" BOIS-RATE-OPT-TO-EXE
003780                  "RATE-OPT-APPLIC: " BORP-RATE-OPT-APPLIC
003781                  "NEGO-RATE-IND: " BOIS-NEGO-RATE-IND
003782                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003783           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????§ѿ??" TO ERR-DESC
                 WRITE LONERR-REC
003784        END-IF
003785     END-IF
003786*
003787     IF BOIS-NEGO-RATE-IND = 0 AND BOIS-EFR-CHNG-IND NOT = SPACE
003788        IF BOIS-FLOAT-CYCLE-MARK = "M" OR "Y"
003789           CONTINUE
003790        ELSE
003791           INITIALIZE FBRVDDL-DESC
003792           STRING "FLOAT-CYCLE-MARK NOT CORRECT "
003793                  "ACCOUNT: " BORMR-KEY-1(4:16)
003794                  "FLOAT-CYCLE-MARK:" BOIS-FLOAT-CYCLE-MARK
003795                  "NEGO-RATE-IND: " BOIS-NEGO-RATE-IND
003796                  "EFR-CHNG-IND: " BOIS-EFR-CHNG-IND
003797                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003798           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????????" TO ERR-DESC
                 WRITE LONERR-REC
003799        END-IF
003800     END-IF
003801*
003802     IF BOIS-NEGO-RATE-IND NOT = 0 OR BOIS-EFR-CHNG-IND = SPACE
003803        IF BOIS-FLOAT-CYCLE-MARK = SPACE
003804           CONTINUE
003805        ELSE
003806           INITIALIZE FBRVDDL-DESC
003807           STRING "FLOAT-CYCLE-MARK NOT CORRECT "
003808                  "ACCOUNT: " BORMR-KEY-1(4:16)
003809                  "FLOAT-CYCLE-MARK:" BOIS-FLOAT-CYCLE-MARK
003810                  "NEGO-RATE-IND: " BOIS-NEGO-RATE-IND
003811                  "EFR-CHNG-IND: " BOIS-EFR-CHNG-IND
003812                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003813           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????????" TO ERR-DESC
                 WRITE LONERR-REC
003814        END-IF
003815     END-IF
003816*
003817     IF BOIS-NEGO-RATE-IND = 0 AND BOIS-EFR-CHNG-IND NOT = SPACE
003818        IF BOIS-FLOAT-CYCLE > 0
003819           CONTINUE
003820        ELSE
003821           INITIALIZE FBRVDDL-DESC
003822           STRING "FLOAT-CYCLE-MARK NOT CORRECT "
003823                  "ACCOUNT: " BORMR-KEY-1(4:16)
003824                  "FLOAT-CYCLE-MARK:" BOIS-FLOAT-CYCLE-MARK
003825                  "NEGO-RATE-IND: " BOIS-NEGO-RATE-IND
003826                  "EFR-CHNG-IND: " BOIS-EFR-CHNG-IND
003827                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003828           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????????" TO ERR-DESC
                 WRITE LONERR-REC
003829        END-IF
003830     END-IF
003831*
003832     IF BOIS-NEGO-RATE-IND NOT = 0 OR BOIS-EFR-CHNG-IND = SPACE
003833        IF BOIS-FLOAT-CYCLE-MARK = 0
003834           CONTINUE
003835        ELSE
003836           INITIALIZE FBRVDDL-DESC
003837           STRING "FLOAT-CYCLE-MARK NOT CORRECT "
003838                  "ACCOUNT: " BORMR-KEY-1(4:16)
003839                  "FLOAT-CYCLE-MARK:" BOIS-FLOAT-CYCLE-MARK
003840                  "NEGO-RATE-IND: " BOIS-NEGO-RATE-IND
003841                  "EFR-CHNG-IND: " BOIS-EFR-CHNG-IND
003842                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003843           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????????" TO ERR-DESC
                 WRITE LONERR-REC
003844        END-IF
003845     END-IF
003846*
003847     IF BOIS-FINE1-INCR-OPT = 0 OR SPACE
003848        IF BOIS-FINE1-FIX-RATE >= 0 AND
003849           BOIS-FINE1-FIX-RATE = BOIS-FINE1-INT-RATE
003850           CONTINUE
003851        ELSE
003852           INITIALIZE FBRVDDL-DESC
003853           STRING "FINE1-INT-RATE NOT CORRECT "
003854                  "ACCOUNT: " BORMR-KEY-1(4:16)
003855                  "FINE1-INT-RATE:" TEMP-FINE1-INT-RATE
003856                  "FINE1-RT-INCR-OPT: " BOIS-FINE1-INCR-OPT
003857                  "FINE1-FIX-RATE: " TEMP-FINE1-FIX-RATE
003858                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003859           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????????" TO ERR-DESC
                 WRITE LONERR-REC
003860        END-IF
003861     END-IF
003862*
003863     IF BOIS-FINE1-INCR-OPT = 1 OR 2
003864        IF BOIS-FINE1-FIX-RATE = 0
003865           CONTINUE
003866        ELSE
003867           INITIALIZE FBRVDDL-DESC
003868           STRING "FINE1-FIX-RATE NOT CORRECT "
003869                  "ACCOUNT: " BORMR-KEY-1(4:16)
003870                  "FINE1-FIX-RATE:" TEMP-FINE1-FIX-RATE
003871                  "FINE1-RT-INCR-OPT: " BOIS-FINE1-INCR-OPT
003872                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003873           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????????" TO ERR-DESC
                 WRITE LONERR-REC
003874        END-IF
003875     END-IF
003876*
003877     IF BOIS-FINE2-INCR-OPT = 0 OR SPACE
003878        IF BOIS-FINE2-FIX-RATE >= 0 AND 
003879           BOIS-FINE2-FIX-RATE = BOIS-FINE2-INT-RATE
003880           CONTINUE
003881        ELSE
003882           INITIALIZE FBRVDDL-DESC
003883           STRING "FINE2-FIX-RATE NOT CORRECT "
003884                  "ACCOUNT: " BORMR-KEY-1(4:16)
003885                  "FINE2-FIX-RATE:" TEMP-FINE2-FIX-RATE
003886                  "FINE2-RT-INCR-OPT: " BOIS-FINE2-INCR-OPT
003887                  "FINE2-INT-RATE: " TEMP-FINE2-INT-RATE
003888                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003889           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????????" TO ERR-DESC
                 WRITE LONERR-REC
003890        END-IF
003891     END-IF
003892*    
003893     IF BOIS-FINE2-INCR-OPT = 1 OR 2
003894        IF BOIS-FINE2-FIX-RATE = 0
003895           CONTINUE
003896        ELSE
003897           INITIALIZE FBRVDDL-DESC
003898           STRING "FINE2-FIX-RATE NOT CORRECT "
003899                  "ACCOUNT: " BORMR-KEY-1(4:16)
003900                  "FINE2-FIX-RATE:" TEMP-FINE2-FIX-RATE
003901                  "FINE2-RT-INCR-OPT: " BOIS-FINE2-INCR-OPT
003902                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003903           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????????" TO ERR-DESC
                 WRITE LONERR-REC
003904        END-IF
003905     END-IF
003906*    
003907     IF BOIS-SELF-LN-IND = 1
003908        IF BOIS-FINE2-FIX-RATE = 0
003909           CONTINUE
003910        ELSE
003911           INITIALIZE FBRVDDL-DESC
003912           STRING "FINE2-FIX-RATE NOT CORRECT "
003913                  "ACCOUNT: " BORMR-KEY-1(4:16)
003914                  "FINE2-FIX-RATE:" TEMP-FINE2-FIX-RATE
003915                  "SELF-SERVICE-LOAN: " BOIS-SELF-LN-IND
003916                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003917           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????????" TO ERR-DESC
                 WRITE LONERR-REC
003918        END-IF
003919     END-IF
003920*    
003921     IF BOIS-FINE4-RT-INCR-OPT = 0 OR SPACE
003922        IF BOIS-FINE4-FIX-RATE >= 0 AND 
003923           BOIS-FINE4-FIX-RATE = BOIS-FINE4-INT-RATE 
003924           CONTINUE
003925        ELSE
003926           INITIALIZE FBRVDDL-DESC
003927           STRING "FINE4-FIX-RATE NOT CORRECT "
003928                  "ACCOUNT: " BORMR-KEY-1(4:16)
003929                  "FINE4-FIX-RATE:" TEMP-FINE4-FIX-RATE
003930                  "FINE4-RT-INCR-OPT: " BOIS-FINE4-RT-INCR-OPT
003931                  "FINE4-INT-RATE: " TEMP-FINE4-INT-RATE
003932                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003933           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????" TO ERR-DESC
                 WRITE LONERR-REC
003934        END-IF
003935     END-IF
003936*    
003937     IF BOIS-FINE4-RT-INCR-OPT = 1 OR 2
003938        IF BOIS-FINE4-FIX-RATE = 0
003939           CONTINUE
003940        ELSE
003941           INITIALIZE FBRVDDL-DESC
003942           STRING "FINE4-FIX-RATE NOT CORRECT "
003943                  "ACCOUNT: " BORMR-KEY-1(4:16)
003944                  "FINE4-FIX-RATE:" TEMP-FINE4-FIX-RATE
003945                  "FINE4-RT-INCR-OPT: " BOIS-FINE4-RT-INCR-OPT
003946                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003947           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????" TO ERR-DESC
                 WRITE LONERR-REC
003948        END-IF
003949     END-IF
003950*    
003951     IF BORP-LOAN-CLASS = 1
003952        IF BOIS-FINE4-FIX-RATE = 0
003953           CONTINUE
003954        ELSE
003955           INITIALIZE FBRVDDL-DESC
003956           STRING "FINE4-FIX-RATE NOT CORRECT "
003957                  "ACCOUNT: " BORMR-KEY-1(4:16)
003958                  "FINE4-FIX-RATE:" TEMP-FINE4-FIX-RATE
003959                  "LOAN-CLASS: " BORP-LOAN-CLASS
003960                  DELIMITED BY SIZE INTO FBRVDDL-DESC
003961           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????" TO ERR-DESC
                 WRITE LONERR-REC
003962        END-IF
003963     END-IF
003964*
003965     IF BOIS-FINE1-GR-RT-IND1 = "N"
003966        CONTINUE
003967     ELSE
003968        INITIALIZE FBRVDDL-DESC
003969        STRING "FINE-P-IN-GR-PAY-IND NOT CORRECT "
003970               "ACCOUNT: " BORMR-KEY-1(4:16)
003971               "FINE-P-IN-GR-PAY-IND:" BOIS-FINE1-GR-RT-IND1
003972               DELIMITED BY SIZE INTO FBRVDDL-DESC
003973        PERFORM B1021-WRITE-FBRVDDL 
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "WOKAO????" TO ERR-DESC
              WRITE LONERR-REC
003974     END-IF
003975*
003976     IF BOIS-FINE1-GR-RT-IND2(2:1) = "D"
003977        CONTINUE
003978     ELSE
003979        INITIALIZE FBRVDDL-DESC
003980        STRING "FINE-P-OUT-GR NOT CORRECT "
003981               "ACCOUNT: " BORMR-KEY-1(4:16)
003982               "FINE-P-OUT-GR:" BOIS-FINE1-GR-RT-IND2(2:1)
003983               DELIMITED BY SIZE INTO FBRVDDL-DESC
003984        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "WOKAO????" TO ERR-DESC
              WRITE LONERR-REC
003985     END-IF
003986*
003987     IF BOIS-FINE1-GR-RT-IND2(1:1) = "D"
003988        CONTINUE
003989     ELSE
003990        INITIALIZE FBRVDDL-DESC
003991        STRING "FINE-P-IN-GR NOT CORRECT "
003992               "ACCOUNT: " BORMR-KEY-1(4:16)
003993               "FINE-P-IN-GR:" BOIS-FINE1-GR-RT-IND2(1:1)
003994               DELIMITED BY SIZE INTO FBRVDDL-DESC
003995        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "WOKAO????" TO ERR-DESC
              WRITE LONERR-REC
003996     END-IF
003997*
003998     IF BOIS-FINE2-GR-RT-IND1 = "N"
003999        CONTINUE
004000     ELSE
004001        INITIALIZE FBRVDDL-DESC
004002        STRING "FINE-I-IN-GR-PAY-IND NOT CORRECT "
004003               "ACCOUNT: " BORMR-KEY-1(4:16)
004004               "FINE-I-IN-GR-PAY-IND:" BOIS-FINE2-GR-RT-IND1
004005               DELIMITED BY SIZE INTO FBRVDDL-DESC
004006        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "WOKAO????" TO ERR-DESC
              WRITE LONERR-REC
004007     END-IF
004008*
004009     IF BOIS-FINE2-GR-RT-IND2(2:1) = "D"
004010        CONTINUE
004011     ELSE
004012        INITIALIZE FBRVDDL-DESC
004013        STRING "FINE-I-OUT-GR NOT CORRECT "
004014               "ACCOUNT: " BORMR-KEY-1(4:16)
004015               "FINE-I-OUT-GR:" BOIS-FINE2-GR-RT-IND2(2:1)
004016               DELIMITED BY SIZE INTO FBRVDDL-DESC
004017        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "WOKAO????" TO ERR-DESC
              WRITE LONERR-REC
004018     END-IF
004019*
004020*
004021     IF BOIS-FINE2-GR-RT-IND2(1:1) = "D"
004022        CONTINUE
004023     ELSE
004024        INITIALIZE FBRVDDL-DESC
004025        STRING "FINE-I-IN-GR NOT CORRECT "
004026               "ACCOUNT: " BORMR-KEY-1(4:16)
004027               "FINE-I-IN-GR:" BOIS-FINE2-GR-RT-IND2(1:1)
004028               DELIMITED BY SIZE INTO FBRVDDL-DESC
004029        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "WOKAO????" TO ERR-DESC
              WRITE LONERR-REC
004030     END-IF
004031*
004032     IF BOIS-FINE4-RT-INCR >= 0
004033        CONTINUE
004034     ELSE
004035        INITIALIZE FBRVDDL-DESC
004036        STRING "FINE4-RT-INCR NOT CORRECT "
004037               "ACCOUNT: " BORMR-KEY-1(4:16)
004038               "FINE4-RT-INCR: " TEMP-FINE4-RT-INCR
004039               DELIMITED BY SIZE INTO FBRVDDL-DESC
004040        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "WOKAO????" TO ERR-DESC
              WRITE LONERR-REC
004041     END-IF
004042*
004043     IF BOIS-FINE4-RT-INCR-OPT = 0
004044        IF BOIS-FINE4-RT-INCR = 0
004045           CONTINUE
004046        ELSE
004047           INITIALIZE FBRVDDL-DESC
004048           STRING "FINE4-RT-INCR NOT CORRECT "
004049                  "ACCOUNT: " BORMR-KEY-1(4:16)
004050                  "FINE4-RT-INCR:" TEMP-FINE4-RT-INCR
004051                  "FINE4-RT-INCR-OPT: " BOIS-FINE4-RT-INCR-OPT
004052                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004053           PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "????????????????" TO ERR-DESC
              WRITE LONERR-REC
004054        END-IF
004055     END-IF
004056*
004057     IF BOIS-FINE4-RT-INCR-OPT = 1
004058        IF BOIS-FINE4-RT-INCR >= BORP-FINE4-RT-INCR-MIN-VALUE AND
004059           BOIS-FINE4-RT-INCR <= BORP-FINE4-RT-INCR-MAX-VALUE
004060           CONTINUE
004061        ELSE
004062           INITIALIZE FBRVDDL-DESC
004063           STRING "FINE4-RT-INCR NOT CORRECT "
004064                  "ACCOUNT: " BORMR-KEY-1(4:16)
004065                  "FINE4-RT-INCR:" TEMP-FINE4-RT-INCR
004066                  "FINE4-RT-INCR-OPT: " BOIS-FINE4-RT-INCR-OPT
004067                  "FINE4-RT-INCR-MIN-VALUE: " 
004068                       TEMP-FINE4-RT-INCR-MIN-VALUE
004069                  "FINE4-RT-INCR-MAX-VALUE: " 
004070                       TEMP-FINE4-RT-INCR-MAX-VALUE
004071                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004072           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????????" TO ERR-DESC
                 WRITE LONERR-REC
004073        END-IF
004074     END-IF
004075*
004076     IF BOIS-FINE4-RT-INCR-OPT = 2
004077        IF BOIS-FINE4-RT-INCR >= BORP-FINE4-RT-INCR-MIN-PERC AND
004078           BOIS-FINE4-RT-INCR <= BORP-FINE4-RT-INCR-MAX-PERC
004079           CONTINUE
004080        ELSE
004081           INITIALIZE FBRVDDL-DESC
004082           INITIALIZE FBRVDDL-DESC
004083           STRING "FINE4-RT-INCR NOT CORRECT "
004084                  "ACCOUNT: " BORMR-KEY-1(4:16)
004085                  "FINE4-RT-INCR:" TEMP-FINE4-RT-INCR
004086                  "FINE4-RT-INCR-OPT: " BOIS-FINE4-RT-INCR-OPT
004087                  "FINE4-RT-INCR-MIN-PERC: " 
004088                       TEMP-FINE4-RT-INCR-MIN-PERC
004089                  "FINE4-RT-INCR-MAX-PERC: " 
004090                       TEMP-FINE4-RT-INCR-MAX-PERC
004091                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004092           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????????" TO ERR-DESC
                 WRITE LONERR-REC
004093        END-IF
004094     END-IF
004095*
004096     IF BORP-LOAN-CLASS = 1
004097        IF BOIS-FINE4-RT-INCR = 0
004098           CONTINUE
004099        ELSE
004100           INITIALIZE FBRVDDL-DESC
004101           STRING "FINE4-RT-INCR NOT CORRECT "
004102                  "ACCOUNT: " BORMR-KEY-1(4:16)
004103                  "FINE4-RT-INCR:" TEMP-FINE4-RT-INCR
004104                  "LOAN-CLASS: " BORP-LOAN-CLASS
004105                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004106           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "????????????????" TO ERR-DESC
                 WRITE LONERR-REC
004107        END-IF
004108     END-IF
004109*
004110     IF BOIS-FINE4-RT-INCR-OPT = 0 OR 
004111        BOIS-FINE4-RT-INCR-OPT = 1 OR 
004112        BOIS-FINE4-RT-INCR-OPT = 2
004113        CONTINUE
004114     ELSE
004115        INITIALIZE FBRVDDL-DESC
004116        STRING "FINE4-RT-INCR-OPT NOT CORRECT "
004117               "ACCOUNT: " BORMR-KEY-1(4:16)
004118               "FINE4-RT-INCR-OPT:" BOIS-FINE4-RT-INCR-OPT
004119               DELIMITED BY SIZE INTO FBRVDDL-DESC
004120        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????????????" TO ERR-DESC
              WRITE LONERR-REC
004121     END-IF
004122*
004123     IF BORP-LOAN-CLASS = 1
004124        IF BOIS-FINE4-RT-INCR-OPT = 0
004125           CONTINUE
004126        ELSE
004127           INITIALIZE FBRVDDL-DESC
004128           STRING "FINE4-RT-INCR-OPT NOT CORRECT "
004129                  "ACCOUNT: " BORMR-KEY-1(4:16)
004130                  "FINE4-RT-INCR-OPT:" BOIS-FINE4-RT-INCR-OPT
004131                  "LOAN-CLASS: " BORP-LOAN-CLASS
004132                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004133           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????????????" TO ERR-DESC
                 WRITE LONERR-REC
004134        END-IF
004135     END-IF
004136*
004137     IF BOIS-FINE4-INT-RATE >= 0
004138        CONTINUE
004139     ELSE
004140        INITIALIZE FBRVDDL-DESC
004141        STRING "FINE4-INT-RATE NOT CORRECT "
004142               "ACCOUNT: " BORMR-KEY-1(4:16)
004143               "FINE4-INT-RATE: " TEMP-FINE4-INT-RATE
004144               DELIMITED BY SIZE INTO FBRVDDL-DESC
004145        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????????" TO ERR-DESC
              WRITE LONERR-REC
004146     END-IF
004147*
004148     IF BORP-LOAN-CLASS = 1
004149        IF BOIS-FINE4-INT-RATE = 0
004150           CONTINUE
004151        ELSE
004152           INITIALIZE FBRVDDL-DESC
004153           STRING "FINE4-INT-RATE NOT CORRECT "
004154                  "ACCOUNT: " BORMR-KEY-1(4:16)
004155                  "FINE4-INT-RATE: " TEMP-FINE4-INT-RATE
004156                  "LOAN-CLASS: " BORP-LOAN-CLASS
004157                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004158           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????" TO ERR-DESC
                 WRITE LONERR-REC
004159        END-IF
004160     END-IF
004161*
004162     IF BOIS-PEN-FREQ = 01 OR 
004163        BOIS-PEN-FREQ = 03 OR 
004164        BOIS-PEN-FREQ = 06 OR 
004165        BOIS-PEN-FREQ = 12 OR 
004166        BOIS-PEN-FREQ = 14 OR 
004167        BOIS-PEN-FREQ = 99
004168        CONTINUE
004169     ELSE
004170        INITIALIZE FBRVDDL-DESC
004171        STRING "PEN-FREQ NOT CORRECT "
004172               "ACCOUNT: " BORMR-KEY-1(4:16)
004173               "PEN-FREQ:" BOIS-PEN-FREQ
004174               DELIMITED BY SIZE INTO FBRVDDL-DESC
004175        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????" TO ERR-DESC
              WRITE LONERR-REC
004176     END-IF
004177*
004178     IF BOIS-PEN-FREQ = "99" 
004179        IF BOIS-FINE4-INT-RATE = 0
004180           CONTINUE
004181        ELSE
004182           INITIALIZE FBRVDDL-DESC
004183           STRING "FINE4-INT-RATE NOT CORRECT "
004184                  "ACCOUNT: " BORMR-KEY-1(4:16)
004185                  "FINE4-INT-RATE: " TEMP-FINE4-INT-RATE
004186                  "PEN-FREQ: " BOIS-PEN-FREQ
004187                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004188           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "???????????" TO ERR-DESC
                 WRITE LONERR-REC
004189        END-IF
004190     END-IF 
004191*
004192*     IF BORP-LOAN-CLASS = 0
004193*        IF BOIS-PEN-FREQ = 99
004194*           CONTINUE
004195*        ELSE
004196*           INITIALIZE FBRVDDL-DESC
004197*           STRING "PEN-FREQ NOT CORRECT "
004198*                  "ACCOUNT: " BORMR-KEY-1(4:16)
004199*                  "PEN-FREQ:" BOIS-PEN-FREQ
004200*                  "LOAN-CLASS: " BORP-LOAN-CLASS
004201*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004202*           PERFORM B1021-WRITE-FBRVDDL
004203*        END-IF
004204*     END-IF
004205*
004206     IF BOIS-ARREARS-CTR > 0
004207        IF BOIS-PEN-DUE-DT = BOIS-LST-UNPD-DUE-DTE
004208           CONTINUE
004209        ELSE
004210           INITIALIZE FBRVDDL-DESC
004211           MOVE BOIS-PEN-DUE-DT TO TEMP-WHATEVER
004212           STRING "PEN-DUE-DT NOT CORRECT "
004213                  "ACCOUNT: " BORMR-KEY-1(4:16)
004214                  "PEN-DUE-DT:" TEMP-WHATEVER
004215                  "ARREARS-CTR: " TEMP-ARREARS-CTR
004216                  "LAST-UNPAID-DUE-DATE: " 
004217                         TEMP-LST-UNPD-DUE-DTE
004218                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004219           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????" TO ERR-DESC
                 WRITE LONERR-REC
004220        END-IF
004221     END-IF
004222*
004223     IF BOIS-ARREARS-CTR = 0
004224        IF BOIS-PEN-DUE-DT = 0
004225           CONTINUE
004226        ELSE
004227           INITIALIZE FBRVDDL-DESC
004228           MOVE BOIS-PEN-DUE-DT TO TEMP-WHATEVER
004229           STRING "PEN-DUE-DT NOT CORRECT "
004230                  "ACCOUNT: " BORMR-KEY-1(4:16)
004231                  "PEN-DUE-DT:" TEMP-WHATEVER
004232                  "ARREARS-CTR: " TEMP-ARREARS-CTR
004233                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004234           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????" TO ERR-DESC
                 WRITE LONERR-REC
004235        END-IF
004236     END-IF
004237*
004238     IF BORMR-EOY-BASIC-BAL >= 0
004239        CONTINUE
004240     ELSE
004241        INITIALIZE FBRVDDL-DESC
004242        STRING "EOY-BASIC-BAL NOT CORRECT "
004243               "ACCOUNT: " BORMR-KEY-1(4:16)
004244               "EOY-BASIC-BAL: " TEMP-EOY-BASIC-BAL
004245               DELIMITED BY SIZE INTO FBRVDDL-DESC
004246        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????" TO ERR-DESC
              WRITE LONERR-REC
004247     END-IF
004248*
004249     IF BORMR-LST-MNT-DATE = TODAY-DATE
004250        CONTINUE
004251     ELSE
004252        INITIALIZE FBRVDDL-DESC
004253        STRING "LST-MNT-DATE NOT CORRECT "
004254               "ACCOUNT: " BORMR-KEY-1(4:16)
004255               "LST-MNT-DATE:" TEMP-LST-MNT-DATE
004256               "TODAY-DATE: " TODAY-DATE
004257               DELIMITED BY SIZE INTO FBRVDDL-DESC
004258        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????????" TO ERR-DESC
              WRITE LONERR-REC
004259     END-IF
004260*
004261     IF BORMR-RESIDUAL-BAL = 0
004262        CONTINUE
004263     ELSE
004264        INITIALIZE FBRVDDL-DESC
004265        STRING "RESIDUAL-BAL NOT CORRECT "
004266               "ACCOUNT: " BORMR-KEY-1(4:16)
004267               "RESIDUAL-BAL: " TEMP-RESIDUAL-BAL
004268               DELIMITED BY SIZE INTO FBRVDDL-DESC
004269        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????" TO ERR-DESC
              WRITE LONERR-REC
004270     END-IF
004271*
004272     IF BORMR-BAD-DEBT-IND = 00 OR BORMR-BAD-DEBT-IND = 50           
004273        IF BORMR-GL-CLASS-CODE(1:5) = BORMR-BR-NO  AND
004274           BORMR-GL-CLASS-CODE(6:3) = BORMR-CURRENCY-IND AND 
004275           BORMR-GL-CLASS-CODE(9:8) = 
004276           BORP-CGL-COMPONENT-1-DR(10:8)  AND 
004277           BORMR-GL-CLASS-CODE(17:8) = 
004278           BORP-CGL-COMPONENT-2-DR(3:8)
004279           CONTINUE
004280        ELSE
004281           INITIALIZE FBRVDDL-DESC
004282           STRING "GL-CLASSIFICATION-CODE NOT CORRECT "
004283                  "ACCOUNT: " BORMR-KEY-1(4:16)
004284                  "GL-CLASSIFICATION-CODE:" 
004285                      BORMR-GL-CLASS-CODE
004286                  "BAD-DEBT-IND: " BORMR-BAD-DEBT-IND
004287                  "BR-NO: " BORMR-BR-NO
004288                  "CURR-IND: " BORMR-CURRENCY-IND
004289                  "CGL-COMPONENT-1-DR: " BORP-CGL-COMPONENT-1-DR
004290                  "CGL-COMPONENT-2-DR: " BORP-CGL-COMPONENT-2-DR
004291                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004292           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????" TO ERR-DESC
                 WRITE LONERR-REC
004293        END-IF
004294     END-IF
004295*
004296     IF BORMR-BAD-DEBT-IND = 02 OR BORMR-BAD-DEBT-IND = 52           
004297        IF BORMR-GL-CLASS-CODE(1:5) = BORMR-BR-NO AND
004298           BORMR-GL-CLASS-CODE(6:3) = BORMR-CURRENCY-IND AND
004299           BORMR-GL-CLASS-CODE(9:8) = 
004300           BORP-NON-CGL-COMPONENT-1(10:8)  AND 
004301           BORMR-GL-CLASS-CODE(17:8) = 
004302           BORP-NON-CGL-COMPONENT-2(3:8)
004303           CONTINUE
004304        ELSE
004305           INITIALIZE FBRVDDL-DESC
004306           STRING "GL-CLASSIFICATION-CODE NOT CORRECT "
004307                  "ACCOUNT: " BORMR-KEY-1(4:16)
004308                  "GL-CLASSIFICATION-CODE:"
004309                            BORMR-GL-CLASS-CODE
004310                  "BAD-DEBT-IND: " BORMR-BAD-DEBT-IND
004311                  "BR-NO: " BORMR-BR-NO
004312                  "CURR-IND: " BORMR-CURRENCY-IND
004313                  "NON-CGL-COMPONENT-1: " BORP-NON-CGL-COMPONENT-1
004314                  "NON-CGL-COMPONENT-2: " BORP-NON-CGL-COMPONENT-2
004315                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004316           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????" TO ERR-DESC
                 WRITE LONERR-REC
004317        END-IF
004318     END-IF
004319*
004320     IF BORMR-BAD-DEBT-IND = 54       
004321        IF BORMR-GL-CLASS-CODE(1:5) = BORMR-BR-NO AND
004322           BORMR-GL-CLASS-CODE(6:3) = BORMR-CURRENCY-IND AND
004323           BORMR-GL-CLASS-CODE(9:8) = 
004324           BORP-BAD-DEBT-OFF-GL-COMP1(10:8)  AND 
004325           BORMR-GL-CLASS-CODE(17:8) = 
004326           BORP-BAD-DEBT-OFF-GL-COMP2(3:8)
004327           CONTINUE
004328        ELSE
004329           INITIALIZE FBRVDDL-DESC
004330           STRING "GL-CLASSIFICATION-CODE NOT CORRECT "
004331                  "ACCOUNT: " BORMR-KEY-1(4:16)
004332                  "GL-CLASSIFICATION-CODE:" 
004333                      BORMR-GL-CLASS-CODE
004334                  "BR-NO: " BORMR-BR-NO
004335                  "CURR-IND: " BORMR-CURRENCY-IND
004336                  "BAD-DEBT-OFF-GL-COMP1: " 
004337                     BORP-BAD-DEBT-OFF-GL-COMP1
004338                  "BAD-DEBT-OFF-GL-COMP2: " 
004339                     BORP-BAD-DEBT-OFF-GL-COMP2
004340                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004341           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????" TO ERR-DESC
                 WRITE LONERR-REC
004342        END-IF
004343     END-IF
004344*
004345     IF BOIS-FIRST-REPAY-IND = 0 OR 
004346        BOIS-FIRST-REPAY-IND = 1 OR 
004347        BOIS-FIRST-REPAY-IND = 3
004348        CONTINUE
004349     ELSE
004350        INITIALIZE FBRVDDL-DESC
004351        STRING "FIRST-REPAY-IND NOT CORRECT "
004352               "ACCOUNT: " BORMR-KEY-1(4:16)
004353               "FIRST-REPAY-IND:" BOIS-FIRST-REPAY-IND
004354               DELIMITED BY SIZE INTO FBRVDDL-DESC
004355        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??¦ɿ????????" TO ERR-DESC
              WRITE LONERR-REC
004356     END-IF
004357*
004358*     IF BORP-LOAN-CLASS = 1
004359*        IF BOIS-FIRST-REPAY-IND = 1 OR 3
004360*           CONTINUE
004361*        ELSE
004362*           INITIALIZE FBRVDDL-DESC
004363*           STRING "FIRST-REPAY-IND NOT CORRECT "
004364*                  "ACCOUNT: " BORMR-KEY-1(4:16)
004365*                  "FIRST-REPAY-IND:" BOIS-FIRST-REPAY-IND
004366*                  "LOAN-CLASS: " BORP-LOAN-CLASS
004367*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004368*           PERFORM B1021-WRITE-FBRVDDL
004369*        END-IF
004370*     END-IF
004371*
004372     IF BOIS-LST-FIN-POST-DT = TODAY-DATE
004373        CONTINUE
004374     ELSE
004375        INITIALIZE FBRVDDL-DESC
004376        STRING "LST-FIN-POST-DT NOT CORRECT "
004377               "ACCOUNT: " BORMR-KEY-1(4:16)
004378               "LST-FIN-POST-DT:" TEMP-LAST-FIN-POST-DT
004379               "TODAY-DATE: " TODAY-DATE
004380               DELIMITED BY SIZE INTO FBRVDDL-DESC
004381        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "??¦˿???????" TO ERR-DESC
              WRITE LONERR-REC
004382     END-IF
004383*
004384*     IF BOIS-NEGO-RATE-IND = 0 AND BOIS-EFR-CHNG-IND NOT = SPACE
004385*        IF BOIS-FLOAT-STRT-PREV-DT >= BOIS-FIRST-ADV-DATE AND 
004386**           TODAY-DATE < BOIS-FLOAT-STRT-PREV-DT AND 
004387*           BOIS-FLOAT-STRT-PREV-DT <= BOIS-MATURITY-DATE
004388*           CONTINUE
004389*        ELSE
004390*           INITIALIZE FBRVDDL-DESC
004391*           MOVE BOIS-FIRST-ADV-DATE TO TEMP-DATE
004392*           STRING "FLOAT-FRST-DT NOT CORRECT "
004393*                  "ACCOUNT: " BORMR-KEY-1(4:16)
004394*                  "FLOAT-FRST-DT: " TEMP-FLOAT-STRT-PREV-DT
004395*                  "NEGO-RATE-IND: " BOIS-NEGO-RATE-IND
004396*                  "EFR-CHNG-IND: " BOIS-EFR-CHNG-IND
004397*                  "FIRST-ADV-DATE: " TEMP-DATE
004398*                  "MATURITY-DATE: " TEMP-MATURITY-DATE
004399*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004400*           PERFORM B1021-WRITE-FBRVDDL
004401*        END-IF
004402*     END-IF
004403**
004404*     IF BOIS-NEGO-RATE-IND NOT = 0 OR BOIS-EFR-CHNG-IND = SPACE
004405*        IF BOIS-FLOAT-STRT-PREV-DT = 0
004406*           CONTINUE
004407*        ELSE
004408*           INITIALIZE FBRVDDL-DESC
004409*           STRING "FLOAT-FRST-DT NOT CORRECT "
004410*                  "ACCOUNT: " BORMR-KEY-1(4:16)
004411*                  "FLOAT-FRST-DT: " TEMP-FLOAT-STRT-PREV-DT
004412*                  "NEGO-RATE-IND: " BOIS-NEGO-RATE-IND
004413*                  "EFR-CHNG-IND: " BOIS-EFR-CHNG-IND
004414*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004415*           PERFORM B1021-WRITE-FBRVDDL
004416*        END-IF
004417*     END-IF
004418*
004419     IF BOIS-ARREARS-CTR > 0 OR BOIS-FINE4-GRACE-PERIOD = 01
004420        IF BOIS-PEN-DUE-DT = BOIS-LST-UNPD-DUE-DTE
004421           CONTINUE
004422        ELSE
004423           INITIALIZE FBRVDDL-DESC
004424           MOVE BOIS-PEN-DUE-DT TO TEMP-WHATEVER
004425           STRING "PEN-DUE-DT NOT CORRECT "
004426                  "ACCOUNT: " BORMR-KEY-1(4:16)
004427                  "PEN-DUE-DT:" TEMP-WHATEVER
004428                  "ARREARS-CTR: " TEMP-ARREARS-CTR
004429                  "OVERDUE-STAT: " BOIS-FINE4-GRACE-PERIOD
004430                  "LAST-UNPAID-DUE-DATE: " 
004431                         TEMP-LST-UNPD-DUE-DTE
004432                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004433           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????" TO ERR-DESC
                 WRITE LONERR-REC
004434        END-IF
004435     END-IF
004436*
004437     IF BOIS-ARREARS-CTR = 0 AND BOIS-FINE4-GRACE-PERIOD = 00
004438        IF BOIS-PEN-DUE-DT = 0
004439           CONTINUE
004440        ELSE
004441           INITIALIZE FBRVDDL-DESC
004442           MOVE BOIS-PEN-DUE-DT TO TEMP-WHATEVER
004443           STRING "PEN-DUE-DT NOT CORRECT "
004444                  "ACCOUNT: " BORMR-KEY-1(4:16)
004445                  "PEN-DUE-DT:" TEMP-WHATEVER
004446                  "ARREARS-CTR: " TEMP-ARREARS-CTR
004447                  "OVERDUE-STAT: " BOIS-FINE4-GRACE-PERIOD
004448                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004449           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "??????????" TO ERR-DESC
                 WRITE LONERR-REC
004450        END-IF
004451     END-IF
004452*
004453*     IF BOIS-NEGO-RATE-IND = 0 AND BOIS-EFR-CHNG-IND NOT = SPACE
004454*        IF BOIS-FIRST-ADV-DATE <= BOIS-FLOAT-NEXT-DT AND 
004455*           BOIS-FLOAT-NEXT-DT <= BOIS-MATURITY-DATE
004456*           CONTINUE
004457*        ELSE
004458*           INITIALIZE FBRVDDL-DESC
004459*           MOVE BOIS-FLOAT-NEXT-DT TO TEMP-DATE
004460*           MOVE BOIS-FIRST-ADV-DATE TO TEMP-WHATEVER
004461*           STRING "FLOAT-PREV-DT NOT CORRECT "
004462*                  "ACCOUNT: " BORMR-KEY-1(4:16)
004463*                  "FLOAT-PREV-DT:" TEMP-DATE
004464*                  "NEGO-RATE-IND: " BOIS-NEGO-RATE-IND
004465*                  "EFR-CHNG-IND: " BOIS-EFR-CHNG-IND
004466*                  "FIRST-ADV-DATE: " TEMP-WHATEVER
004467*                  "MATURITY-DATE: " TEMP-MATURITY-DATE
004468*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004469*           PERFORM B1021-WRITE-FBRVDDL
004470*        END-IF
004471*     END-IF
004472*
004473*     IF BOIS-NEGO-RATE-IND NOT = 0 OR BOIS-EFR-CHNG-IND = SPACE
004474*        IF BOIS-FLOAT-NEXT-DT = 0
004475*           CONTINUE
004476*        ELSE
004477*           INITIALIZE FBRVDDL-DESC
004478*           MOVE BOIS-FLOAT-NEXT-DT TO TEMP-DATE
004479*           STRING "FLOAT-PREV-DT NOT CORRECT "
004480*                  "ACCOUNT: " BORMR-KEY-1(4:16)
004481*                  "FLOAT-PREV-DT:" TEMP-DATE
004482*                  "NEGO-RATE-IND: " BOIS-NEGO-RATE-IND
004483*                  "EFR-CHNG-IND: " BOIS-EFR-CHNG-IND
004484*                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004485*           PERFORM B1021-WRITE-FBRVDDL
004486*        END-IF
004487*     END-IF
004488*
004489     IF BORMR-CAPN-METHOD = "X"
004490        IF BOIS-ISSUER-ACCT-SYS = "DEP" OR "BGL"
004491           CONTINUE
004492        ELSE
004493           INITIALIZE FBRVDDL-DESC
004494           STRING "ISSUER-ACCT-SYS NOT CORRECT "
004495                  "ACCOUNT: " BORMR-KEY-1(4:16)
004496                  "ISSUER-ACCT-SYS:" BOIS-ISSUER-ACCT-SYS
004497                  "CAPN-METHOD: " BORMR-CAPN-METHOD
004498                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004499           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????" TO ERR-DESC
                 WRITE LONERR-REC
004500        END-IF
004501     END-IF
004502*
004503     IF BORMR-CAPN-METHOD NOT = "X"
004504        IF BOIS-ISSUER-ACCT-SYS = SPACE
004505           CONTINUE
004506        ELSE
004507           INITIALIZE FBRVDDL-DESC
004508           STRING "ISSUER-ACCT-SYS NOT CORRECT "
004509                  "ACCOUNT: " BORMR-KEY-1(4:16)
004510                  "ISSUER-ACCT-SYS:" BOIS-ISSUER-ACCT-SYS
004511                  "CAPN-METHOD: " BORMR-CAPN-METHOD
004512                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004513           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "?????????" TO ERR-DESC
                 WRITE LONERR-REC
004514        END-IF
004515     END-IF
004516*
004517*     IF BORP-MIN-TERM <= BOIS-LOAN-LIFE-TRM AND 
004518*        BOIS-LOAN-LIFE-TRM <= BORP-MAX-TERM
004519*        CONTINUE
004520*     ELSE
004521*        INITIALIZE FBRVDDL-DESC
004522*        MOVE BOIS-LOAN-LIFE-TRM TO TEMP-DATE
004523*        MOVE BORP-MIN-TERM TO TEMP-ACCOUNT
004524*        MOVE BORP-MAX-TERM TO TEMP-WHATEVER
004525*        STRING "LOAN-LIFE-TRM NOT CORRECT "
004526*               "ACCOUNT: " BORMR-KEY-1(4:16)
004527*               "LOAN-LIFE-TRM:" TEMP-DATE
004528*               "MIN-TERM: " TEMP-ACCOUNT
004529*               "MAX-TERM: " TEMP-WHATEVER
004530*               DELIMITED BY SIZE INTO FBRVDDL-DESC
004531*        PERFORM B1021-WRITE-FBRVDDL
004532*     END-IF
004533*
004534     IF BOIS-PRIORITY-CODE = 2
004535        CONTINUE
004536     ELSE
004537        INITIALIZE FBRVDDL-DESC
004538        STRING "PRIORITY-CODE NOT CORRECT "
004539               "ACCOUNT: " BORMR-KEY-1(4:16)
004540               "PRIORITY-CODE:" BOIS-PRIORITY-CODE
004541               DELIMITED BY SIZE INTO FBRVDDL-DESC
004542        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "?????????" TO ERR-DESC
              WRITE LONERR-REC
004543     END-IF
004544*
004545     IF BOIS-APP-MATURITY-DT NOT = 0
004546        CONTINUE
004547     ELSE
004548        INITIALIZE FBRVDDL-DESC
004549        MOVE BOIS-APP-MATURITY-DT TO TEMP-DATE
004550        STRING "APP-MATURITY-DT NOT CORRECT "
004551               "ACCOUNT: " BORMR-KEY-1(4:16)
004552               "APP-MATURITY-DT:" TEMP-DATE
004553               DELIMITED BY SIZE INTO FBRVDDL-DESC
004554        PERFORM B1021-WRITE-FBRVDDL
              MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
              MOVE "???????????" TO ERR-DESC
              WRITE LONERR-REC
004555     END-IF
004556*
004557*     IF BOIS-PROMO-TELLER NOT = 0 OR SPACE
004558*        CONTINUE
004559*     ELSE
004560*        INITIALIZE FBRVDDL-DESC
004561*        STRING "PROMO-TELLER NOT CORRECT "
004562*               "ACCOUNT: " BORMR-KEY-1(4:16)
004563*               "PROMO-TELLER:" BOIS-PROMO-TELLER
004564*               DELIMITED BY SIZE INTO FBRVDDL-DESC
004565*        PERFORM B1021-WRITE-FBRVDDL
004566*     END-IF
004567*
004568     IF WS-BRHM-BR-FLG(BORMR-BR-NO) NOT = "Y"
004569        INITIALIZE FBRVDDL-DESC
004570        STRING "BRANCH NO NOT EXIT"
004571               "ACCOUNT: " BORMR-KEY-1(4:16)
004572               "BR_NO: " BORMR-BR-NO
004573               DELIMITED BY SIZE INTO FBRVDDL-DESC
004574        PERFORM B1021-WRITE-FBRVDDL
004575     END-IF
004576*
004577     MOVE BORMR-CUSTOMER-NO TO CUSM-CUST-ACCT-NO 
004578     PERFORM CHECK-IN-CUSM 
004579     IF EXIST-FLAG = "N"
004580        INITIALIZE FBRVDDL-DESC
004581        STRING "CUSTOMER-NO NOT EXIST"
004582               "ACCOUNT: " BORMR-KEY-1(4:16)
004583               "CUSTOMER-NO: " BORMR-CUSTOMER-NO
004584               DELIMITED BY SIZE INTO FBRVDDL-DESC
004585        PERFORM B1021-WRITE-FBRVDDL
004586     END-IF
004587*
004588     MOVE BORMR-CURRENCY-IND TO CCYM-CURRENCY
004589     PERFORM CHECK-IN-CCYM 
004590     IF EXIST-FLAG = "N"
004591        INITIALIZE FBRVDDL-DESC
004592        STRING "CURR-IND NOT EXIST"
004593               "ACCOUNT: " BORMR-KEY-1(4:16)
004594               "CURR-IND: " BORMR-CURRENCY-IND
004595               DELIMITED BY SIZE INTO FBRVDDL-DESC
004596        PERFORM B1021-WRITE-FBRVDDL
004597     END-IF
004598*
004599     IF BORMR-TRF-ACCT-NO NOT = ZEROS AND SPACES
004600        MOVE "003" TO INVM-KEY-1(1:3)
004601        MOVE BORMR-TRF-ACCT-NO TO INVM-KEY-1(4:16)
004602        PERFORM CHECK-IN-INVM
004603        IF EXIST-FLAG = "N"
004604           INITIALIZE FBRVDDL-DESC
004605           MOVE BORMR-TRF-ACCT-NO TO TEMP-ACCOUNT
004606           STRING "TRF-ACCT-NO NOT EXIST"
004607                  "ACCOUNT: " BORMR-KEY-1(4:16)
004608                  "TRF-ACCT-NO: " TEMP-ACCOUNT
004609                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004610           PERFORM B1021-WRITE-FBRVDDL
004611        END-IF
004612     END-IF
004613*
004614     IF BOIS-AUTO-DBT-ACCT-NO NOT = ZEROS AND SPACES
004615        MOVE "003" TO INVM-KEY-1(1:3)
004616        MOVE BOIS-AUTO-DBT-ACCT-NO TO INVM-KEY-1(4:16)
004617        PERFORM CHECK-IN-INVM
004618        IF EXIST-FLAG = "N"
004619           INITIALIZE FBRVDDL-DESC
004620           MOVE BOIS-AUTO-DBT-ACCT-NO TO TEMP-ACCOUNT
004621           STRING "SORD-AUTO-ACCT-NO NOT EXIST"
004622                  "ACCOUNT: " BORMR-KEY-1(4:16)
004623                  "SORD-AUTO-ACCT-NO: " TEMP-ACCOUNT
004624                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004625           PERFORM B1021-WRITE-FBRVDDL
004626        END-IF
004627     END-IF 
004628*
004629     IF BORP-LOAN-CLASS = 0 AND BOIS-ORIG-APLY-ID = "CT"
004630        MOVE BOIS-CTA-REFERENCE TO CTAM-ACCT-NO
004631        PERFORM CHECK-IN-CTAM 
004632        IF EXIST-FLAG = "N"
004633           INITIALIZE FBRVDDL-DESC
004634           STRING "CTA-REFERENCE NOT EXIST"
004635                  "ACCOUNT: " BORMR-KEY-1(4:16)
004636                  "CTA-REFERENCE: " BOIS-CTA-REFERENCE
004637                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004638           PERFORM B1021-WRITE-FBRVDDL
004639        END-IF
004640     END-IF
004641*
004642     IF BOIS-CONTRACT-IND = 1 
004643        MOVE BOIS-CONTRACT-NO TO CONB-CONTRACT-NO
004644        PERFORM CHECK-IN-CONB
004645        IF EXIST-FLAG = "N"
004646           INITIALIZE FBRVDDL-DESC
004647           STRING "CONTRACT-NO NOT EXIST"
004648                  "ACCOUNT: " BORMR-KEY-1(4:16)
004649                  "CONTRACT-NO: " BOIS-CONTRACT-NO
004650                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004651           PERFORM B1021-WRITE-FBRVDDL
004652        END-IF
004653     END-IF    
004654*           
004655     IF BOIS-OFF-BAL-FUND-PERC = "100"
004656        MOVE BOIS-FUND-AGR-NO(1:16) TO FAGD-CUST-NO 
004657        MOVE BOIS-FUND-AGR-NO(17:4) TO FAGD-SEQ-NO  
004658        PERFORM CHECK-IN-FAGD
004659        IF EXIST-FLAG = "N"
004660           INITIALIZE FBRVDDL-DESC
004661           STRING "FUND-AGR-NO NOT EXIST"
004662                  "ACCOUNT: " BORMR-KEY-1(4:16)
004663                  "FUND-AGR-NO: " BOIS-FUND-AGR-NO
004664                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004665           PERFORM B1021-WRITE-FBRVDDL
004666        END-IF
004667     END-IF    
004668*    
004669     MOVE BOIS-AUTO-RISK-GRADE TO RIGP-RISK 
004670     PERFORM CHECK-IN-RIGP
004671     IF EXIST-FLAG = "N"
004672        INITIALIZE FBRVDDL-DESC
004673        STRING "AUTO-RISK-GRADE NOT EXIST"
004674               "ACCOUNT: " BORMR-KEY-1(4:16)
004675               "AUTO-RISK-GRADE: " BOIS-AUTO-RISK-GRADE
004676               DELIMITED BY SIZE INTO FBRVDDL-DESC
004677        PERFORM B1021-WRITE-FBRVDDL
004678     END-IF
004679*
004680     IF BORP-LOAN-CLASS = 1 AND 
004681          BOIS-SUBSIDY-ACNO NOT = ZEROS AND SPACES
004682        MOVE "003" TO INVM-KEY-1(1:3)
004683        MOVE BOIS-SUBSIDY-ACNO TO INVM-KEY-1(4:16)
004684        PERFORM CHECK-IN-INVM    
004685        IF EXIST-FLAG = "N"
004686           INITIALIZE FBRVDDL-DESC
004687           STRING "SUBSIDY-ACNO NOT EXIST"
004688                  "ACCOUNT: " BORMR-KEY-1(4:16)
004689                  "SUBSIDY-ACNO: " BOIS-SUBSIDY-ACNO
004690                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004691           PERFORM B1021-WRITE-FBRVDDL
004692        END-IF
004693     END-IF 
004694*
004695     IF BORP-LOAN-CLASS = 0 AND BOIS-ORIG-APLY-ID = "CT"
004696        MOVE BOIS-ORIG-APLY-ACCT-NO TO CTAM-ACCT-NO
004697        PERFORM CHECK-IN-CTAM 
004698        IF EXIST-FLAG = "N"
004699           INITIALIZE FBRVDDL-DESC
004700           STRING "ORIG-APLY-ACCT-NO NOT EXIST"
004701                  "ACCOUNT: " BORMR-KEY-1(4:16)
004702                  "ORIG-APLY-ACCT-NO: " BOIS-ORIG-APLY-ACCT-NO
004703                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004704           PERFORM B1021-WRITE-FBRVDDL
004705        END-IF
004706     END-IF
004707*
004708     IF BOIS-REL-LOAN-AC NOT = ZEROS AND SPACES
004709        MOVE "003" TO BORMR-KEY-1(1:3)
004710        MOVE BOIS-REL-LOAN-AC TO BORMR-KEY-1(4:16)
004711        PERFORM CHECK-IN-BORM    
004712        IF EXIST-FLAG = "N"
004713           INITIALIZE FBRVDDL-DESC
004714           STRING "REL-LOAN-AC NOT EXIST"
004715                  "ACCOUNT: " BORMR-KEY-1(4:16)
004716                  "REL-LOAN-AC: " BOIS-REL-LOAN-AC
004717                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004718           PERFORM B1021-WRITE-FBRVDDL
004719        END-IF
004720     END-IF 
004721*
004722     IF BOIS-ARREARS-CTR > 0 
004723        MOVE "N" TO RPYV-HAS-ERR
004724        PERFORM CHECK-RPYV
004725        IF RPYV-HAS-ERR = "Y"
004726           INITIALIZE FBRVDDL-DESC
004727           STRING "RPYV NOT CORRECT "
004728                  "ACCOUNT: " BORMR-KEY-1(4:16)
004729                  "ARREARS-CTR: " TEMP-ARREARS-CTR
004730                  "RECORDS IN RPYV: " RPYV-RECORDS
004731                  "P IN BORM: " TEMP-UNPD-PRIN-BAL
004732                  "P IN RPYV: " ALL-P-AMT-Z 
004733                  "I IN BORM: " TEMP-CAP-UNPD-INT
004734                  "I IN RPYV: " ALL-I-AMT-Z
004735                  "W IN BORM: " TEMP-UNPD-ARR-PRN-BAL
004736                  "W IN RPYV: " ALL-W-AMT-Z 
004737                  "A IN BORM: " TEMP-UNPD-ARRS-INT-BAL
004738                  "A IN RPYV: " ALL-A-AMT-Z 
004739                  "E IN BORM: " TEMP-UNPD-INT-ARR-PRN
004740                  "E IN RPYV: " ALL-E-AMT-Z
004741                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004742           PERFORM B1021-WRITE-FBRVDDL
                 MOVE BORMR-KEY-1(4:16) TO ERR-ACCOUNT
                 MOVE "RPYV?????" TO ERR-DESC
                 WRITE LONERR-REC
004743        END-IF
004744     END-IF
004745     IF BOIS-PROMO-TELLER NOT = "0009999999"
004746        MOVE BOIS-PROMO-TELLER TO TELM-TELLER
004747        PERFORM CHECK-IN-TELM 
004748        IF EXIST-FLAG = "N"
004749           INITIALIZE FBRVDDL-DESC
004750           STRING "PROMO-TELLER NOT EXIST"
004751                  "ACCOUNT: " BORMR-KEY-1(4:16)
004752                  "PROMO-TELLER: " BOIS-PROMO-TELLER
004753                  DELIMITED BY SIZE INTO FBRVDDL-DESC
004754           PERFORM B1021-WRITE-FBRVDDL
004755        END-IF
004756     END-IF
004757     IF WS-ACCOUNT NOT = BORMR-KEY-1
004758        MOVE ERR-COUNT TO WS-COUNT-2
004759     END-IF
004760     IF WS-COUNT-2 NOT = WS-COUNT-1
004761        MOVE WS-COUNT-2 TO WS-COUNT-1
004762        ADD 1 TO WS-COUNT-3
004763        INITIALIZE FBRVDDL-DESC
004764        MOVE BORMR-KEY-1 TO WS-ACCOUNT
004765        MOVE WS-HEAD     TO FBRVDDL-DESC
004766        WRITE FBRVDDL-REC
004767     END-IF
004768     EXEC SQL
004769         FETCH BORMCUR INTO :BORMR
004770     END-EXEC.
004771     IF SQLCODE NOT = 0
004772        MOVE "Y" TO BORMR-END
004773     END-IF
004774     EXEC SQL
004775         FETCH BOISCUR INTO :BOISR
004776     END-EXEC.
           IF SQLCODE NOT = 0 
              DISPLAY "FETCH BOIS CURSOR: " SQLCODE
           END-IF.
004777 B102-EXIT.
004778*     DISPLAY "FETCH BOIS:" SQLCODE   
004779     EXIT.           
004780 B1021-WRITE-FBRVDDL.
004781     ADD 1 TO ERR-COUNT
004782     WRITE FBRVDDL-REC.
004783     EXIT.
004784 LOAD-BRANCH.
004785     INITIALIZE BRANCH-REC
004786     PERFORM UNTIL WS-BRANCH-EOF
004787         READ BRANCH
004788         MOVE BRANCH-REC                  TO BRHMG
004789         IF BRHMG-KEY-1(15:5) NOT = ZERO
004790            IF NOT WS-BRANCH-EOF
004791               MOVE BRHMG-KEY-1(15:5)     TO WS-I-BR
004792               MOVE "Y" TO WS-BRHM-BR-FLG(WS-I-BR)
004793            END-IF
004794         END-IF 
004795     END-PERFORM.
004796     EXIT.
004797 GET-TODAY-DATE.
004798     MOVE 1                              TO UT1999CA-CALL-CODE
004799     CALL "UT1999" USING UT1999CA-CALL-AREA
004800     MOVE UT1999CA-CCYYMMDD              TO UT0030-DATE-CCYYMMDD
004801     MOVE 2                              TO UT0030-FUNCTION               
004802     CALL "UT0030" USING UT0030-FUNCTION
004803                         UT0030-DATE-AREA
004804                         UT0030-BINARY-DATE
004805     MOVE UT0030-BINARY-DATE             TO TODAY-DATE.
004806     EXIT.
004807 CHECK-IN-CUSM.
004808     MOVE "N" TO EXIST-FLAG
004809     EXEC SQL
004810         DECLARE CHECKCUSM CURSOR FOR 
004811            SELECT COUNT(1) FROM CUSM WHERE 
004812            CUST_ACCT_NO = :CUSM-CUST-ACCT-NO
004813     END-EXEC
004814     EXEC SQL 
004815         OPEN CHECKCUSM
004816     END-EXEC
004817     EXEC SQL 
004818         FETCH CHECKCUSM INTO :NUMBER-OF-RECORD
004819     END-EXEC
004820     IF SQLCODE = 0 
004821        MOVE "Y" TO EXIST-FLAG
004822     END-IF
004823     EXIT.
004824 CHECK-IN-CCYM.
004825     MOVE "N" TO EXIST-FLAG
004826     EXEC SQL
004827         DECLARE CHECKCCYM CURSOR FOR 
004828            SELECT COUNT(1) FROM CCYM WHERE 
004829            CODE = :CCYM-CURRENCY
004830     END-EXEC
004831     EXEC SQL 
004832         OPEN CHECKCCYM
004833     END-EXEC
004834     EXEC SQL 
004835         FETCH CHECKCCYM INTO :NUMBER-OF-RECORD
004836     END-EXEC
004837     IF SQLCODE = 0 
004838        MOVE "Y" TO EXIST-FLAG
004839     END-IF
004840     EXIT.
004841 CHECK-IN-INVM.
004842     MOVE "N" TO EXIST-FLAG
004843     EXEC SQL
004844         DECLARE CHECKINVM CURSOR FOR 
004845            SELECT COUNT(1) FROM INVM WHERE 
004846            KEY_1 = :INVM-KEY-1
004847     END-EXEC
004848     EXEC SQL 
004849         OPEN CHECKINVM
004850     END-EXEC
004851     EXEC SQL 
004852         FETCH CHECKINVM INTO :NUMBER-OF-RECORD
004853     END-EXEC
004854     IF SQLCODE = 0 
004855        MOVE "Y" TO EXIST-FLAG
004856     END-IF
004857     EXIT.
004858 CHECK-IN-CTAM.
004859     MOVE "N" TO EXIST-FLAG
004860     EXEC SQL
004861         DECLARE CHECKCTAM CURSOR FOR 
004862            SELECT COUNT(1) FROM CTAM WHERE 
004863            ACC_NO = :CTAM-ACCT-NO
004864     END-EXEC
004865     EXEC SQL 
004866         OPEN CHECKCTAM
004867     END-EXEC
004868     EXEC SQL 
004869         FETCH CHECKCTAM INTO :NUMBER-OF-RECORD
004870     END-EXEC
004871     IF SQLCODE = 0 
004872        MOVE "Y" TO EXIST-FLAG
004873     END-IF
004874     EXIT.
004875 CHECK-IN-CONB.
004876     MOVE "N" TO EXIST-FLAG
004877     EXEC SQL
004878         DECLARE CHECKCONB CURSOR FOR 
004879            SELECT COUNT(1) FROM CONB WHERE 
004880            CONTRACT_NO = :CONB-CONTRACT-NO
004881     END-EXEC
004882     EXEC SQL 
004883         OPEN CHECKCONB
004884     END-EXEC
004885     EXEC SQL 
004886         FETCH CHECKCONB INTO :NUMBER-OF-RECORD
004887     END-EXEC
004888     IF SQLCODE = 0 
004889        MOVE "Y" TO EXIST-FLAG
004890     END-IF
004891     EXIT.
004892 CHECK-IN-FAGD.
004893     MOVE "N" TO EXIST-FLAG
004894     EXEC SQL
004895         DECLARE CHECKFAGD CURSOR FOR 
004896            SELECT COUNT(1) FROM FAGD WHERE 
004897            CUST_NO = :FAGD-CUST-NO AND 
004898            SEQ_NO = :FAGD-SEQ-NO
004899     END-EXEC
004900     EXEC SQL 
004901         OPEN CHECKFAGD
004902     END-EXEC
004903     EXEC SQL 
004904         FETCH CHECKFAGD INTO :NUMBER-OF-RECORD
004905     END-EXEC
004906     IF SQLCODE = 0 
004907        MOVE "Y" TO EXIST-FLAG
004908     END-IF
004909     EXIT.
004910 CHECK-IN-RIGP.
004911     MOVE "N" TO EXIST-FLAG
004912     EXEC SQL
004913         DECLARE CHECKRIGP CURSOR FOR 
004914            SELECT COUNT(1) FROM RIGP WHERE 
004915            RISK_GRADE = :RIGP-RISK
004916     END-EXEC
004917     EXEC SQL 
004918         OPEN CHECKRIGP
004919     END-EXEC
004920     EXEC SQL 
004921         FETCH CHECKRIGP INTO :NUMBER-OF-RECORD
004922     END-EXEC
004923     IF SQLCODE = 0 
004924        MOVE "Y" TO EXIST-FLAG
004925     END-IF
004926     EXIT.
004927 CHECK-IN-BORM.
004928     MOVE "N" TO EXIST-FLAG
004929     EXEC SQL
004930         DECLARE CHECKBORM CURSOR FOR 
004931            SELECT COUNT(1) FROM BORM WHERE 
004932            KEY_1 = :BORM-KEY-1
004933     END-EXEC
004934     EXEC SQL 
004935         OPEN CHECKBORM
004936     END-EXEC
004937     EXEC SQL 
004938         FETCH CHECKBORM INTO :NUMBER-OF-RECORD
004939     END-EXEC
004940     IF SQLCODE = 0 
004941        MOVE "Y" TO EXIST-FLAG
004942     END-IF
004943     EXIT.
004944 CHECK-IN-TELM.
004945     MOVE "N" TO EXIST-FLAG
004946     EXEC SQL
004947         DECLARE CHECKTELM CURSOR FOR 
004948            SELECT COUNT(1) FROM TELM WHERE 
004949            TELLER_NO = :TELM-TELLER
004950     END-EXEC
004951     EXEC SQL 
004952         OPEN CHECKTELM
004953     END-EXEC
004954     EXEC SQL 
004955         FETCH CHECKTELM INTO :NUMBER-OF-RECORD
004956     END-EXEC
004957     IF SQLCODE = 0 
004958        MOVE "Y" TO EXIST-FLAG
004959     END-IF
004960     EXIT.
004961 LOAD-PRODUCT.
004962     MOVE 02          TO UT2000CA-CALL-CODE
004963     MOVE 003         TO UT2000CA-CALL-SOC-NO
004964     MOVE 0           TO UT2000CA-CALL-INDEX
004965                         UT2000CA-CALL-STATUS
004966     MOVE BORMR-ACT-TYPE TO UT2000CA-CALL-ACCT-TYPE
004967     MOVE BORMR-CAT  TO UT2000CA-CALL-INT-CAT
004968     CALL "UT2000"    USING UT2000CA-CALL-AREA
004969     IF UT2000CA-CALL-STATUS = 0 
004970        CONTINUE
004971     ELSE
004972        DISPLAY "CALL UT2000 ERROR"
004973        DISPLAY "ACT-TYPE: " UT2000CA-CALL-ACCT-TYPE
004974        DISPLAY "INT CAT: " UT2000CA-CALL-INT-CAT
004975*        GO TO C100-PMG-END
004976     END-IF
004977     EXIT.
004978 FORMAT-NUMBER-TO-CHAR.
004979      MOVE 20                     TO UTCONVCA-FIELD-LENGTH
004980      MOVE 1   TO UTCONVCA-SOC-NUMBER-FORMAT
004981      CALL "UTCONV"       USING UTCONVCA-CALL-AREA
004982      IF UTCONVCA-RETURN-CODE NOT = 0 
004983         DISPLAY "UTCONV CALL ERR"
004984         GO TO C100-PMG-END
004985      END-IF.
004986      EXIT.
004987 GET-LOAN-TERM.
004988     MOVE 0 TO CALCULATED-LOAN-TERM
004989     INITIALIZE UT0312CA-CALL-AREA
004990     MOVE 3 TO UT0312CA-CALL-CODE
004991     MOVE BORP-CALENDAR-CODE TO UT0312CA-CALENDAR-CODE
004992     MOVE "1" TO UT0312CA-PROC-HOLIDAY-IND
004993     MOVE BORMR-DUE-STRT-DATE TO UT0312CA-DUE-STRT-DT
004994     MOVE BORMR-DUE-STRT-DATE TO UT0312CA-EFF-DATE
004995     MOVE BORMR-CAPN-METHOD TO UT0312CA-CAPN-METHOD
004996     MOVE BORMR-REPAY-FREQ TO UT0312CA-REPAY-FREQ           
004997     MOVE "M" TO UT0312CA-TERM-BASIS
004998     MOVE BORMR-REPAY-DAY TO UT0312CA-REPAY-DAY
004999     MOVE BORMR-REPAY-SCHED TO UT0312CA-REPAY-SCHED
005000     MOVE BOIS-FIRST-REPAY-IND TO UT0312CA-1ST-DUE-DTE-IND
005001     MOVE BOIS-FINAL-REPAY-IND TO UT0312CA-FINAL-REPAY-IND
005002     SET UT0312CA-INT-ACCR-ACTUAL-DAYS TO TRUE
005003     MOVE BORMR-KEY-1 TO UT0312CA-ACCT-KEY
005004     MOVE BORP-ACCRUE-METHOD     TO UT0312CA-ACCRUE-METHOD
005005     MOVE 1 TO UT0312CA-LOAN-TERM
005006     CALL "UT0312" USING UT0312CA-CALL-AREA
005007     IF UT0312CA-RET-STATUS = 0 
005008        PERFORM UNTIL UT0312CA-NEXT-DUE-DT >= BOIS-MATURITY-DATE
005009            ADD 1 TO CALCULATED-LOAN-TERM
005010            MOVE UT0312CA-NEXT-DUE-DT TO UT0312CA-EFF-DATE
005011            CALL "UT0312" USING UT0312CA-CALL-AREA
005012        END-PERFORM
005013     ELSE
005014        DISPLAY "ERR ACCOUNT: " BORMR-KEY-1(4:16)
005015     END-IF
005016     ADD 1 TO CALCULATED-LOAN-TERM
005017     EXIT.
005018 CHECK-RPYV.
005019     INITIALIZE RPYV-ALL-9
005020                RPYV-RECORDS
005021     MOVE BORMR-KEY-1(4:16) TO RPYV-ACCT
005022     EXEC SQL
005023         DECLARE RPYVCUR CURSOR FOR 
005024         SELECT TXN_AMT1,TXN_AMT2,TXN_AMT3,
005025         TXN_AMT4,TXN_AMT5 FROM RPYV WHERE
005026         ACCT_NO = :RPYV-ACCT
005027     END-EXEC.
005028     EXEC SQL
005029         OPEN RPYVCUR
005030     END-EXEC.
005031     EXEC SQL
005032       FETCH RPYVCUR INTO 
005033      :RPYV-P-AMT,:RPYV-I-AMT,:RPYV-W-AMT,:RPYV-A-AMT,:RPYV-E-AMT
005034     END-EXEC.
005035     PERFORM UNTIL SQLCODE NOT = 0
005036         ADD RPYV-P-AMT TO ALL-P-AMT-9
005037         ADD RPYV-I-AMT TO ALL-I-AMT-9
005038         ADD RPYV-W-AMT TO ALL-W-AMT-9
005039         ADD RPYV-A-AMT TO ALL-A-AMT-9
005040         ADD RPYV-E-AMT TO ALL-E-AMT-9
005041         ADD 1 TO RPYV-RECORDS
005042         EXEC SQL
005043             FETCH RPYVCUR INTO 
005044     :RPYV-P-AMT,:RPYV-I-AMT,:RPYV-W-AMT,:RPYV-A-AMT,:RPYV-E-AMT
005045         END-EXEC
005046     END-PERFORM.
005047     EXEC SQL 
005048         CLOSE RPYVCUR
005049     END-EXEC.
005050     IF (RPYV-RECORDS NOT = BOIS-ARREARS-CTR
                  AND BORMR-REPAY-SCHED NOT = "B") OR 
005051         ALL-P-AMT-9 NOT = BORMR-UNPD-PRIN-BAL OR
005052         ALL-I-AMT-9 NOT = BORMR-CAP-UNPD-INT OR
005053         ALL-W-AMT-9 NOT = BOIS-UNPD-ARR-PRN-BAL OR
005054         ALL-A-AMT-9 NOT = BORMR-UNPD-ARRS-INT-BAL OR
005055         ALL-E-AMT-9 NOT = BOIS-UNPD-INT-ARR-PRN
005056        MOVE ALL-P-AMT-9 TO ALL-P-AMT-Z
005056        MOVE ALL-I-AMT-9 TO ALL-I-AMT-Z
005056        MOVE ALL-W-AMT-9 TO ALL-W-AMT-Z
005056        MOVE ALL-A-AMT-9 TO ALL-A-AMT-Z
005056        MOVE ALL-E-AMT-9 TO ALL-E-AMT-Z
005057        MOVE "Y" TO RPYV-HAS-ERR
005058     END-IF.
005059     EXIT.  
005060        
005061                  
005062 
005063         
